[
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇦🇪 TON HAS JUST PARTNERED WITH UAE TO OFFER 10 YEAR GOLDEN VISA TO TON STAKERS.\n\n- STAKE $100,000 $TON FOR 3 YEARS \n- 10 YEARS DUBAI GOLDEN VISA \n- SPOUSE / FAMILY INCLUDED\n- $35,000 GOVT FEES \n\nMASSIVE FOR CRYPTO ADOPTION 🚀",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\nSAYLOR ABOUT TO BUY MORE BITCOIN \n\nSEND IT 🚀",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "IMAGINE SELLING BITCOIN NOW WHILE \nITS CONSOLIDATING JUST  BELOW ITS PREVIOUS ALL-TIME HIGH\n\nNEW ALL-TIME HIGH IS LOADING 🚀",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Fuck all these memecoin rugs \n\nWe want utility Altseason !!!!",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇺🇸 ELON MUSK HAS OFFICIALLY ANNOUNCED THE FORMATION OF ‘AMERICA PARTY.’",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "ETH OUTPERFORMED BTC IN A QUARTER FOR THE FIRST TIME SINCE Q4 2022.\n\nIS THIS THE REVERSAL WE'RE WAITING FOR?",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "STOCKS ARE HITTING NEW ALL-TIME HIGH AHEAD OF THE SEPTEMBER POTENTIAL FED RATE CUT\n\nBITCOIN WILL FOLLOW!",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "FUD is temporary and fake \n\nFOMO is real and strong \n\nJust check how many and how much \nall these big companies are buying for \nTheir treasuries every week. Bears will\nget slaughtered as soon as QE and rate\ncuts start in Q3-Q4  \n\nBitcoin is going to $200,000 in 2025",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🐋 A WHALE BOUGHT 567 BTC WORTH $61.1 MILLION TODAY.\n\nWHILE PEOPLE PANIC SOLD DUE TO 80K BTC TRANSFER, SMART MONEY BOUGHT THE DIP.",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE STRANGE REALITY OF BEING A $TSLA SHAREHOLDER IN 2025\n\nIt’s been hard to explain what it feels like holding Tesla right now. I haven’t lost conviction in what the company is trying to do -- I still believe it’s one of the most important players in energy, autonomy, and robotics -- but I’d be lying if I said the noise around it hasn’t made me hesitate.\n\nI haven’t added to the position in a while. Not because I think the company has lost its way, but because the surrounding narrative has become so chaotic it’s hard to think clearly about the actual innovation happening inside the business. And when that happens -- when the signal gets drowned out by everything else -- I’ve learned it’s usually a good time to step back and size down.\n\nI get why Elon’s making the moves he’s making. It’s not random. It’s strategic. He’s targeting leverage points that most people overlook -- using the same kind of systems thinking that built Tesla and SpaceX in the first place. But I didn’t invest in a political movement. I invested in a company that was changing the way the world moves and stores energy. And it’s exhausting watching that mission get sidelined in headlines that have nothing to do with autonomous driving or Optimus or Dojo or battery innovation.\n\nThere’s a version of the next two years where Tesla stays laser-focused and delivers. That version is still very much possible. But there’s also a version where politics and media drama keep pulling the narrative off-course. And I don’t know how to price that, other than to stay underexposed and patient.\n\nA lot of what’s happening right now has nothing to do with Tesla’s actual mission -- it’s a context problem, not a fundamentals one. Elon’s public profile is so polarizing that even the most transformative work gets overshadowed. The criticisms -- especially from figures like President Trump -- aren’t rooted in the tech, they’re political theater. And unfortunately, in an attention economy, the noise often wins.\n\nBut the truth is, Tesla is quietly building the neural infrastructure for autonomous mobility and intelligent robotics at global scale. This isn’t about selling cars -- it’s about training fleets, coordinating edge inference, and building a vertically integrated AI network that spans vehicles, humanoids, and energy systems. While the narrative drifts, the real work continues -- and it’s decades ahead of where the rest of the world is even looking. But you’d never know it with the way people talk. The conversation’s stuck in the mud -- personality politics, subsidy arguments, clickbait headlines -- all while Tesla is quietly building the AI network for mobility and robotics. Real autonomy. Real humanoid deployment. Real-time decision loops at the edge. That’s the game. And no one’s paying attention.\n\nI still back the mission. Always have. But belief doesn’t mean blind exposure. When a story gets this noisy -- when execution starts competing with narrative distortion -- I pull back. Not because the fundamentals aren’t there, but because position sizing is how you survive long enough to be right.",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$TSLA ELON MUSK FILES FEC PAPERWORK -- THE AMERICA PARTY IS HAPPENING",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "You might be asking -- why does $QQQ keep catching a bid when most of their PEG ratios are above 2.0?\n\nThe market’s not just paying for current growth. It’s pricing in future margin expansion driven by AI -- leaner OpEx, workforce reduction & a productivity boom that could re-rate earnings far above current estimates.",
    "bias": "Recency Bias"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PEG RATIO IS THE SLEEPER VALUATION METRIC MOST IGNORE\n\nPeter Lynch loved it for a reason.\nUnder 1 = mispriced growth. Over 2 = danger zone.\n\nHere’s how Big Tech stacks up 🧐\n\n$AMZN, $MSFT, $GOOGL, $AAPL, $NVDA, $TSLA, $META, $CRM, $ORCL, $NFLX, $ASML, $TSM, $AMD, $ADBE, $QQQ",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "BIGGEST MISTAKE INVESTORS MAKE\n\nThinking markets stay fragmented. They don’t. Every tech shift ends in dominance\n\n• $AMZN AWS took over cloud\n• $GOOGL became search\n• $NVDA became AI’s engine\n• $META became social\n• $NET is building the new internet\n• $PLTR became AI’s OS",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@StockSavvyShay",
    "text": "10 BIGGEST WINNERS FROM THE BIG BEAUTIFUL BILL ACT\n\n1. $NVDA | NVIDIA\n2. $TSM | Taiwan Semiconductor\n3. $PLTR | Palantir\n4. $AVGO | Broadcom\n5. $RKLB | Rocket Lab\n6. $ASTS | AST SpaceMobile\n7. $EOSE | Eos Energy\n8. $MU | Micron\n9. $VRT | Vertiv\n10. $OKLO | Oklo",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$TSLA CEO MUSK LAUNCHES THE “AMERICA PARTY” -- SAYING IT’S TIME TO GIVE FREEDOM BACK TO THE PEOPLE",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Here are the key levels to watch for $HIMS on a potential pullback -- based on the Price Action Concepts Indicator from LuxAlgo  👇",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$HOOD now makes up ~40% of my short-term trading portfolio on Blossom  😳\n\nblossomsocial.com/savvyshay?…",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Check it out here:\n\nrebrand.ly/Shay_Pros",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE POWER OF RETAIL HAS NEVER BEEN STRONGER\n\nBuy-the-dip is up 32% YTD -- the best run in ~40 years.\n\nWhat changed? Retail got sharper. Faster.\n\nNames like $HIMS, $PLTR, $RKLB, $HOOD, $SOFI, $ASTS, $OSCR & $OKLO aren’t FOMO -- they’re conviction plays that are landing.",
    "bias": "Contrarian"
  },
  {
    "user": "@jonnajarian",
    "text": "Happy Birthday, America! 🇺🇸\nWishing everyone a joyful and meaningful #IndependenceDay! I’m enjoying time at the lake with friends and family — and feeling incredibly grateful for the freedoms we enjoy in this great nation.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@biancoresearch",
    "text": "No new “fresh money” just a money market fund substitute without offfering an interest rate. Bad deal\n\nAnd before you tell me about lending on Aave, are you sure they are issuing on the ethereum blockchain?",
    "bias": "Recency Bias"
  },
  {
    "user": "@biancoresearch",
    "text": "And tips in overtime will no longer be taxed.",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Thanks, Tom. Much appreciated @dlacalle",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Knowing the timing of the context is critical, otherwise your overall portfolio strategy will struggle",
    "bias": "Overconfidence"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Nvidia CEO Jensen Huang: \"We’re working towards a day where there will be billions of robots, hundreds of millions of autonomous vehicles, and hundreds of thousands of robotic factories that can be powered by Nvidia technology.\"\n\n$NVDA",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Barclays estimates that Alphabet’s  AI tokens processed across its platform in Q1 were 634 trillion, up 97% QoQ.",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Micron said last week that it is now shipping HBM to four customers in high volume, spanning GPUs and ASIC platforms, with HBM4 expected to ramp in 2026.\n\n$MU",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Apple, Meta, Nvidia and Alphabet collectively spent nearly $75B on share buybacks in Q1, or 25% of all buybacks in the S&P 500 in the quarter. \n\n$AAPL $META $NVDA $GOOG",
    "bias": "Contrarian"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Cloudflare predicts that by 2026, more than 80% of enterprises will use genAI APIs, models or apps, up from just 5% in 2023.",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Chart patterns help",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "This week's calendar",
    "bias": "None"
  },
  {
    "user": "@IManghaila",
    "text": "Accumulation Characteristics.",
    "bias": "None"
  },
  {
    "user": "@IManghaila",
    "text": "Golden Zone.",
    "bias": "None"
  },
  {
    "user": "@IManghaila",
    "text": "Order Block Patterns.",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Here is my 30 year Cheat Sheet.  It takes time to develop all of these approaches to turn market.  Learn and do a few as early as possible.  U don’t need them all",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Good morning",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "When u go from race/trade/life performance to just trying to cross the finish line.  \n\nA very personal story! \n\npiped.video/watch?v=Z2KUoBr2…",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Purpose is important!",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "nitter.net/i/broadcasts/1vOGwXEbY…",
    "bias": "Contrarian"
  },
  {
    "user": "@leadlagreport",
    "text": "The ATAC Credit-On/Credit-Off Index (JOJO.INDEX) rotates between long-term US treasuries & high yield junk debt on a weekly basis based on the performance of Utilities and the broad stock market.     \n\nAs of Friday, the Index remains junk-on.     \n\nmarketvector.com/indexes/cus…",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@leadlagreport",
    "text": "Being fit in your 40s is a bigger flex than being fit in your 20s.\n\nFew understand this.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "👑",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "There is no honor in being mediocre.\n\nBe more.\n\nNow get the fuck back up.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Most people are weak.\n\nKeyboard warriors who will never understand how far away they are from their own potential because they blame others for their problems.\n\nTake responsibility, and get the fuck back up.\n\nBe the phoenix.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Do not relent.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "I’m willing to die to do what I set out to do.\n\nThis is what it takes.",
    "bias": "None"
  },
  {
    "user": "@YYRisen",
    "text": "Mainstream advice preaches DCA. \n\nUnpopular fact:\n\nLump-sum investing outperforms DCA about two-thirds to three-quarters of the time because more money is working in the market sooner.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@tradingcrows169",
    "text": "catching me off guard, not seeing all the comments of people who don't understand mgmt by prospectus",
    "bias": "None"
  },
  {
    "user": "@mm_molnar",
    "text": "Almost 100% of handouts get spent and either bid up the price of billionaires’ assets or end up as corporate profits for companies owned by billionaires.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "For me this is the most important month of the year.",
    "bias": "None"
  },
  {
    "user": "@pmddomingos",
    "text": "Well know we’ve reached AGI when ChatGPT fires Sam Altman.",
    "bias": "None"
  },
  {
    "user": "@LeadLagMedia",
    "text": "A survey by Patriotic Millionaires UK of over 2,000 millionaires in G20 countries found that more than half supported a 2% tax on wealth.",
    "bias": "Loss Aversion"
  },
  {
    "user": "@leadlagreport",
    "text": "👑",
    "bias": "None"
  }
]