[
  {
    "user": "@Ashcryptoreal",
    "text": "Gold is currently at its 40-year trendline resistance.\n\nA rejection from this level will send Bitcoin to new highs.",
    "bias": "None",
    "id": "1979928717292888448"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING: $143,930,000 in shorts has been liquidated in the past 24 hours.",
    "bias": "None",
    "id": "1979919436887781854"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "$ETH BULL RUN ISN'T OVER YET.",
    "bias": "None",
    "id": "1979891345629303265"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "ETH IS FOLLOWING THE 5 WAVES PRICE ACTION\n\nThe corrective waves (2 and 4) for ETH appear to be complete, each showing a similar price action pattern.\n\nIf this Elliott Wave structure plays out, the next move should be an impulsive Wave 5, potentially pushing ETH toward the $7K–$8K range.",
    "bias": "None",
    "id": "1979835308847079732"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING: 🇯🇵Japan is considering revising regulations to let banks hold and trade Bitcoin.",
    "bias": "None",
    "id": "1979769804547662070"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n$1 BILLION USDT JUST MINTED.",
    "bias": "None",
    "id": "1979644357633548455"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨Liquidation Alert: $10,200,000,000 in shorts will get liquidated if $BTC pumps 10%.\n\nPraying for bullish weekly close.",
    "bias": "Euphoria / Greed",
    "id": "1979601804058103926"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Gold monthly RSI at 50-year high.\n\nQT will end soon.\n\n2 rate cuts in 2025.\n\nUS-China trade deal is coming.\n\nCrypto sentiment is at extreme fear.\n\nThis is not the time to be bearish.",
    "bias": "Panic / Capitulation",
    "id": "1979558575476477962"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Bitcoin is now the most undervalued against Gold since the FTX crash.\n\nDo what you can with this information.",
    "bias": "None",
    "id": "1979533291700281788"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "The biggest alt gains always happen after the $ETH ATH.\n\nIn 2021, $ETH hit a new ATH in Jan 2021.\n\nAfter that, alts like $MATIC, $MANA, $SHIB, $DOGE, and $SOL pumped 10x-100x.\n\nIf you're expecting an Altseason, pray for an $ETH breakout above $5,000.\n\nOnce this happens, alts will have their best rally.",
    "bias": "FOMO",
    "id": "1979517335842308398"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BITCOIN is forming a “Hidden Bullish Divergence” in the 1W-Timeframe \n\nLet’s hope for this to play out in the coming weeks",
    "bias": "Euphoria / Greed",
    "id": "1979484902904254831"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING: 🇺🇸 Tom Lee's Bitmine Immersion just bought $281 million worth of Ethereum.",
    "bias": "None",
    "id": "1979410635185348833"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Tom Lee says Bitcoin $BTC is going to $250K in the next ~70 days.\n\nIf that plays out, we’re about to see a face melting risk-on rally into year-end.",
    "bias": "None",
    "id": "1979909499348467843"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN is trading at its lowest valuation in over a decade but it’s building more than people realize.\n\nAWS keeps scaling, robotics keep expanding & quantum is already in motion through its research lab & Amazon Braket platform.",
    "bias": "None",
    "id": "1979894697469550858"
  },
  {
    "user": "@StockSavvyShay",
    "text": "The cloud race is really just the AI race now\n\n$AMZN AWS controls 30% global share but $MSFT is closing fast w/ Azure feeding off OpenAI workloads & $GOOGL sits in third but growing faster as Gemini pushes into enterprise.\n\nWinner is whoever turns compute into intelligence first",
    "bias": "None",
    "id": "1979879565972656515"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Everyone got excited about the first $NVDA Blackwell chip made in the U.S. but truth is it still has to go to Taiwan & pass through $TSM for advanced packaging before it’s complete. \n\nUntil we can handle that stage at home then it’s not full production but just the first step.",
    "bias": "None",
    "id": "1979845238832365816"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$OSCR CEO said the individual insurance market could reach 120 million Americans within a decade. \n\nThat would make personal plans the new default for coverage & turn platforms like Oscar into the infrastructure layer for how health insurance is bought & managed in the U.S.",
    "bias": "None",
    "id": "1979831546594087375"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Yesterday I did an interview with a journalist about what the next decade of the AI trade looks like. \n\nEvery market cycle starts with abundance and ends with constraint. The AI trade is no different where each leg reveals the next bottleneck: \n\n• Compute (2023–2025)\n\nThis is the silicon era where $NVDA, $AMD, $TSM & $ASML are building the new industrial base of the digital economy. Compute is capacity so whoever controls it owns time.\n\n• Power (2025–2027) \n\nThen comes power where $VST, $CEG, $NRG & $NEE is about how it’s delivered, scaled and managed. This phase is about generation capacity & transmission lines.\n\n• Cooling & Networking (2026–2028) \n\nThis phase is about keeping GPUs connected and efficient. $VRT, $AVGO, $ALAB, $MRVL & $CRDO are scaling the plumbing that moves data and manages heat. Optical interconnects, switches,m and liquid cooling systems all converge here where the next speed limit is heat and bandwidth.\n\n• Data Movement (2028–2030) \n\nAfter the pipes are built, attention shifts to how information flows where $SNOW, $PLTR, $MDB, $NET & $ORCL are building the operating rails for AI workflows, moving unstructured data across every enterprise and every cloud. Intelligence becomes a utility.\n\n• Quantum & Energy Convergence (2030+)\n\nQuantum expands the compute stack, sitting beside GPUs to solve the hardest optimization problems with $IONQ as my favorite name in the group. Nuclear gives the grid true baseload power by delivering the energy density needed to keep AI infrastructure running nonstop. So when you put it together its quantum breaks computational limits and nuclear removes power constraints. \n\nBut this last stage of the AI trade has been bid up too quickly. It’s the frothiest pocket of the AI theme right now that’s priced for perfection before the infrastructure even exists. The timeline is real but the market has sprinted years ahead of it. \n\nEvery leg of this cycle will have its winners but the edge comes from spotting the constraint before it becomes consensus.",
    "bias": "None",
    "id": "1979531407010472224"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NBIS, $IREN, $CIFR & $CRWV are the GPU landlords turning megawatts into rentable compute. \n\nThis phase marks the birth of the AI utility class where companies that sell compute the way traditional utilities sell electricity. \n\nFits adjacent to the power stage.",
    "bias": "None",
    "id": "1979545564829155749"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$TSLA is leading the next leg of the AI cycle where this whole thing becomes very real with Physical AI.\n\nThe first phase was compute where everything lived inside the data center while the next phase is about intelligence moving into the physical world where machines, cars & robots that can see, think & act on their own.\n\nTesla is the clear category leader since Optimus, FSD & Tesla Energy are now part of one unified narrative of converting AI into motion and productivity.",
    "bias": "None",
    "id": "1979542157586296907"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE TOP 15 GROWTH PERFORMERS OF 2025\n\n1. $OKLO +669%\n2. $IREN +518%\n3. $MP +418%\n4. $QBTS +356%\n5. $OPEN +348%\n6. $NVTS +311%\n7. $NBIS +310%\n8. $CIFR +304%\n9. $ASTS +296%\n10. $HOOD +249%\n11. $PL +224%\n12. $EOSE +209%\n13. $RGTI +204%\n14. $ONDS +197%\n15. $PGY +185%",
    "bias": "None",
    "id": "1979518685996781825"
  },
  {
    "user": "@StockSavvyShay",
    "text": "China still controls almost all rare earth production & refining but the U.S. is starting to rebuild its own chain:\n\n• $UUUU separating oxides at commercial scale\n• $IPX developing new refining tech to lift throughput\n• $MP leading U.S. output & expanding into full-cycle processing\n• $CRML & $TMRC building integrated mining and refining capacity\n• $USAR & $IDR advancing early-stage exploration across key deposits\n• $AREC recovering rare earths from coal waste to speed domestic supply\n• $USAR & $IDR advancing early-stage exploration across key deposits\n\nRare earths decide who controls the inputs behind AI, energy & defense.",
    "bias": "None",
    "id": "1979509948263350706"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$TSM dropped a video from its Arizona fab showing $ASML EUV machines printing next-gen chips.\n\nEvery wafer that leaves that line runs through ASML proving the U.S. chip buildout still revolves around the same gatekeeper. \n\nASML is still the AI kingmaker.",
    "bias": "None",
    "id": "1979500993487217026"
  },
  {
    "user": "@StockSavvyShay",
    "text": "AI DATA CENTERS WILL USE 12% OF ALL U.S. POWER BY 2030\n\nEvery new AI data center is a power plant disguised as compute & the grid is quietly becoming the new bottleneck in AI scale.\n\nThe next trillion in market cap belongs to whoever controls the power that feeds the chips.",
    "bias": "None",
    "id": "1979490697494348150"
  },
  {
    "user": "@XVanFleet",
    "text": "Just came back from No King rally in DC. Here are my observations.\n\n• it’s true I didn’t  not see a king.\n• The crowd was not that big and street parking was not hard to find.\n• Majority of the people are white.\n• There are too many older people—60s radicals I guess.\n• There were so many costumes it seemed like a Halloween party.",
    "bias": "None",
    "id": "1979658018351677694"
  },
  {
    "user": "@jonnajarian",
    "text": "Funny how at the top of the hour, the protesters vanished. Guess they're embracing capitalism after all. \n\n\"If Soros won't pay overtime I won't march!",
    "bias": "None",
    "id": "1979868283349385544"
  },
  {
    "user": "@Rightanglenews",
    "text": "BREAKING - At exactly 1 PM, all of the “No Kings” protesters in Times Square immediately dispersed. \n\nTotally normal and definitely not astroturfed.",
    "bias": "None",
    "id": "1979615471008673884"
  },
  {
    "user": "@jonnajarian",
    "text": "You get @JellyRoll615 and @PatMcAfeeShow together, you're in for a treat!",
    "bias": "None",
    "id": "1979836497395376193"
  },
  {
    "user": "@jonnajarian",
    "text": "Even with this fantastic play, @PennStateFball didn't have enough to beat @HawkeyeFootball as they lost 25 to 24",
    "bias": "None",
    "id": "1979833282406834197"
  },
  {
    "user": "@biancoresearch",
    "text": "6/6\n\nThe signal from the funding market and bank stocks was that they are worried the Fed drained too much liquidity from the system (QT), and it is not clear whether they appreciate it, the risk of another round of QE, or how to fix it.",
    "bias": "None",
    "id": "1979601321675170047"
  },
  {
    "user": "@biancoresearch",
    "text": "4/6\n\nCash being parked in the New York Fed Reverse Repo Facility ( RRP) sink almost every day is now nearing zero. And, as the arrow below shows, it has really started diving toward zero several weeks ago.\n\nThe RRP is about ten years old. This facility allowed market participants to park cash at the New York Federal Reserve in exchange for competitive interest rates. That rate is currently set 25 basis points below the top end of the Federal Reserve’s target rate. Today, the target range is 4.00% to 4.25%, so the RRP rate is 4.00%.\n\nThe purpose of this facility is to drain excess funds from the financial system (that is, remove liquidity). When money is parked at the Fed, it cannot be re-lent, a process known as rehypothecation, thereby reducing liquidity in the financial system.\n\nWhen RRP is declining, these funds are reintroduced into the financial system, thereby adding liquidity. When the facility’s usage hits zero, as it essentially has, then this “liquidity pump” has run dry.",
    "bias": "None",
    "id": "1979601317577343207"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Who do you trust?\n\nAccording to a Partnership for Public Service survey conducted in March 2025, only 33% of Americans say they trust the U.S. government, while 47% say they do not trust it. \n\nA Gallup survey conducted in July 2025 shows that only 28% of Americans have confidence in major U.S. institutions (a near record-low and the 4th straight year of sub-30%), and that U.S. trust in mass media is at a new low of 28%",
    "bias": "None",
    "id": "1979873046119731349"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The Fam's Top 5 Positions \n#timestamped \n\n*Note: you can see my entire portfolio (ranked by position SIZE) daily via Macro Pro\n\nYou can also get all the Long/Short positions via ETF Pro",
    "bias": "None",
    "id": "1979870242211078463"
  },
  {
    "user": "@KeithMcCullough",
    "text": "REPLAYS (free) Hedgeye Investing Summit Is LIVE This Week app.hedgeye.com/insights/172… via @hedgeye",
    "bias": "None",
    "id": "1979573804159402337"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Sadly, yes. Fortunately, however, this gives us a wide open net to change the world for the better",
    "bias": "None",
    "id": "1979525408979583326"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Great note from a great friend. I appreciate it, Cully. That pic from PLK in the 90s is classic! @PLKingsCCHL",
    "bias": "None",
    "id": "1979524936629649816"
  },
  {
    "user": "@Beth_Kindig",
    "text": "According to BloombergNEF, AWS is planning to nearly quadruple its current 3GW+ capacity to more than 12GW.\n\n$AMZN $GOOG $MSFT $META",
    "bias": "None",
    "id": "1979919616055861581"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Citi also raised its hyperscaler AI capex projection for 2026 by $70 billion, now forecasting $490 billion in spending versus its prior outlook for $420 billion.\n\n$MSFT $META $AMZN $GOOG $NVDA",
    "bias": "None",
    "id": "1979633707159007388"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Citigroup recently raised its big tech AI infrastructure spending forecast by nearly 22%, now seeing more than $2.8 trillion in spending through 2029, compared to its prior view for $2.3 trillion, fueled by aggressive investments from hyperscalers and heightened enterprise appetite.\n\n$NVDA $MSFT $AMZN $GOOG $META $ORCL",
    "bias": "None",
    "id": "1979572660368478626"
  },
  {
    "user": "@RedDogT3",
    "text": "Selected goals and challenges can help get ur mind right for when challenges choose U!",
    "bias": "None",
    "id": "1979917840086933816"
  },
  {
    "user": "@RedDogT3",
    "text": "This week will be interesting!  $spx $spy $qqq all super tight!  Some have opinions which way it resolves.  There will be signs and triggers for those prepared.",
    "bias": "None",
    "id": "1979908410935013819"
  },
  {
    "user": "@RealJGBanks",
    "text": "FULL AI CHAIN TO KNOW\n\nNo Not just chips this is the entire industrial backbone behind AI:\n\nMetals: $MP $CCJ $LTHM $ALB $VALE\nSemis: $NVDA $TSM $AMD $AVGO $ASML $ALAB\nCompute: $NBIS $IREN $CIFR $AMZN $MSFT $GOOGL\nEnergy: $OKLO $VST $NEE $CEG $DUK $SO\nCooling: $VRT $CARR $NVTS $TT\nRobotics; $PATH $RR $SYM $TSLA $ROK $ABB\nData: $PLTR $SNOW $DDOG $AI $MDB\nConnectivity: $RKLB $ASTS $IRDM $LHX $KTOS\nInterface: $MSFT $GOOGL $AMZN $TSLA $META $AAPL $NVDA\n\nFrom metals to models to minds\n\nThis is AI Infrastructure 2.0.",
    "bias": "None",
    "id": "1979730676644765765"
  },
  {
    "user": "@joinfingrad",
    "text": "Trading with RSI (Relative Strength Index) and MACD (Moving Average Convergence Divergence) indicators is a popular strategy that combines momentum and trend analysis to improve trade accuracy and timing.",
    "bias": "None",
    "id": "1979783953214329343"
  },
  {
    "user": "@leadlagreport",
    "text": "What if the private debt stress isn’t a head fake? The boom in non-bank lending—trillions in corporate loans made outside public markets—has long promised steady, high returns, but much of it rests on opaque valuations.\n\nNew Lead-Lag Report Post.\n\nClick: leadlagreport.com/p/cracks-i…",
    "bias": "None",
    "id": "1979635308733112697"
  },
  {
    "user": "@jaker1419",
    "text": "FEW!! \n\nRisk-free rate of return of 25% in an asset class that nobody can explain. In fact, the people pushing it the hardest have absolutely zero understanding of how the current monetary system works, but are 100% certain Bitcoin can replace it.",
    "bias": "None",
    "id": "1979900211724947674"
  },
  {
    "user": "@NtGmblng_Invstn",
    "text": "I started running during COVID and have just kept the habit. What's the point of having emerg kits and guns and ammo if you can't be mobile? It was a wake up call.",
    "bias": "None",
    "id": "1979896030264172926"
  },
  {
    "user": "@leadlagreport",
    "text": "Two of the most powerful words?\n\nI will.\n\nNothing can stop your will.\n\nOnly you.",
    "bias": "None",
    "id": "1979894884481019945"
  },
  {
    "user": "@leadlagreport",
    "text": "All of these people arguing Gold and Bitcoin are a crisis hedge and that the world is headed for a reset.\n\nYou know what’s a crisis hedge?\n\nGetting your ass in shape.\n\nNow shut the fuck up about all your pontifications over things you can’t control and get the fuck after it.",
    "bias": "None",
    "id": "1979889252570997184"
  },
  {
    "user": "@HeavyRainWA",
    "text": "During the 08 crash I set a limit order on $FCX at $40 and the selling was so furious it filled at $38.\nEveryone was so desperate for cash they sold for less than buyers were willing to pay.\nThe good ole days 😢",
    "bias": "None",
    "id": "1979880733624897581"
  },
  {
    "user": "@Solix_Trade",
    "text": "6,584 BTC just woke up after 2–3 years of total silence.\nThat’s the eighth massive move from this age group this week — long-term holders are suddenly restless. Something big is brewing 😏\n#Bitcoin #BTC #Crypto #Blockchain #HODL #Whales #Investing #Finance #CryptoNews #Bullish #Bearish #CryptoMarket #BTCWhales #MoneyMoves #DigitalGold #Trading #Wealth #DeFi",
    "bias": "Loss Aversion",
    "id": "1979833474572804457"
  },
  {
    "user": "@iAm_Divye",
    "text": "I was wildly bullish on gold from 2021 till last month... When everyone started crowding the sacred space. And I am surely going to be wildly bullish on gold very soon again, once we see a crash...",
    "bias": "Euphoria / Greed",
    "id": "1979873443798757401"
  },
  {
    "user": "@leadlagreport",
    "text": "I published an album of songs I wrote a few years back.\n\nReworking some of my tracks.\n\nAlways thought they'd sound better with female vocals.\n\nWhat do you think?",
    "bias": "None",
    "id": "1979361066137325805"
  },
  {
    "user": "@leadlagreport",
    "text": "I was wildly bullish on Gold from October 2023 to April 2025.\n\nThey forget.",
    "bias": "Euphoria / Greed",
    "id": "1979872540580544637"
  }
]