[
  {
    "user": "@StockSavvyShay",
    "text": "OpenAI says the company is on track to unveil its first device in 2H 2026.\n\nThat would mark OpenAI’s first major move from software into dedicated hardware.",
    "bias": "None",
    "id": "2013270326239694915"
  },
  {
    "user": "@StockSavvyShay",
    "text": "10 BIGGEST MOATS IN THE AI ECONOMY\n\n1. $NVDA controls the full-stack AI compute layer from CUDA to Blackwell with 90%+ data center GPU share while inference growth, sovereign AI buildouts & networking attach rates extend the moat beyond training into a recurring enterprise runtime.\n\n2. $PLTR owns the ontology layer that turns messy enterprise data into a shared schema models can reason against with AIP converting pilots into eight-figure production contracts while over 20 years of institutional pattern recognition creates switching costs no competitor can replicate.\n\n3. $TSM operates the only fabs on earth capable of printing 3nm AI silicon at scale with $AAPL, $AMD, $QCOM & $NVDA structurally dependent on capacity that takes years & $40B+ to replicate. \n\n4. $GOOGL core moat is distribution with the ability to ship new AI capabilities instantly across Search, YouTube, Android & Workspace reaching billions of users & over 350M Gemini MAUs without requiring behavior change.\n\n5. $AMZN runs ~30% of global cloud infrastructure pairing Bedrock’s model-agnostic inference with Trainium cost advantages & a logistics + retail data flywheel no pure-play cloud provider can match.\n\n6. $META trained AI on 3.4B+ daily active users behavioral data with Llama open-sourcing the model layer to commoditize competitors while Reels, Advantage+ & WhatsApp Business convert engagement into ad revenue ($175B+ annually) no other platform can target as precisely. \n\n7. $MSFT embedded OpenAI across a productivity stack by monetizing seats through 215M Copilot MAUs, capturing inference workloads in Azure & locking in the developer layer through GitHub as the default AI-native workflow.\n\n8. $ASML builds the only EUV lithography machines capable of printing sub-5nm transistors with a ~$40B backlog, monopoly share in high-NA EUV & an optics supply chain lead no competitor can close this decade.\n\n9. $AAPL controls the device, the distribution & the attention of 2.4B active devices held by high-value users with on-device AI preserving privacy moats while Services revenue compounds at ~13% YoY as the install base monetizes through subscriptions & App Store fees\n\n10. $AVGO supplies the custom AI accelerators & networking silicon connecting GPU clusters with VMware adding software margins & hyperscaler ASIC deals creating recurring design wins independent of $NVDA allocation.",
    "bias": "None",
    "id": "2013265467788697623"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL Gemini API calls have more than doubled to 85B with Gemini reaching ~8M subscribers.\n\nUsage and adoption are accelerating as enterprises standardize Gemini across core workflows.",
    "bias": "None",
    "id": "2013253498704720288"
  },
  {
    "user": "@StockSavvyShay",
    "text": "OpenAI shared this chart to show that AI revenue is scaling almost one-for-one with compute. \n\nGoing from ~0.2 GW to ~1.9 GW (~10x increase in power) maps to revenue growing from ~$2B to ~$20B which implies OpenAI is generating ~$10.5B of revenue per GW. \n\nThe really important detail to remember is that OpenAI doesn’t own this compute but rents it from $MSFT & $ORCL which means every additional GW comes with real margin pressure.\n\nThat’s why this chart reads less like a flex to me and more like a capital pitch since it’s effectively saying growth requires massive compute expansion and massive compute expansion requires massive funding which helps explain why this is circulating as OpenAI works to line up a ~$1.4T infrastructure buildout.",
    "bias": "None",
    "id": "2013250246927962183"
  },
  {
    "user": "@StockSavvyShay",
    "text": "The CEO of DeepMind says there are never enough chips and global compute is nowhere near meeting AI demand\n\nThat’s why $GOOGL & $AMZN are racing to build their own silicon alongside $NVDA & $AMD with AI scaling toward 5B+ users by 2030.\n\nWhat matters now is who can produce tokens at the lowest cost per watt.",
    "bias": "None",
    "id": "2013243748499554551"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Microsoft has more cash on hand than any tech company in the world.\n\nThis gives it the most flexibility to fund multi-year AI capex & lock in power & infrastructure. \n\n• $MSFT +$102B\n• $GOOGL +$98B\n• $AMZN +$94B\n• $NVDA +$61B\n• $AAPL +$55B\n• $META +$44B\n• $TSLA + $42B",
    "bias": "None",
    "id": "2013230446382031069"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Moore’s Law made computers everywhere in the old economy where the AI’s version of Moore’s Law is about making intelligence everywhere. \n\nOnce thinking becomes cheap & abundant then that changes how companies build products, how people work and what software even means. \n\nThat doesn’t mean SaaS is dead but it forces software to evolve from passive tools into systems that can think and act unlocking capabilities that simply weren’t possible a few years ago.",
    "bias": "None",
    "id": "2012998400292372873"
  },
  {
    "user": "@StockSavvyShay",
    "text": "We cover the space economy every week on the Futurum Equities podcast if you if you want to go deeper  ⤵️\n\npiped.video/@FuturumEquities",
    "bias": "None",
    "id": "2012977492362166327"
  },
  {
    "user": "@jonnajarian",
    "text": "\"¡Saludos desde Puerto Rico, 🇵🇷 amigos!  Celebrating Fiestas de la Calle San Sebastián in Old San Juan – half a million to a million people flooding the streets on this tiny island of 3.5M. Great vibes, amazing food, pure joy!  And tonight? DA BEARS take on the Rams in the playoffs at Soldier Field! #ITSNOTANOPTION 📒",
    "bias": "None",
    "id": "2013015944444948792"
  },
  {
    "user": "@jonnajarian",
    "text": "Great to see the support for the Iranian people @patrickbetdavid",
    "bias": "None",
    "id": "2013273886222061637"
  },
  {
    "user": "@jonnajarian",
    "text": "ICE agents using mother nature to deal with Karens",
    "bias": "None",
    "id": "2013264332851736759"
  },
  {
    "user": "@jonnajarian",
    "text": "Who blinked? \nGermany deployed a reconnaissance team of 15 Bundeswehr soldiers to Greenland.  However, they departed just about 44 hours later on Sunday, January 18, 2026, flying out of Nuuk on a civilian flight to Copenhagen.",
    "bias": "None",
    "id": "2013263529982198187"
  },
  {
    "user": "@jonnajarian",
    "text": "\"Those who cannot remember the past are condemned to repeat it\".  \nWealthy exodus and capital flight UK: Reports (Henley & Partners) projected/recorded a net loss of around 16,500 millionaires from the UK in 2025, associated wealth outflows estimated in the tens of billions",
    "bias": "None",
    "id": "2013261851425993019"
  },
  {
    "user": "@jonnajarian",
    "text": "I'll bet Dana White @danawhite loves his ground & pound!",
    "bias": "None",
    "id": "2013256575515832471"
  },
  {
    "user": "@jonnajarian",
    "text": "JC should we put a steak dinner on tonight's game? @JC_ParetsX",
    "bias": "None",
    "id": "2013239960602599704"
  },
  {
    "user": "@MLFootball",
    "text": "POWERFUL: Over 30 #Patriots & #Texans players gathered together on the field after the game got down on a knee & PRAYED TO GOD.\n\nStar quarterbacks Drake Maye and CJ Stroud put everything aside to praise the Lord & thank Him for their blessings.\n\nBeautiful❤️",
    "bias": "None",
    "id": "2013029938056622410"
  },
  {
    "user": "@jonnajarian",
    "text": "Rams run a twist and go right past the O-Line & are in Caleb's face for 20+ yards, \n\nHe's back peddling, defenders closing, he cannot step up and he hits Kmet for 6? F-me boys & girls, that's the best throw ever.",
    "bias": "None",
    "id": "2013229631449575620"
  },
  {
    "user": "@RedDogT3",
    "text": "$spx futures-50 as markets don’t like the new Tariff News for now. At least we are closed tomorrow",
    "bias": "None",
    "id": "2013038473473614279"
  },
  {
    "user": "@RedDogT3",
    "text": "Most of these are in my “go to list”\nI frame the set up daily and weekly for cash flow",
    "bias": "None",
    "id": "2012920863738196176"
  },
  {
    "user": "@RedDogT3",
    "text": "The 20@520 into the #630club is a great way to get ready/prepared for the day. \nThanks for subscribing above to get locked in. We are off Monday but I’ll add Friday this week.",
    "bias": "None",
    "id": "2012918602190487790"
  },
  {
    "user": "@RedDogT3",
    "text": "I use the 8/21day. The 5 is for the Super / super active",
    "bias": "None",
    "id": "2012893237405495801"
  },
  {
    "user": "@joinfingrad",
    "text": "Trading with Keltner Channels and ADX together combines trend direction and strength. The Keltner Channel shows price volatility and potential breakout levels, while the ADX (Average Directional Index) measures trend strength.",
    "bias": "FOMO",
    "id": "2012792826065478046"
  },
  {
    "user": "@RedDogT3",
    "text": "It takes time. But learning how to use multiple accounts thru life can help u build wealth.  It can also help u create cash flow and trade for a living.",
    "bias": "None",
    "id": "2012880912157909325"
  },
  {
    "user": "@leadlagreport",
    "text": "Tech investing is no longer just about growth. It’s about national security, supply chains, and who you’re aligned with.\n\nThis Lead-Lag Live conversation explains why the next tech cycle may look nothing like the last one.\n\nRead here 👇\n leadlagreport.com/p/aram-bab…",
    "bias": "None",
    "id": "2013249621783413107"
  },
  {
    "user": "@leadlagreport",
    "text": "Markets didn’t wait for the headlines.\n\nUtilities quietly flipped risk-off before the Greenland tariff shock hit.\n\nDefensive positioning often shows up before volatility does.\n\nThis may be the catalyst equities needed.\n\nRead why 👇\n leadlagreport.com/p/defensiv…",
    "bias": "None",
    "id": "2013241435554726248"
  },
  {
    "user": "@ATX_fight_club",
    "text": "European stocks are down 1% or less. Never forget.",
    "bias": "None",
    "id": "2013237016264143283"
  },
  {
    "user": "@leadlagreport",
    "text": "They will literally take over Greenland to distract you from the Epstein files",
    "bias": "None",
    "id": "2013232926779990065"
  },
  {
    "user": "@leadlagreport",
    "text": "I have heard many of you saying I have been quiet regarding Japan.\n\nBe not afraid.\n\nI’m going to annoy the ever living fuck out of you, your pet hamster, and your wife’s sister’s husband twice removed soon enough.",
    "bias": "None",
    "id": "2013181467573027034"
  },
  {
    "user": "@leadlagreport",
    "text": "Looks like they gonna use Greenland to crash stocks to save bonds fam",
    "bias": "None",
    "id": "2013179403035902195"
  },
  {
    "user": "@leadlagreport",
    "text": "PLEASE GIVE ME PERMISSION DEAR GOD.\n\nPLEASE GIVE ME PERMISSION TO BE ANNOYING AS FUCK.",
    "bias": "None",
    "id": "2013051340277059905"
  },
  {
    "user": "@leadlagreport",
    "text": "I didn’t have Greenland crashing the stock market on my bingo card",
    "bias": "None",
    "id": "2013047845650153640"
  }
]