[
  {
    "user": "@StockSavvyShay",
    "text": "TOP 5 MOST CONTRACTED AI-COMPUTE CAPACITY IN DEVELOPMENT\n\nContracted capacity is becoming the single most predictive metric in the entire AI-compute economy.\n\n1. $IREN ~2.9GW \n2. $CRWV ~2.9GW \n3. $CIFR ~2.6GW \n4. $NBIS~2.5GW \n5. $BITF ~1.9GW\n\nThese operators locked in land, power & interconnection long before the rest of the market understood how tight the grid would get so now that AI demand is exploding, they are monetizing the actual bottleneck in this cycle since  power has become the pricing layer of intelligence. \n\nThis is why billions of dollars in contracts from $GOOGL, $MSFT, $META, $AMZN & $ORCL are flowing to the few companies that can deliver energized capacity on time.",
    "bias": "None",
    "id": "1990078919144616208"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN AWS brought Project Rainier online and it now stands as one of the largest operational AI supercomputers in the world",
    "bias": "None",
    "id": "1990039288680173692"
  },
  {
    "user": "@StockSavvyShay",
    "text": "If you want the full context behind how Daniel & I are thinking about the AI economy, we walk through these names in detail on our weekly episodes.\n\nYou can find the channel below: \n\npiped.video/@futurumequities",
    "bias": "None",
    "id": "1989762799489397035"
  },
  {
    "user": "@StockSavvyShay",
    "text": "This is exactly what I have been saying about $PLTR every time the media asks. \n\nThe critics are still anchored to near-term multiples while Palantir’s model scales with global AI CapEx which will be counted in the trillions over the next decade. \n\nIf this buildout continues (and it will) then Palantir becomes an index on the productivity gains of the entire AI revolution.",
    "bias": "None",
    "id": "1989747485863272735"
  },
  {
    "user": "@StockSavvyShay",
    "text": "One rough week and everyone suddenly thinks the AI trade is broken.\n\nMeanwhile $GOOGL, $MSFT, $META & $AMZN just spent this earnings cycle saying power is the new pricing layer of intelligence.",
    "bias": "None",
    "id": "1989738849585754198"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Anyone saying China has a real competitor to $NVDA shows they don’t actually understand the AI economy because the U.S. still controls the performance curve. \n\nChina’s advantage is the speed of its power buildout & in an AI world where energy becomes the ceiling then that is the reason we have to take them seriously in this race.",
    "bias": "None",
    "id": "1989726886843617488"
  },
  {
    "user": "@StockSavvyShay",
    "text": "When CEO Dan Roberts said the company is only using ~2% of its total capacity, it instantly clarified why $IREN is one of my core horses in the AI race.\n\nIf that tiny slice of the footprint can already support 23K GPUs then scaling toward full utilization means they can expand compute by an order of magnitude without rebuilding anything. \n\nThat is a completely different challenge than the rest of the sector which has to construct, permit & power entirely new infrastructure just to keep up.",
    "bias": "None",
    "id": "1989712095714390278"
  },
  {
    "user": "@StockSavvyShay",
    "text": "UPDATED DCA PLAN \n\n1. $META | Meta\n2. $MELI | MercadoLibre\n3. $AXON | Axon\n4. $NBIS | Nebius\n5. $RKLB | Rocket Lab\n6. $SOFI | SoFi\n7. $IREN | IREN Limited\n8. $BMNR | BitMine\n9. $CIFR | Cipher\n10. $ONDS | Ondas",
    "bias": "None",
    "id": "1989703922492346516"
  },
  {
    "user": "@StockSavvyShay",
    "text": "A bullish setup for me is when the 8-day EMA is above the 21-day EMA & the stock is holding both the 50-day & 200-day SMA so both momentum + structure are moving in the same direction.\n\nIf the only level a stock is holding is the 200-day SMA then the long-term trend is still intact but the momentum has faded so I treat it as a hold.\n\nWhen the price breaks below all three levels then that is when I consider the trend bearish because the short-term, intermediate & long-term signals are all pointing the same way.",
    "bias": "Euphoria / Greed",
    "id": "1989699024119894020"
  },
  {
    "user": "@StockSavvyShay",
    "text": "KEY LEVELS TO WATCH FOR THE FINTWIT FAVORITES\n\nBullish | $NVDA, $AMD, $EOSE, $OPEN\n\nHold | $TSLA, $PLTR, $IREN, $CIFR, $NBIS, $ONDS, $OKLO, $RKLB, $ASTS, $IONQ, $HOOD, $SOFI, $TEM\n\nBearish | $ACHR, $OSCR, $HIMS",
    "bias": "Euphoria / Greed",
    "id": "1989696334451151138"
  },
  {
    "user": "@StockSavvyShay",
    "text": "5 REASONS WHY $NBIS, $IREN, $CIFR, $WULF & $GLXY ARE GETTING HIT THIS WEEK\n\n1. The $APLD bond blowup broke the dam & exposed the weakest link in the AI-infra chain.\nA 10% yield on more than $2B of debt with only $634M of equity is the market telling you the model doesn't work without cheap money. Especially when they're paying $275M a year in interest alone on a ~$300M rev base so once the market sees a structure that fragile, it revalues the entire sector because it shows what happens when debt-funded expansion runs into expensive money.\n\n2. The same dollar of AI demand is effectively being financed twice.\nApplied Digital borrows heavily to build data centers while their biggest customers $CRWV is also borrow heavily to rent that same capacity, so one balance sheet is stacked on top of another. When both sides of the relationship are levered then any credit stress on the tenant becomes credit stress on the developer & I think that's exactly what the market reacted to this week.\n\n3. The fragility now sits in the mismatch between power, GPUs & timelines.\nThese data centers cannot generate returns until they have power, grid interconnection & the GPUs required to fill capacity so any delay pushes rev out while interest costs start immediately so lenders are now beginning to question whether the project will produce cash fast enough to service the debt.\n\n4. Every industrial revolution goes through this exact cleanup cycle.\nRailroads expanded faster than financing structures could handle then telecom overbuilt fiber before demand arrived then cloud infra front-loaded capital years before returns materialized & the same pattern is emerging here. Capital intensity outruns return visibility, leverage magnifies every hiccup & weak operators lose access to funding long before the winners do. Markets are simply doing what they always do in a capital-heavy boom so I don't see this as a big deal and very healthy. \n\n5. The AI Utility trade is not ending but entering its first real maturity test.\nThe market is demanding proof that these digital power plants can earn their cost of capital & the winners will consolidate the rest. I’ve chosen my horses in this race & will be monitoring the thesis closely as it develops.",
    "bias": "None",
    "id": "1989686498745373168"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE TOP GROWTH PERFORMERS OF 2025\n\n1. $OPEN +408%\n2. $IREN +372%\n3. $OKLO +360%\n4. $MP +276%\n5. $HOOD +229%\n6. $CIFR +209%\n7. $NBIS +202%\n8. $MU +193%\n9. $ASTS +191%\n10. $EOSE +184%\n11. $PL +182%\n12. $QBTS +181%\n13. $ONDS +180%\n14. $JMIA +178%\n15. $QS +159%",
    "bias": "None",
    "id": "1989676728403530008"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN is near its lowest valuation in more than a decade. \n\nWe aRe sO iN a BuBbLe.",
    "bias": "None",
    "id": "1989669421879890040"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Jeff Bezos basically said that if the AI economy keeps driving energy demand higher then $AMZN will eventually need data centers in space because Earth will not supply enough power.\n\nThe early pieces of that space economy are already taking shape with $RKLB building the logistics layer & $ASTS extending connectivity.",
    "bias": "None",
    "id": "1989660707252797508"
  },
  {
    "user": "@jonnajarian",
    "text": "Another great night at @PAWSChicago very special Fur Ball at the Drake Hotel tonight. For 24 years we've helped raise money for the no-kill shelter in Chicago",
    "bias": "None",
    "id": "1989520034864271463"
  },
  {
    "user": "@biancoresearch",
    "text": "Friday was the second-largest outflow day (top panel) since the Spot BTC ETFs started trading in January 2024.",
    "bias": "None",
    "id": "1989802746296635442"
  },
  {
    "user": "@biancoresearch",
    "text": "Why prices are angering the public more than jobs, and why prices must take precedent over jobs.",
    "bias": "None",
    "id": "1989689798408212869"
  },
  {
    "user": "@biancoresearch",
    "text": "Paging @donnelly_brent \n\nDo I buy stocks or short ski manufacturers?",
    "bias": "None",
    "id": "1989687666946801869"
  },
  {
    "user": "@KeithMcCullough",
    "text": "It's just the math, not my religion. USD vs. Bitcoin correlation at -0.74. \n\nFractals don't care about your laser-eyed conviction. \n\nProcess beats panic. Receipts beat narratives. Every. Single. Time.",
    "bias": "None",
    "id": "1990035933782261825"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Can’t “see” what The Signal sees? That’s human.\n\nOur edge = turning disorder into direction.\n\nSignal → Quad → Portfolio",
    "bias": "None",
    "id": "1990034555751846150"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Most people do not listen with the intent to understand; they listen with the intent to reply.\n- Stephen Covey",
    "bias": "None",
    "id": "1990027687843279018"
  },
  {
    "user": "@KeithMcCullough",
    "text": "And some people say I'm \"too hard  on the Fed\"",
    "bias": "None",
    "id": "1990013278949663074"
  },
  {
    "user": "@KeithMcCullough",
    "text": "PODCAST: The HAM is LIVE ! #P3 (Preserve & Protect The Pile)",
    "bias": "None",
    "id": "1989795970595582322"
  },
  {
    "user": "@KeithMcCullough",
    "text": "CHART OF THE DAY: Hubble Ranks for Major Asset Classes and Sub-Classes app.hedgeye.com/insights/174… via @hedgeye",
    "bias": "None",
    "id": "1989651518002532536"
  },
  {
    "user": "@brooklynboy436",
    "text": "@KeithMcCullough rewatching Q4 mid quarter review. Those YoY CPI projections. Absolutely mouth watering!",
    "bias": "None",
    "id": "1989502434386088008"
  },
  {
    "user": "@Beth_Kindig",
    "text": "For 2026, Morgan Stanley projects a sharp ramp in $NVDA GB200/300 rack shipments to 60,000 to 70,000, more than doubling from its 2025 forecast for 28,000 racks.",
    "bias": "None",
    "id": "1989783740260733108"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Nvidia’s $NVDA GB200/300 rack shipments are estimated to be 14,000 to 15,000, per Morgan Stanley, up from 8,000 to 8,500 in Q3.",
    "bias": "None",
    "id": "1989752002721780192"
  },
  {
    "user": "@RedDogT3",
    "text": "I’m doing a free webinar 8:00 pm This Monday!  Tune in!",
    "bias": "None",
    "id": "1990058437552517616"
  },
  {
    "user": "@RedDogT3",
    "text": "Red Dog Reversal can signal major trend changes in stocks & indices.\n\nThere will be plenty to spot in the week ahead.",
    "bias": "None",
    "id": "1989700917608751583"
  },
  {
    "user": "@RedDogT3",
    "text": "If you thought the #630club yesterday/Friday provided value.  If it gave u names and levels to make money.  I’d be willing to go from just Monday/Thursday and add Friday’s if U subscribe above.  At least click it and read. \n\nWin the morning. To win the day!",
    "bias": "None",
    "id": "1989686992183947574"
  },
  {
    "user": "@RedDogT3",
    "text": "Stop losses are important when the reason ur in a trade gets invalidated.",
    "bias": "None",
    "id": "1989684491724505391"
  },
  {
    "user": "@RedDogT3",
    "text": "If u want change!  U need to make changes!",
    "bias": "None",
    "id": "1989682375022784573"
  },
  {
    "user": "@hervevancaloen",
    "text": "Unlike four decades ago--when all that mattered was market share--Japan Inc is now focused on profit margins.\nCorporate Japan beats odds to clinch record profits, helped by AI boom asia.nikkei.com/business/bus… via @NikkeiAsia",
    "bias": "None",
    "id": "1990076460963439086"
  },
  {
    "user": "@NADbalancer",
    "text": "NAD+ as a therapeutic is grossly underrecognized/underused, yet it’s been known about and clinically administered since at least the late 1950s/early 60’s.\n\nPublic funds should be being aggressively applied to broadly research observed clinical benefits for application across multiple domains (metabolic performance, stroke, migraine, post-concussive syndrome, cardiovascular health, chemical dependency, PTSD, mood/cognition, cellular repair/anti-aging).  \n\nThe reality is that because it’s a perfect natural coenzyme, and can’t be patented or synthetically improved, full awareness through appropriately funded studies could lead to a multibillion dollar competitive impact on Pharma profits.  The incentive for it to get throttled by various special interests is strong.",
    "bias": "None",
    "id": "1990060245536964867"
  },
  {
    "user": "@leadlagreport",
    "text": "Bottom line: I'm convinced health optimization (like NAD+ therapy) yields dividends just like a good investment. \n\nThis journey taught me that health truly is wealth. \n\nFew understand this.",
    "bias": "Contrarian",
    "id": "1989881978561102032"
  },
  {
    "user": "@leadlagreport",
    "text": "Reality check: NAD+ isn’t a magic – I still needed diet and exercise. \n\nBut it is a force multiplier. \n\nI take it via daily injection (nearly 100% absorbed vs pills) to get the full benefit, giving my fat loss and recovery extra edge.",
    "bias": "None",
    "id": "1989881975998501168"
  },
  {
    "user": "@leadlagreport",
    "text": "How is NAD+ different from caffeine or B12? \n\nCaffeine gives a quick spike (and then a crash), and B12 mainly helps if you’re deficient. \n\nNAD+ works deeper at the cellular, fueling steady energy production with no roller-coaster lows.",
    "bias": "None",
    "id": "1989881973490553230"
  },
  {
    "user": "@leadlagreport",
    "text": "My stamina skyrocketed too. \n\nNAD+ supercharges your mitochondria (cellular power plants) so they produce energy more efficiently. \n\nThe result? \n\nBetter endurance and less fatigue. \n\nI noticed I could push through tough workouts longer without hitting a wall.",
    "bias": "None",
    "id": "1989881970487091609"
  },
  {
    "user": "@leadlagreport",
    "text": "Importantly, NAD+ boosts insulin sensitivity (helping your body control blood sugar better). \n\nA 10-week human trial found that an NAD+ precursor (NMN) improved muscle insulin sensitivity by ~25% – a big win for metabolic health.",
    "bias": "None",
    "id": "1989881965072257515"
  },
  {
    "user": "@leadlagreport",
    "text": "NAD+ also revs up your metabolism. \n\nIt plays a crucial role in whether calories get burned for energy or stored. \n\nHigher NAD+ levels make cells more efficient at burning fat for fuel, so losing weight felt more like a smooth ride than an uphill battle.",
    "bias": "None",
    "id": "1989881962174320850"
  },
  {
    "user": "@leadlagreport",
    "text": "What is NAD+? \n\nIt’s a molecule in every cell that helps turn food into energy (ATP – your body’s energy currency). \n\nThink of NAD+ as the spark plug for your body’s engine – without it, your cells can’t efficiently burn fuel.",
    "bias": "None",
    "id": "1989881960269758970"
  },
  {
    "user": "@leadlagreport",
    "text": "I typically workout for 2-hours.\n\nMy transformation came from fasting, disciplined training, and yes, a daily NAD+ shot. \n\nBeing data-driven, I researched NAD+ and the science blew me away.",
    "bias": "None",
    "id": "1989881957681902064"
  },
  {
    "user": "@leadlagreport",
    "text": "Health is wealth – literally. \n\nOver the past 2 years I dropped 100 lbs and transformed my fitness. \n\nOne secret? \n\nDaily NAD+ injections. \n\nYes, the Few and fucked guy is talking biotech. 🧵\n\nLet’s dive into how NAD+ boosted my fat loss, muscle recovery, and energy.",
    "bias": "None",
    "id": "1989881953709908262"
  },
  {
    "user": "@Mela_Schaffer",
    "text": "I’m a Crypto fan but…. BOOM.",
    "bias": "None",
    "id": "1989734906654859434"
  }
]