[
  {
    "user": "@LizAnnSonders",
    "text": "Our latest #OnInvesting podcast episode has dropped, on which ⁦@KathyJones⁩ and I riff on Fed policy/independence, and ⁦@KevRGordon⁩ joins me in a conversation about labor market and stock market trends schwab.com/learn/story/rate-…",
    "bias": "FOMO",
    "id": "1961458869034484084"
  },
  {
    "user": "@elerianm",
    "text": "Some thoughts on what to make of yesterday's appeal court ruling on US tariffs:\nmohamedelerian.substack.com/…\n#economy #markets #trade #tariffs",
    "bias": "Recency Bias",
    "id": "1961813031362400630"
  },
  {
    "user": "@elerianm",
    "text": "\"The profession can strengthen its foundations by developing cross disciplinary knowledge, real-time data sources and scenario tools to better model a more complex world of fewer constants.\"\nI completely agree with this from the Financial Times editorial, \"How economists lost traction: Experts are struggling in a less predictable world rife with simple and popular answers.\"\nI would also add the importance of greater humility.\n#economy #economics #economists @FT",
    "bias": "Overconfidence",
    "id": "1961549810688770453"
  },
  {
    "user": "@CNBCClosingBell",
    "text": "Is the Fed's independence in jeopardy? @elerianm weighs in:\n\ncnbc.com/video/2025/08/29/mo…",
    "bias": "Herd / Bandwagon",
    "id": "1961521409454145854"
  },
  {
    "user": "@elerianm",
    "text": "Thank you, Scott Wapner, for having me on your show. I always enjoy our conversation.\n\n#economy #markets @CNBC @CNBCClosingBell @ScottWapnerCNBC #federalreserve",
    "bias": "None",
    "id": "1961520201486201006"
  },
  {
    "user": "@elerianm",
    "text": "Despite its history-making importance, this week’s legal conflict between President Trump and Governor Cook is just one of several complexities facing an already embattled Federal Reserve, stemming from tensions between the President and Chair Powell, as well as the overages on the building project, among others. Specifically:\nDivergent data and views continue to confound the economic outlook, as exemplified by this week’s numbers and the contrasting economic outlooks from Federal Reserve Governor Waller and New York Fed President Williams.\nToday’s new PCE inflation data highlights the persistent (four-year) overshoot of the Fed's 2% target, with the compositional drivers of core PCE inflation suggesting that July’s rate of 2.9% is likely to go higher in the months ahead.\nFinally, some signals from some segments of the fixed-income market are also flashing caution about the credibility and effectiveness of the Fed's forward policy guidance.\n#economy #markets #federalreserve #inflation #centralbanks",
    "bias": "Confirmation Bias",
    "id": "1961490356807098385"
  },
  {
    "user": "@elerianm",
    "text": "This chart is from the Bloomberg article, \"Bond Market's Inflation Gauge Touches Six-Month High on Fed Risk.\" It comes as 2s-30s flirt with 130 bps.\n#economy #markets #inflation #bonds",
    "bias": "Euphoria / Greed",
    "id": "1961468202082296020"
  },
  {
    "user": "@elerianm",
    "text": "While on US data, the revisions to the initial University of Michigan sentiment data for August underscore that sense of economic ambiguity that is apparent elsewhere.\nThe headline measure of overall confidence was revised lower, as the decline in the forward-looking component offset an improvement in current conditions.\nOn the inflation front, both one-year and long-term expectations were revised down, with the one-year expectation easing to 4.8% (from 4.9%) and the 5-10 year outlook falling more significantly to 3.5% (from 3.9%).\nBeyond the general signaling of a resilient economy, this mixed data is consistent with the contradictory economic messages coming from other data and sources, including this week’s public statements from Federal Reserve officials (including Governor Waller and NY Fed President Williams).\n#economy #growth #inflation #markets",
    "bias": "Recency Bias",
    "id": "1961454162463379744"
  },
  {
    "user": "@elerianm",
    "text": "In line with consensus forecasts but high if 2% is the Fed’s true inflation target:\n\nUS PCE core inflation, often known as the Federal Reserve’s favorite measure, edged higher to 2.9% in July as the increase in service sector prices picked up to its hottest rate in five months.\n\nThis compositional issue matters as there is concern that the disinflationary effect of the goods sector is unlikely to persist, which may push the core inflation rate above 3%.\n\nMeanwhile, and consistent with the hypothesis of a resilient economy, monthly US consumer spending rose by 0.3%, the highest in four months.\n\n#economy #inflation #growth #markets",
    "bias": "Confirmation Bias",
    "id": "1961418315290603827"
  },
  {
    "user": "@elerianm",
    "text": "Reinforcing its position as one of the world's fastest-growing economies, as well as the fastest-growing large emerging economy, India’s GDP growth of 7.8% in the April-June quarter beat the consensus forecast of 6.7%.\nThis data release comes just after the entry into effect of US secondary tariffs on India, highlighting both the risks to sustaining such an impressive growth rate and the potential cost to the US of sidelining the growing Indian markets.\nThis is yet another example of the trade-off between issues of national security and economic well-being in our current era of intensified geo-economics.\n#economy #markets #india #geoeconomics",
    "bias": "Recency Bias",
    "id": "1961399235028381752"
  },
  {
    "user": "@elerianm",
    "text": "Good morning.\nIt's PCE inflation day in the US, with consensus forecasts anticipating unchanged to a slight uptick in the measures of headline and core (please see below).\nThis data release comes in a week dominated by news about the Federal Reserve—specifically, both notable events that relate to the crucial issue of Fed independence, and the lack of a meaningful market reaction to them.\nThe courts will have their first consideration at 10 a.m. EST this morning of the legal case concerning Governor Cook, which also names the Fed and Chair Powell as defendants.\nMeanwhile, analysts this morning are adding their own twists to Governor Waller’s latest remarks on monetary policy (please see my post from last night). Some interpret his comments as opening the door to the possibility of him supporting a 50 basis point cut in September, while others dismiss this as highly unlikely. A few are treating his economic remarks as part of a political campaign, wondering how other candidates on the administration’s list of eleven to replace Chair Powell will react.\n#economy #markets #federalreserve #inflation",
    "bias": "Loss Aversion",
    "id": "1961376915744305557"
  },
  {
    "user": "@cshapiro",
    "text": "Detroit Lions press conference. @morganhousel 👀",
    "bias": "None",
    "id": "1961400941174743508"
  },
  {
    "user": "@RayDalio",
    "text": "It’s important not to let our biases stand in the way of our objectivity. To get good results, we need to be analytical rather than emotional.\n\nWhenever I observe something in nature that I (or mankind) think is wrong, I assume that I’m wrong and try to figure out why what nature is doing makes sense. That has taught me a lot. It has changed my thinking about 1) what’s good and what’s bad, 2) what my purpose in life is, and 3) what I should do when faced with my most important choices. #principleoftheday",
    "bias": "FOMO",
    "id": "1961764589273592183"
  },
  {
    "user": "@RayDalio",
    "text": "If your goal is to have people with different opinions work through their differences to try to get closer to what is true and what to do about it (open-minded debate), you will run your meeting differently than if its goal is to educate. Debating takes time, and that time increases exponentially depending on the number of people participating in the discussion, so you have to carefully choose the right people in the right numbers to suit the decision that needs to be made. In any discussion try to limit the participation to those whom you value most in light of your objectives. The worst way to pick people is based on whether their conclusions align with yours. Group-think (people not asserting independent views) and solo-think (people being unreceptive to the thoughts of others) are both dangerous. #principleoftheday",
    "bias": "Contrarian",
    "id": "1961506639409799472"
  },
  {
    "user": "@RayDalio",
    "text": "If people treat their problems and opportunities as being shared and they focus on getting the best outcomes for the whole without damaging each other, they will likely get the best possible results.\n\nFor a picture of where we are headed and what we should do, you can order my new book, How Countries Go Broke: The Big Cycle, at the link here: a.co/d/4jpGd3h\n#howcountriesgobroke #principles",
    "bias": "None",
    "id": "1961446560400613545"
  },
  {
    "user": "@barronsonline",
    "text": "Gold Is Smokin’. But There’s One Way You Don’t Want to Play It. trib.al/S7RmtjU",
    "bias": "None",
    "id": "1961685977161679014"
  },
  {
    "user": "@barronsonline",
    "text": "MFS Invented the Mutual Fund. How Its CEO Is Keeping Them Relevant. trib.al/Wg55FWC",
    "bias": "None",
    "id": "1961671239044346040"
  },
  {
    "user": "@barronsonline",
    "text": "Warren Buffett Turns 95 Today. 10 of His Biggest Investing Lessons. trib.al/52DP6uV",
    "bias": "None",
    "id": "1961663310035669109"
  },
  {
    "user": "@barronsonline",
    "text": "Bond Spreads Sit Near 1998 Lows. What Can Push Them Higher. trib.al/ecXmTuz",
    "bias": "Euphoria / Greed",
    "id": "1961655391202214212"
  },
  {
    "user": "@barronsonline",
    "text": "Some Boring Stocks Are Beating Big Techs. Plus, You Can Sleep at Night. trib.al/CLst6mr",
    "bias": "None",
    "id": "1961564767622959406"
  },
  {
    "user": "@barronsonline",
    "text": "U.S. Appeals Court Rules Against Tariffs in Blow to Trump Trade Policy trib.al/I2EeY9P",
    "bias": "None",
    "id": "1961561382819713416"
  },
  {
    "user": "@barronsonline",
    "text": "A Tariff Exemption Just Closed. Expect Delays, Shortages, and Higher Prices. trib.al/1obmTNb",
    "bias": "Euphoria / Greed",
    "id": "1961530782507299104"
  },
  {
    "user": "@barronsonline",
    "text": "Spirit Airlines Stock Craters After It Files for Chapter 11—Again trib.al/QzWyb4x",
    "bias": "None",
    "id": "1961529665169891796"
  },
  {
    "user": "@barronsonline",
    "text": "Core Scientific, NewAmsterdam Pharma, and More Stocks See Action From Activist Investors trib.al/8cdfeQr",
    "bias": "None",
    "id": "1961527390238036362"
  },
  {
    "user": "@barronsonline",
    "text": "Earnings Season Highlights on Tariffs, Consumer Spending, and More trib.al/OnqDGtI",
    "bias": "Euphoria / Greed",
    "id": "1961526265921335479"
  },
  {
    "user": "@barronsonline",
    "text": "Stocks End August on a Down Note. Why Investors Should Prepare for a September Swoon. trib.al/ekZR650",
    "bias": "None",
    "id": "1961513804933513725"
  },
  {
    "user": "@barronsonline",
    "text": "Discount Retailers Ring up Big Sales as Shoppers Flock to Value trib.al/in1eP7M",
    "bias": "Contrarian",
    "id": "1961501360806883535"
  },
  {
    "user": "@barronsonline",
    "text": "These Were the Best & Worst S&P 500 Stocks in August trib.al/zfBhFq0",
    "bias": "None",
    "id": "1961499076614144346"
  },
  {
    "user": "@barronsonline",
    "text": "What the Stock Market Learned About Earnings and Consumers This Summer trib.al/IRJIVWi",
    "bias": "None",
    "id": "1961496868237582766"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia and Other AI Stocks Are Falling. Why Investors Are Souring on Artificial Intelligence. trib.al/eQJC8bk",
    "bias": "None",
    "id": "1961494550611947663"
  },
  {
    "user": "@barronsonline",
    "text": "SEC Says Its Case Against Musk Is Beyond Dispute trib.al/Rn0x4zN",
    "bias": "None",
    "id": "1961483249470877708"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Can Hit $1 Trillion in Annual Revenue in 5 Years, Analyst Says trib.al/YleRltd",
    "bias": "None",
    "id": "1961473051016516073"
  },
  {
    "user": "@barronsonline",
    "text": "Berkshire Hathaway Appears to Buy Private Pest-Control Company trib.al/MuIvhk3",
    "bias": "FOMO",
    "id": "1961462156571856976"
  },
  {
    "user": "@barronsonline",
    "text": "Albemarle Stock Rises on Target Hike. Wall Street Doesn’t See The Rally Lasting. trib.al/zrZvGjC",
    "bias": "FOMO",
    "id": "1961458942418001973"
  },
  {
    "user": "@barronsonline",
    "text": "Mexico Has Oil. Why It Isn’t an Energy Powerhouse. trib.al/qnisYrP",
    "bias": "None",
    "id": "1961454109178966081"
  },
  {
    "user": "@saxena_puru",
    "text": "Grateful for the positive feedback 🙏\n\nGlad our work is making our subscribers' lives easier.",
    "bias": "None",
    "id": "1961816283445379131"
  },
  {
    "user": "@saxena_puru",
    "text": "Our performance (since inception)\n\n🛡️AlphaTarget +45.6%\n📊 S&P 500 Index +20.6%\n\nDeep fundamental research on our portfolio companies, stage analysis, hedging signals, trading alerts alphatarget.com",
    "bias": "Confirmation Bias",
    "id": "1961785627046994291"
  },
  {
    "user": "@saxena_puru",
    "text": "If the US Supreme Court also finds the tariffs illegal, this will likely be positive for the economy and equities. \n\nNo tariffs = stronger economy = lower inflation \n\nUS importers will also receive customs duty refunds.",
    "bias": "None",
    "id": "1961631634114982185"
  },
  {
    "user": "@saxena_puru",
    "text": "This is interesting!\n\nUS Appeals Court rules most tariffs are NOT legal. \n\nreuters.com/legal/government…",
    "bias": "None",
    "id": "1961629791691383279"
  },
  {
    "user": "@saxena_puru",
    "text": "Super grateful for such feedback 🙏 \n\nGlad our work is making a difference!\n\nHuge credit to our analysts @BleedingEdgeAM @IrnestKaplan @DamiaOthman @BjerkeOy who work alongside me to deliver actionable research.",
    "bias": "None",
    "id": "1961261335942988256"
  },
  {
    "user": "@BjerkeOy",
    "text": "Google's monthly tokens processed grew c.50x in just one year by April 2025, and doubled again in June 2025. This growth shows no signs of slowing.\n\nAs NVIDIA CEO Jensen Huang noted in the recent Q2 earnings call, compute needs for agentic AI reasoning models could be \"100x, 1000x, and potentially even more\" than standard one-shot models.\n\nWith these powerful reasoning models cutting hallucinations and unlocking fresh use cases, we expect usage to continue to soar, fuelling even more inference demand.\nSource: Google",
    "bias": "Recency Bias",
    "id": "1961450115194892307"
  },
  {
    "user": "@IrnestKaplan",
    "text": "Gartner predicts that Cloud Spend will more than double over the next four years, compounding at 20% from 2004 to 2008.\n\nWe have invested in top-tier software companies that are benefiting from this secular trend.",
    "bias": "Herd / Bandwagon",
    "id": "1961427204778119466"
  },
  {
    "user": "@saxena_puru",
    "text": "Results speak louder than words. \n\nOur talented team works tirelessly to uncover disruptive opportunities and our subscribers are seeing the ROI.",
    "bias": "None",
    "id": "1961258637361390016"
  },
  {
    "user": "@saxena_puru",
    "text": "Grateful for the feedback 🙏\n\nAlphaTarget is a team effort and I'm super happy our research is making a difference.",
    "bias": "Confirmation Bias",
    "id": "1961247011769852379"
  },
  {
    "user": "@balajis",
    "text": "When Bitcoin wins...\n\n0:00 It ends the Fed\n02:10 Payments become packets\n3:30 Keynesianism falls like Communism\n4:20 Real estate falls in real terms\n5:40 Fiat billionaires get flipped\n6:20 Money printer runs out of toner\n7:50 The battle begins...\n10:00 ...and it's time to build",
    "bias": "Herd / Bandwagon",
    "id": "1961529239993536687"
  },
  {
    "user": "@elonmusk",
    "text": "Grok Code just hit #1 on the OpenRouter leaderboard, beating Claude Sonnet",
    "bias": "None",
    "id": "1961677739762790630"
  },
  {
    "user": "@elonmusk",
    "text": "For England 🏴󠁧󠁢󠁥󠁮󠁧󠁿",
    "bias": "None",
    "id": "1961759171243590028"
  },
  {
    "user": "@sophia_ziva",
    "text": "I've lived in Athens, in Eksarhia, since 2004. I studied theater drama, worked late nights in productions, and always saw myself as open-minded. I used to say, Let them come-refugees from war, they deserve safety. But last summer, something changed. Not my heart, but my reality. Every day, I took the bus to work in the city center. Traffic in Athens is a nightmare, so public transport is my life. One morning, I passed a man sleeping on the street near my bus stop. He wasn't just there-he shouted at me. Mean, angry words I couldn't understand. I froze, scared, and hurried past. It happened again the next day, louder. So, I changed my route. I walked a longer circle to avoid him, my heart racing each time I left home. He disappeared for a while. I felt relief. Then, he reappeared-right at the entrance of my building. My home. I work late in theater, coming back at midnight, sometimes later. There he was, lying on his bed of blankets, blocking my way. I started sneaking around the back of my building, circling in the dark just to feel safe. Me, a woman born in this country, tiptoeing around my own home. Then, not even a month later, I saw it on social media and the news. This man attacked a girl in broad daylight. She was walking her dog in a park, and he hit her with an iron, splitting her head open. She was in the hospital. I learned he'd been arrested before-twice-for attempted rape in my area. But each time, he was released. Why? Prisons are full, they said. He's a Palestinian war refugee, they said, protected by asylum laws. A police official came on TV and admitted it: even after this attack, the man would likely be free in six months. No space to hold him. I sat there, stunned, thinking: What is happening to my city? I'm not heartless. I've always felt for people fleeing war. But when someone hurts others-when they make women like me afraid to walk home-shouldn't that end their protection? Athens isn't the same anymore. There are areas in the center I won't go at night. Buses where I'm the only Greek, sometimes the only woman, surrounded by men staring. It's not about where they're from-it's about feeling safe. When I'm alone on that bus, my hands shake. I'm not ashamed to admit I'm scared. This isn't just my story. It's happening all over Athens. Undocumented immigrants, unrecorded, with no place to sleep, no jobs, no food. I don't blame them for wanting a better life. But when there's no system to track them, to house them, to integrate them, it's chaos. Greece is drowning. We can't take more people when we don't have space, when our prisons release attackers because there's no room, when our streets feel unsafe for women like me. I hear people like Elon Musk talking about this-saying Europe needs stricter rules, that we can't just open doors without knowing who's coming. I agree. Not because I hate anyone, but because I want my country to stay mine-safe, familiar. It's not about being fascist. It's about being honest. These immigrants, they come from places with different values. Not worse, just different. Where women, life, everything is seen differently. We can't pretend that doesn't matter. I've seen it on the streets, felt it in the stares. We need to acknowledge cultural differences to live together, not ignore them and hope for the best. Saying this doesn't make me racist. It makes me human. I'm scared when I walk home. I'm angry when I hear about girls attacked in parks. I'm frustrated when I see my city stretched to its breaking point, taking in people we can't support. They're not numbers-they're humans with needs. But so are we. If we take everyone, without papers, without plans, where will they sleep? How will they eat? What happens when those needs turn into crime because the system failed them too? I still believe in compassion. I want to help refugees, but not like this. We need documentation, names, backgrounds. We need homes for them, jobs, a way to blend into our culture while keeping Greece safe. Why is it so hard to say that? Why does admitting my fear make me feel like I'll be judged? How do we stay kind but protect our streets? How do we balance their safety with ours? I don't have all the answers. But I know this: I want to walk to my bus without circling in fear. I want Athens to feel like home again. And I want to say this out loud, in my voice, without being called names. Because this is my truth-and I know I'm not alone.",
    "bias": "FOMO",
    "id": "1961684623714345095"
  },
  {
    "user": "@Steve_Laws_",
    "text": "Never forget the protests starting in Epping because of a rapey invader.\n\nThe government is saying our people have to accept rapey foreigners against our will.\n\nOur women and children are seen as cannon fodder by open border fanatics.",
    "bias": "None",
    "id": "1961730080641536151"
  },
  {
    "user": "@RMistereggen",
    "text": "Our governments invites foreign men into our countries to murder us. I don’t know how else to view this.",
    "bias": "None",
    "id": "1961753414913716586"
  },
  {
    "user": "@TRobinsonNewEra",
    "text": "Chants of \"save our kids\" ring out as concerned British families protest in Newcastle against unvetted migrant men being dumped in their community. \n\nMasked paid communists shout \"nazis\" at them.",
    "bias": "None",
    "id": "1961756234534486174"
  },
  {
    "user": "@ThomasSowell",
    "text": "“There is basically no difference between socialism and fascism.”\n\n— Friedrich Hayek",
    "bias": "Herd / Bandwagon",
    "id": "1961745719028535470"
  },
  {
    "user": "@MikeBenzCyber",
    "text": "If 10 Downing Street wants to impose migrant hotels then 10 Downing Street should be turned into a migrant hotel.",
    "bias": "None",
    "id": "1961725483277533350"
  },
  {
    "user": "@ada_lluch",
    "text": "I’m 25 years old and I want my country back.\n\nIs it wrong to not want to live among migrants who want to kill me simply for existing?",
    "bias": "None",
    "id": "1961745563772129667"
  },
  {
    "user": "@EvaVlaar",
    "text": "It happened again.\n\nAn illegal Iraqi migrant, known to the authorities, has been arrested again after having previously released, for pushing a 16 y/o girl in front of a train in Germany. The girl did not survive. \n\nAccording to new information from the prosecutor's office, police received a report shortly before the incident because the man was causing a scene at the station. When they arrived he had already pushed the girl in front of the train. He was questioned, but was RELEASED the same day due to \"insufficient evidence\".\n\nTo make matters even worse, we now know he was supposed to have been deported late 2022 after his asylum claim had been rejected, but never was. In July this year, a request by immigration authorities to detain him pending his deportation was rejected by the court, because the flight risk was not \"sufficiently substantiated\".\n\nYou can't make this stuff up. The authorities responsible have to face repercussions. Europeans have to resist the genocidal violence they're being subjected to.",
    "bias": "None",
    "id": "1961750943524946144"
  },
  {
    "user": "@elonmusk",
    "text": "Without question",
    "bias": "Overconfidence",
    "id": "1961757216903500254"
  },
  {
    "user": "@MarioNawfal",
    "text": "🇬🇧 COMING SOON - EXCLUSIVE INTERVIEW: TOMMY ROBINSON ON THE DECLINE OF BROKEN BRITAIN\n\n@TRobinsonNewEra has been hounded and persecuted by the mainstream media, political elites, and the UK justice system for standing up for the essential values and rights of the British public.\n\nHe has been a vocal critic of unchecked illegal immigration and government policies that have prioritised the rights of immigrants over hard-working British citizens.\n\nJailed for contempt and kept in solitary confinement for exercising his right to free speech, Tommy has refused to back down.\n\nAs the UK faces an unprecedented migrant crisis, its public gaslit, branded racist for showing pride in their country, and imprisoned for social media posts, Tommy has been a figurehead of speaking truth to power.\n\nJoin us as we explore what's happening in the UK and how it could lead to the biggest political upheaval as new parties such as @_AdvanceUK, who promise to restore balance to society, surge in the polls.",
    "bias": "Herd / Bandwagon",
    "id": "1961737092054056991"
  },
  {
    "user": "@elonmusk",
    "text": "❤️🇬🇧",
    "bias": "None",
    "id": "1961732580312600941"
  },
  {
    "user": "@HoodedClaw1974",
    "text": "Listen to this from a concerned mother in Epping about what young girls have to endure walking home from school with the migrant hotel nearby. 😡",
    "bias": "None",
    "id": "1961713416575365208"
  },
  {
    "user": "@antmiddleton",
    "text": "Strategical Military planning is needed to flip our country around! I’m being serious and I’m being serious… I’ll start with London! 🫡🇬🇧",
    "bias": "None",
    "id": "1961723859385627074"
  },
  {
    "user": "@elonmusk",
    "text": "And pay for them too …",
    "bias": "None",
    "id": "1961724302954320382"
  },
  {
    "user": "@techdevnotes",
    "text": "Grok is now on GSA Advantage US Gov Website\n\nFor federal government agencies and authorized buyers to purchase",
    "bias": "None",
    "id": "1961423704140763463"
  },
  {
    "user": "@DonnaLouise1212",
    "text": "Lots of people asking if i'm going to the Unite The Kingdom March on Sept 13th. The answer is yes. If you see a woman with a lion wearing this dress please say hi 👋.",
    "bias": "None",
    "id": "1961501692551102914"
  },
  {
    "user": "@antmiddleton",
    "text": "We need to completely isolate our Island from any external politics in order to rebuild  our nation the way WE want! We must destroy the ECHR bridge that is attached to our nation placing our people and country in grave danger! 🇬🇧🏴󠁧󠁢󠁥󠁮󠁧󠁿🇬🇧",
    "bias": "None",
    "id": "1961720873796227340"
  },
  {
    "user": "@elonmusk",
    "text": "At least",
    "bias": "None",
    "id": "1961721969788719559"
  },
  {
    "user": "@ashraf_ruslan0",
    "text": "🚨 BREAKING: Grok Imagine is officially rolling out on Web! 🔥🔥🔥\nTry it!",
    "bias": "None",
    "id": "1961402084504277115"
  },
  {
    "user": "@barnabemonnot",
    "text": "Pleased to share our \"Improve UX\" track update!\n\nTL;DR: High focus on interop. Build out and strengthen intent-based infrastructure, preparing the ground for fast and trust-minimised backends. Drive down costs and latency with a focus on faster and stronger settlement on L1 and for L2s.\n\nThe projects feature a mix of coordinating additive initiatives, delivering new infra and products, as well as accelerating deeper protocol changes, with contributions from EF teams and the wider ecosystem. Thank you all for comments and discussions leading to this update!\n\nWhile our own focus will be on interop, we highlight two additional initiatives, Trillion Dollar Security and the Kohaku privacy wallet, addressing further gaps in UX. \n\nFind more details in the post linked below 👇",
    "bias": "Euphoria / Greed",
    "id": "1961371058012922041"
  },
  {
    "user": "@typesfast",
    "text": "Most of Trump’s tariffs have just been ruled illegal by the appellate court. \n\nNext stop is the Supreme Court. If the administration loses American importers will enjoy a customs duty refund jubilee of biblical proportions.",
    "bias": "None",
    "id": "1961549262896205982"
  },
  {
    "user": "@paulg",
    "text": "Wow, I didn't realize the difference between cars and motorcycles was this big. Motorcycles are 29x more dangerous.",
    "bias": "None",
    "id": "1961741758951309683"
  },
  {
    "user": "@paulg",
    "text": "The harder the task, the less you care about people's race or sex or whatever, either in the racist sense or the diversity sense. You're so desperate simply to find anyone who can do it well that you don't think about anything else.",
    "bias": "None",
    "id": "1961557884983968208"
  },
  {
    "user": "@paulg",
    "text": "An interesting insight from inside Twitter:",
    "bias": "None",
    "id": "1961433431348306301"
  },
  {
    "user": "@ReichlinMelnick",
    "text": "DC has become a “papers, please” city under Trump, with masked agents demanding residents show their IDs at random locations around the city.",
    "bias": "None",
    "id": "1961222277380321789"
  },
  {
    "user": "@ycombinator",
    "text": "OpenAI recently released its first open-weights model since GPT-2, entering a field led by DeepSeek and Alibaba's Qwen.\n\nAnkit (@GuptaAnkitV) breaks down these top OSS models, including what sets them apart under the hood: mixture-of-experts, long-context training, and post-training techniques that shape reasoning and alignment—and how different design choices lead to surprisingly similar performance.\n\n00:00 – OpenAI OSS Launch\n01:00 – Comparing Open Source LLM Architectures\n01:46 – GPT OSS Overview\n02:37 – Under The Hood of GPT OSS\n03:25 – Qwen-3 Architecture\n04:17 – Qwen-3 Training\n05:12 – Qwen-3 Post-Training\n06:08 – Qwen-3 Reasoning & RL Innovations\n06:52 – DeepSeek V3 Overview\n07:40 – DeepSeek V3.1 Updates\n08:39 – Attention Mechanism (MLA)\n09:39 – Comparing Model Sizes\n10:35 – Long Context Strategies\n11:25 – Reflections on Methods\n12:00 – Takeaways",
    "bias": "Overconfidence",
    "id": "1961429173358272714"
  },
  {
    "user": "@paulg",
    "text": "This still happens.",
    "bias": "None",
    "id": "1961278031915319313"
  },
  {
    "user": "@AlecStapp",
    "text": "This should be a wake-up call for US policymakers:",
    "bias": "None",
    "id": "1961236085432078504"
  },
  {
    "user": "@bitsandbips",
    "text": "Every cycle has its craze. Right now, it’s crypto treasury companies\n\nThey’ve raised $22B this year alone, turning balance sheets into leveraged bets on crypto\n\nThe twist? They’re no longer just HODLing…\n\na thread on what could go wrong 🧵",
    "bias": "Loss Aversion",
    "id": "1961801995414610256"
  },
  {
    "user": "@laurashin",
    "text": "Why didn’t Uniswap celebrate being plugged into Coinbase? 🤔\n\nBecause fragmented liquidity is their business model, says @wagmiAlexander 🌶️",
    "bias": "None",
    "id": "1961776106891080063"
  },
  {
    "user": "@BuzzMalx",
    "text": "Just finished watching podcast by @LukeYoungblood, @wagmiAlexander & @laurashin \n\nAnd honestly I've found lots of alpha there\n\nYou can watch the full version on @Unchained_pod \nBut here is short recap for you:\n\n- Coinbase and Base are playing the long game\nThey're not building for next month, they're focusing on next 10 years.\n\n- Fragmented liquidity isn't a problem\nUniswap and other protocols may seem scattered, but that's actually part of the system. It allows better distribution and makes DeFi stronger overall\n\n- More faster and better chains are coming\nSending money onchain will be just as fast as sending message. DeFi will make it real\n\n- Governance and incentives are evolving\nInstead of rewards going mostly to insiders, new top DeFi protocols like @AerodromeFi and @MoonwellDeFi \n\n- Bear markets are the best opportunities for builders\nThe best projects are built in downturns\n\nIn total, DeFi is evolving\nAnd you should play in long term here\n\nHuge shoutout to everyone who participated in this podcast",
    "bias": "FOMO",
    "id": "1961726602716360985"
  },
  {
    "user": "@cthrin",
    "text": "Democratize finance.",
    "bias": "None",
    "id": "1961599118369083665"
  },
  {
    "user": "@laurashin",
    "text": "Actually this reminds me of this hilarious SNL skit with Nate Bargatze: piped.video/JYqfVE-fykk?si=kT4l…",
    "bias": "None",
    "id": "1961596970868367823"
  },
  {
    "user": "@laurashin",
    "text": "Something annoying about being American — needing to look up things like how many oz are in a pound or how many tbsp in a cup or whatever 🙄 Totally wish I’d been born in a metric system country 😑",
    "bias": "None",
    "id": "1961595362864460278"
  },
  {
    "user": "@MoonwellDeFi",
    "text": "🌜🟦🌛 @wagmiAlexander and @LukeYoungblood sat down with @laurashin to share how Aerodrome and Moonwell are preparing for Coinbase's 100M+ users to come onchain.\n\nWatch the replay on Youtube: 👇",
    "bias": "FOMO",
    "id": "1961545210791628819"
  },
  {
    "user": "@laurashin",
    "text": "As competition heats up between DATs, more are turning to DeFi and TradFi to juice yields 💸\n\nCould that blow up? 💥\n\n@leeorshimron writes\n\nunchainedcrypto.com/how-cryp…",
    "bias": "Contrarian",
    "id": "1961537048013127956"
  },
  {
    "user": "@AerodromeFi",
    "text": "On @coinbase DEX trading:\n\n\"If the trade is happening on Aerodrome, they own a large stake of locked AERO that they went on the market and bought.\n\nAnd because our protocol distributes 100% of its revenue back to voters, they're also earning a % of all the flow they direct to us\"",
    "bias": "Euphoria / Greed",
    "id": "1961525905022750822"
  },
  {
    "user": "@crypto_fruit",
    "text": "👀👀👀🙏",
    "bias": "None",
    "id": "1961509479406866880"
  },
  {
    "user": "@JSeyff",
    "text": "NEW: Ethereum ETFs are on an absolute tear. They've taken in nearly $10 billion since the start of July. Here's what their flows look like since launch -- nearly $14 billion",
    "bias": "Herd / Bandwagon",
    "id": "1961453481786528155"
  },
  {
    "user": "@laurashin",
    "text": "Traditionally, exchanges squeeze projects for listings 💸\n\nBut @wagmiAlexander says Base changes everything: deploy once, and you’re instantly available to 100M Coinbase users. A ‘free listing’ funnel 👀",
    "bias": "Euphoria / Greed",
    "id": "1961474130785489107"
  },
  {
    "user": "@Hollywood41x",
    "text": "This interview is worth watching.",
    "bias": "None",
    "id": "1961419619429748899"
  },
  {
    "user": "@laurashin",
    "text": "Is Coinbase quietly building DeFi’s most powerful moat? 👀\n\nOn @unchained_pod, @wagmiAlexander & @LukeYoungblood dive into:\n📈 How Base is becoming the launchpad for new tokens\n🏦 Coinbase as the crypto bank anyone can access with an ETH key\n🌶️ How Uniswap benefits from fragmented liquidity\n💸 Whether DeFi apps are overpaying with incentives\n\nTimestamps:\n🎬 0:00 Intro\n👥 2:56 Why Alex and Luke aligned early with Base, \n📢 6:32 How Coinbase is positioning itself as the distribution partner of the onchain economy\n⚖️ 21:12 Whether exchanges should be the ones deciding what assets people can trade\n🌱 33:15 How DeFi needs to evolve to reward token holders sustainably\n💧 41:32 Whether liquidity fragmentation is actually a feature, not a bug, for Uniswap\n💸 57:50 How Moonwell and Aerodrome justify issuing more incentives than they currently earn in revenue",
    "bias": "FOMO",
    "id": "1961412806479106432"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n⚖️ CFTC gives offshore crypto exchanges a way home\n📉 U.S. GDP data lands directly on blockchains\n🚀 Tether plans USDT transactions on Bitcoin\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Herd / Bandwagon",
    "id": "1961383977811407113"
  },
  {
    "user": "@CryptoWendyO",
    "text": "It is a fantastic morning.",
    "bias": "None",
    "id": "1961799946786796009"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I’m currently trending in the UK. \n\nLife is wild. \n\nHello East End.",
    "bias": "Herd / Bandwagon",
    "id": "1961641972902547648"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Your dad is a top signal \n\nBitcoin is doing just fine",
    "bias": "Herd / Bandwagon",
    "id": "1961608425986822604"
  },
  {
    "user": "@CryptoWendyO",
    "text": "HAPPY LABOR DAY WEEKEND XX\n\nCATCH THE REPLAY AND SUBSCRIBE!\n\npiped.video/live/Skmlzhfs_5Y…",
    "bias": "None",
    "id": "1961563262077763670"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Hedera is major DEFI",
    "bias": "None",
    "id": "1961457370963611928"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Amplify Investments Files For XRP Option Income ETF\n\nAmplify Investments has filed a prospectus with the US SEC for a new XRP monthly option income ETF, aiming to generate regular investor income through a covered call strategy tied to XRP.\n\nThis comes as the SEC faces a growing backlog of over 90 crypto-related applications, including spot ETFs for other alts like SOL and HBAR.\n\nAmplify already offers crypto ETFs and manages ~$12.6B in assets. \n\nSource: The Block",
    "bias": "Herd / Bandwagon",
    "id": "1961541871865372895"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I will buy bitcoin above $100,000\n\nI will buy bitcoin sub $100,000",
    "bias": "Herd / Bandwagon",
    "id": "1961523452558676408"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Bitcoin is trading sub $110,000\n\nWe are still eating good!",
    "bias": "Herd / Bandwagon",
    "id": "1961498440250122699"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto things you might have missed:\n\n-Eric Trump predicts $1M BTC 🔥\n-SBI-backed firm to buy XRP\n-21Shares files for SEI ETF\n-BlackRock ETH ETF inflows are parabolic\n-Bitwise makes bullish SOL prediction\n-Major @hedera x @TradeInOrbit DeFi announcement\n\nLINK IN BIO",
    "bias": "Euphoria / Greed",
    "id": "1961481563033797028"
  },
  {
    "user": "@CryptoWendyO",
    "text": "LO just walked into my studio to ask me permission to do something. \n\nShe clearly explained:\n\n- why she wanted to do the thing\n- addressed my concerns \n- agreed we can discuss later and that she will make a PowerPoint to reaffirm her stance \n\nKids are so rad!",
    "bias": "Euphoria / Greed",
    "id": "1961439950823723094"
  },
  {
    "user": "@brave",
    "text": "⚠️One careless click can jeopardize your financial security.\n\nOn the newest #TheBraveTechnologist episode, cryptocurrency analyst @CryptoWendyO explains how to protect your wealth.\n\nCheck out the full episode, recorded at @RareEvo, now: brave.com/podcast/e85/",
    "bias": "Herd / Bandwagon",
    "id": "1961437117160001950"
  },
  {
    "user": "@CryptoWendyO",
    "text": "C A R D A N O",
    "bias": "None",
    "id": "1961432129675645419"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Yesterday was a dream. \n\nThe Whitehouse, blockchain and the CFTC. \n\nIconic",
    "bias": "Recency Bias",
    "id": "1961415474614603900"
  },
  {
    "user": "@deadpixels_club",
    "text": "Free mint giveaway and game time 👻\n\nLike/retweet/follow @deadpixels_club, @Will_DPGC\n\nWe won't refill the mint pool until a gold ghosts is minted so chances of pulling one increases after every mint.\n\nYou can mint a ghost right now, here: sentx.io/forevermint/dead-pi… #HBARbarians",
    "bias": "None",
    "id": "1961386967255695605"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Imagine once ALL of these crypto ETPs are approved. \n\nThe amount of liquidity will be worth the short term non Bull market feelings.",
    "bias": "Confirmation Bias",
    "id": "1961265505978712084"
  },
  {
    "user": "@CryptoWendyO",
    "text": "WE ARE GETTING CANCELED LIVE",
    "bias": "None",
    "id": "1961218820510515590"
  }
]