[
  {
    "user": "@StockSavvyShay",
    "text": "$CRWD will acquire Seraphic Security, extending Falcon into browser runtime security as the browser becomes a primary workspace for humans & AI agents.\n\nThe deal deepens platform lock-in by making Falcon the default security fabric without changing how customers work.",
    "bias": "None",
    "id": "2011079681727189157"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$MSFT says it will work with utilities & regulators to ensure electricity rates reflect the power demands of its AI data centers as it expands “community-first” AI infrastructure.\n\nThis trend benefits these themes:\n• Grid & Power | $CEG, $NEE, $VST, $EOSE, $NNE\n• Nuclear | $OKLO, $SMR, $LEU, $GEV, $CCJ, $BWXT",
    "bias": "None",
    "id": "2011074167257673943"
  },
  {
    "user": "@StockSavvyShay",
    "text": "I pay close attention to which stocks lead in January because it’s the first clear look at where managers are actually putting new money & decisions are based on where they think returns will come from next rather then protecting what already happened.\n\nStocks that lead early in year usually point to where next phase of growth is going to be.",
    "bias": "None",
    "id": "2011061509393432617"
  },
  {
    "user": "@StockSavvyShay",
    "text": "JANUARY LEADERSHIP IS ALREADY HINTING AT THE 2026 THEMES\n\n• Grid & Power | $EOSE, $BE, $NVTS\n• AI Utility | $IREN, $CIFR, $NBIS, $APLD, $CRWV\n• Space Economy | $ASTS, $RKLB, $PL, $RDW, $FLY\n• Nuclear | $OKLO, $SMR, $NNE, $CCJ, $BWXT, $LEU\n• Drones | $KTOS, $ONDS, $AVAV, $DPRO, $PDYN, $RCAT\n• Critical Materials | $CRML, $UUUU, $UAMY, $ASPI, $USAR\n• Chip Manufacturing & Memory | $INTC, $MU, $AMKR, $SNDK, $LRCX, $SKYT",
    "bias": "None",
    "id": "2011059355756741103"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Stanley Druckenmiller lost $600M shorting internet stocks in 1999. Being early is the same as being wrong.\n\nMichael Burry may be right about an AI glut eventually but we’re still years away from that reality.\n\n$NVDA is still selling every chip it can make & $PLTR is still in the first inning of enterprise AI adoption.",
    "bias": "None",
    "id": "2011047951788097869"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HOW $GOOGL IS BUILT FOR THE NEW DIGITAL ECONOMY\n\n• AI chips designs TPUs to keep AI compute cheap & controllable as inference becomes a margin business\n• Robotics invests in embodied AI through Apptronik to automate physical work once software automation saturates\n• Drones owns Wing to remove labor & time costs from last-mile logistics as commerce moves toward instant fulfillment\n• Space holds exposure to launch, satellite connectivity & Earth data via $ASTS, $PL & SpaceX\n• Autonomy operates Waymo to replace human labor with software in in transportation which is one of the largest cost centers in the economy\n• AI models builds Gemini & advances reasoning, planning & agents through DeepMind while backing Anthropic to avoid single-model dependence\n• AI security acquires Wiz & Mandiant to make AI infrastructure trustworthy enough for enterprise & regulated use\n• Healthcare AI backs $TEM & $PRME to apply AI inside regulated, data-rich clinical workflows where spend is non-discretionary\n• AI distribution & Cloud runs a ~$60B ARR platform that hosts AI workloads & deploys new capabilities instantly to billions of users\n• Agentic AI embeds agents into Search & Workspace so AI can execute tasks end-to-end inside Google’s ecosystem",
    "bias": "None",
    "id": "2010707388467175526"
  },
  {
    "user": "@StockSavvyShay",
    "text": "I talk to my mom several times a week and have for as long as I can remember.\n\nShe lives in a coastal city in Iran and because of the blackout I haven’t been able to reach her for a week. I honestly can’t remember the last time that happened. \n\nMoments like this put perspective on how fortunate we are living where we do and based on my own firsthand experience, the overwhelming majority of Persians want change.",
    "bias": "None",
    "id": "2010841171267109093"
  },
  {
    "user": "@StockSavvyShay",
    "text": "OpenAI has acquired Torch, a healthcare startup that unifies lab results, medications & visit recordings.\n\nThe data will be integrated into ChatGPT Health giving users a single place to understand and manage their health.",
    "bias": "None",
    "id": "2010824978053149013"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Feels like every day there’s a new retail partner plugging into $GOOGL Universal Commerce Protocol. \n\nGemini is starting to look like the checkout infrastructure of the AI economy.",
    "bias": "None",
    "id": "2010822258445447324"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$META is cutting ~10% of staff at Reality Labs. \n\nCutting Reality Labs headcount to fund compute CapEx looks like the right move if Meta wants to be a real AI compute platform.",
    "bias": "None",
    "id": "2010819541534728679"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$META is on track to become one of the largest AI compute platforms in the world that's built on top of the most engaged network ever created.",
    "bias": "None",
    "id": "2010801035464552804"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HOLY $NBIS",
    "bias": "None",
    "id": "2010788073102328322"
  },
  {
    "user": "@Beth_Kindig",
    "text": "The I/O Fund has long held that risk management should carry equal weight to alpha generation. As a result, some of our most important wins are not always reflected in returns, but in losses avoided. In August, we hosted a rare, public one-hour webinar—our only free webinar of the year—to walk through why a Bitcoin $BTC selloff was increasingly likely. \n\nAt the time, Co-Portfolio Manager @knox_ridley  was confident enough in his analysis to openly challenge lofty crypto price targets, referring to consensus optimism as “the herd.” Read more below.\nio-fund.com/ai-stocks/nvidia…",
    "bias": "None",
    "id": "2010828974134288408"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Alphabet $GOOG said that it has struck a multi-year deal with Apple $AAPL where its Gemini models will power Apple's future Apple Intelligence features and revamped Siri.",
    "bias": "None",
    "id": "2010818022160650673"
  },
  {
    "user": "@Beth_Kindig",
    "text": "From fiscal 2023 through fiscal 2027, Nvidia $NVDA is currently estimated to earn almost $350 billion in cumulative free cash flow, approximately 2X of Broadcom's $AVGO $176 billion and more than 12X AMD's $AMD cumulative FCF of $28 billion.",
    "bias": "None",
    "id": "2010783265922179076"
  },
  {
    "user": "@RedDogT3",
    "text": "No 20@520 and #630club tomorrow. Last day out of routine. I’ll do Friday. Looks like great Red to green action today.  Sometimes u can make more money off the desk. \nFun with Coach Sabin,  Leyritz and HOJO",
    "bias": "None",
    "id": "2010917747786490127"
  },
  {
    "user": "@RedDogT3",
    "text": "added a new Mag 7 options idea: t3live.com/ppo",
    "bias": "None",
    "id": "2010722628466770152"
  },
  {
    "user": "@RedDogT3",
    "text": "$spx futures -40 as the “Powell news” and credit card % limits pressure the tape. \nSimplify it today. Does $spy hold the $690.50 area. If not, $687.50 is important to see if we have active commitment to last week. \n\nI’m on the road today. Limited access. \nKnow what ur in, and why!!  If the trade changes. Adjust!",
    "bias": "None",
    "id": "2010704748484100105"
  }
]