[
  {
    "user": "@Ashcryptoreal",
    "text": "$ETH is following the Tesla playbook.\n\nEven the correction from the resistance\nlevel is identical. Back then $TSLA rallied\n150% in 6-8 months after this breakout.\n\nThe similar rally will send $ETH above \n$10,000 by Q1 2026.",
    "bias": "FOMO",
    "id": "1951980657074168090"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Zero-knowledge proofs are no longer just technical tools; they’re now valuable and tradeable assets.\n \nSuccinct (@SuccinctLabs) is building the future of zero-knowledge computing. If Bitcoin has miners, Ethereum has Stakers, Succinct has “PROVERS”\n\nThink of it as a global compute network where anyone can request and access cryptographic proofs on demand.\n \n🔎  Key Highlights You Need To Know:\n\n✅ Succinct is Making Zero-Knowledge (ZK) Simple for Everyone:\n\nOld ZK tech was hard and highly specialized—like coding in assembly language. Also, only cryptography PhDs could use it effectively. With SP1, Succinct makes ZK easy—just write normal code.\n\n✅  How Does SP1 Work?\n\nSP1 is a next-gen zkVM that’s 10x faster than other solutions. It can prove the correct execution of any software. This means:\n\n👉 Game outcomes can be proven fair\n👉 DeFi transactions can be verified\n👉 AI outputs can be audited for honesty\n \n✅ $PROVE token for The Prover Network\n\n🔸 Developers pay for proofs using $PROVE tokens\n\n🔸 GPU operators compete in global “proof contests” to win the task which drives:\n\n👉  Competition → Lower proof costs  \n👉 Infrastructure growth → More GPUs worldwide\n👉  It mirrors how Bitcoin mining built a global hardware network—but for ZK computing\n \nWhy It Matters?\n\n🔸 Succinct is turning ZK proofs into mainstream infrastructure\n\n🔸 Makes trustless, verifiable computing accessible to all developers—not just cryptography experts\n\n🔸 Opens the door for scalable, secure, and decentralized apps across industries\n\nDisclaimer - we have invested in Succinct so please don’t forget to do your research.",
    "bias": "Overconfidence",
    "id": "1951966928458944754"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "MARKET PUMP IS NOW CONFIRMED 🚀",
    "bias": "Euphoria / Greed",
    "id": "1951940988634612046"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🐋 A WHALE HAS BOUGHT 79,461 ETH WORTH $274 MILLION IN THE PAST 3 DAYS.\n\nWHALES ARE BUYING THE DIP 🔥",
    "bias": "Euphoria / Greed",
    "id": "1951899388672082325"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "YOU WILL MAKE A WIFE CHANGING\nMONEY IN NEXT 4-6 MONTHS IN \nCRYPTO. \n\nDONT LET WHALES SHAKE YOU OUT.\nMASSIVE GAINS ARE COMING IN Q4.\n\nWE ARE NOT FCKING LEAVING.",
    "bias": "Euphoria / Greed",
    "id": "1951745503118369095"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "He who survives the dump \n\nDeserves the mega pump",
    "bias": "Euphoria / Greed",
    "id": "1951722682330050791"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "STOP SELLING FOR FUCK SAKE \n\nMY PORTFOLIO LOOKS LIKE SHIT",
    "bias": "None",
    "id": "1951708832301973590"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨BREAKING: 🇺🇸 THE U.S. GOVERNMENT RELEASED DIGITAL ASSET POLICY REPORT\n\nPLUME’S TOKENIZATION VISION CITED DIRECTLY. RWAs ARE GOING MAINSTREAM AND $PLUME IS LEADING THE CHARGE.",
    "bias": "None",
    "id": "1951698803989561663"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Don’t surrender to bears. \n\nThey posted $12k BTC charts at $16k\nand then $60k charts at $80k and now\nposting $85k charts at $114k; \n\nbut if you just bought and held, you\nwould outperform all the bears every\nfucking time. \n\nThey crave for attention,\nwe crave profits, not the same",
    "bias": "None",
    "id": "1951648943902749182"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Alts Historically Go Down In August.\n\n𝟮𝟬𝟮𝟯\n\n➙ Altcoin Mcap Dumped 28% Before Rallying 159%.\n\n𝟮𝟬𝟮𝟰\n\n➙ Altcoin Mcap Dumped 40% Before Rallying 149%.\n\n𝟮𝟬𝟮𝟱\n\n➙ Altcoin Mcap Is Down 13% From Its Peak.\n\n➙ It Could Go Down 8%-10% More Before A Bottom.\n\nAfter That, A Rally Will Happen Just Like It Happened In 2023 And 2024.",
    "bias": "FOMO",
    "id": "1951633685108674575"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Relax. \n\nWe are still in Bull market \n\nBTC is going to $150,000\nETH is going to $10,000 \nAlts will pump 10x-50x \n\nWe are gonna make it in 2025",
    "bias": "Euphoria / Greed",
    "id": "1951584920444277203"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "FOUR KEY BULLISH POINTS I’M WATCHING FOR BITCOIN PN DAILY RIGHT NOW:\n\n-MAY 2025 RESISTANCE TURNS SUPPORT\n\n-IMBALANCE FILLED\n\n-PRICE BOUNCED AT 1D-EMA100\n\n-BULL FLAG FORMATION\n\nPOSSIBLE SHORT SQUEEZE 👀",
    "bias": "Loss Aversion",
    "id": "1951568317749305555"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Bitcoin always pump hard in August of \nthe post halving year \n\n2013: 30% \n2017: 65% \n2021: 13% \n2025: ?",
    "bias": "Euphoria / Greed",
    "id": "1951529265062920554"
  },
  {
    "user": "@FuturumEquities",
    "text": "THIS WEEK'S EARNINGS WILL BE WILD FOR GROWTH INVESTORS \n\n• Mon: $PLTR, $HIMS, $MELI, $AXON, $NVTS\n• Tues: $AMD, $SMCI, $ALAB, $DOCN, $RXRX, $ANET, $RIVN, $UPST, $TOST, $ZETA, $OPEN, $LMND, $GLXY\n• Wed: $APP, $SHOP, $U, $OSCR, $IONQ, $RDW, $DKNG, $ABNB, $DUOL, $DASH, $FTNT, $JOBY, $SYM, $BROS, $HUBS, $PAYC\n• Thu: $RKLB, $TTD, $SOUN, $CELH, $DDOG, $VST, $XYZ, $TEAM, $MP, $QBTS, $PGY, $FROG\n• Fri: $TEM",
    "bias": "None",
    "id": "1952004924012958155"
  },
  {
    "user": "@StockSavvyShay",
    "text": "MY $HIMS EARNINGS PREVIEW \n\nHims has been through it. First came the rip on the $NVO partnership. Then came a 35% collapse when that deal fell apart. Now it’s clawed back near the highs, with short interest still hovering above 30%. Everyone’s waiting to see if the next leg is a squeeze or a flush.\n\nBut what’s getting lost in the noise is the business underneath. While all eyes are on GLP-1s and semaglutide drama, the core of what Hims is building isn’t about any one drug. It’s a full-stack digital healthcare platform. 2.4M subs. 95% recurring revenue. 85% retention. ARPU up 50% YoY. And it’s profitable.\n\nThey’ve vertically integrated fulfillment, pharmacy, diagnostics, and compounding -- turning D2C care into a subscription engine, not a transactional marketplace. The GLP-1 headlines are a distraction. They’re already shifting toward liraglutide, oral options, and custom formulations in markets like Canada, where patent windows are opening.\n\nThe bigger risk isn’t $NVO. It’s $AMZN. Prime members now get One Medical for $9/month -- 24/7 virtual care, in-person visits, and same-day delivery in major metros. Amazon doesn’t need to win on product. It wins on price, bundling, and logistics -- weapons most healthtech players can’t match.\n\nBut that doesn’t mean Hims is finished. In every consumer category Big Tech enters -- music, streaming, hardware -- people assume the pure-plays are toast. But the ones that know their audience, build real product depth, and keep executing… survive. Sometimes they even lead -- look at $SPOT & $NFLX. Hims may not win on scale, but brand and trust matter in healthcare -- and they’ve carved that lane better than anyone.\n\nHeading into earnings, my eyes are on one thing: margins. After peaking at 82% in late 2023, they’ve fallen three straight quarters to 77%, wiping out nearly two years of efficiency gains.\n\nFor Hims, margin is the cleanest signal of platform leverage. This isn’t just about top-line growth -- it’s about whether unit economics are compounding as the business scales. When the engine’s running, margins expand. When they contract, it raises questions about moat and durability.\n\nThis trend needs to reverse. Last quarter’s hit came from compounded mix, but if vertical integration is working -- cutting out middlemen and absorbing fulfillment costs -- we should see stabilization or even a bounce. That’s the signal I’m watching.",
    "bias": "FOMO",
    "id": "1952001057841688702"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL IS NOW THE MOST PROFITABLE COMPANY IN THE WORLD WITH $116B IN ANNUAL NET INCOME",
    "bias": "None",
    "id": "1951989481831092629"
  },
  {
    "user": "@StockSavvyShay",
    "text": "WHY $NVDA WILL DOMINATE ITS NEXT EARNINGS REPORT?\n\nHyperscalers just spent $88B in CapEx: \n• $AMZN: $32B\n• $GOOGL: $22B\n• $MSFT: $17B\n• $META: $17B",
    "bias": "Herd / Bandwagon",
    "id": "1951980390497050935"
  },
  {
    "user": "@StockSavvyShay",
    "text": "MY $AMD EARNINGS PREVIEW: WHY THIS QUARTER MATTERS MORE THAN EVER\n\nI think we’re about to see the most important earnings print in AMD’s history -- not because Q2 will be flawless, but because it’s the clearest test yet of whether AMD’s AI transformation has teeth. The business is evolving fast. And the way the market re-rates this name over the next 12–18 months will hinge on how AMD threads the needle between growth and profitability at a platform scale.\n\nMargins Will Dip, but That’s Not the Point\n\nLet’s be clear: margins will still be under pressure. Gross margins could fall to 52% due to a mix of high-bandwidth memory costs, 5nm packaging, and ROCm ecosystem investments. That’s to be expected when you’re ramping a next-gen AI platform from scratch. But underneath that margin compression is something far more important -- AMD is starting to price like a leader, scale like a leader, and land contracts like a leader. \n\nFrom Underdog to Platform Contender\n\nThe MI350 pricing bump from $15K to $25K is a flashing signal to the street. This is no longer a “budget” option to $NVDA Blackwell stack. It’s a viable, competitive product with real performance credentials, being adopted at scale by hyperscalers like $ORCL and major inference users like $TSLA. And it's backed by a growing ROCm ecosystem with better compiler support, Hugging Face integrations, and day-one $META LLaMA 4 readiness. When you combine that with the fact that AMD is already taking CPU share from $INTC on both the client and server side, and layering in rack-scale design capabilities via the ZT Systems acquisition, the strategic picture becomes clearer: AMD is building a full-stack, disaggregated alternative to the vertically integrated AI infra model.\n\nThe Optionality Is What’s Explosive\n\nThat’s why I’m more excited about AMD than I’ve ever been. But because the optionality in the model is exploding. GPU revenue could exceed $4B this year. AI as a % of total revenue is rising. The data center segment is approaching 50% of total business. And while consensus still models a trough in Q2, the ramp into H2 looks like the beginning of a multi-year compounding engine -- especially if AMD nails the MI355X launch and reopens MI308X shipments to China.\n\nA Re-Rating Moment in the Making?\n\nThis quarter is less about the numbers and more about whether the market finally accepts AMD as more than a challenger. If management guides Q3 revenue above $8B and shows any signs of margin re-expansion, the market will have to start pricing this company as a legitimate AI infrastructure platform -- one that offers hyperscalers flexibility, pricing leverage, and a non-CUDA path to LLM scaling. That shift in perception, combined with already rising demand for MI-series chips, is what could justify a move toward $200+ over the next 12 months.\n\nBottom line: I don’t expect a melt-up on earnings. The stock is extended, RSI is hot, and any in-line guide could lead to a short-term fade. But this is the first time in AMD’s history where every part of the business -- CPUs, GPUs, software, system design -- is moving in the same direction.",
    "bias": "FOMO",
    "id": "1951635961621733880"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$JOBY IS WEIGHING A DEAL TO ACQUIRE $BLDE -- GIVING IT A BUILT-IN URBAN MARKET AHEAD OF ITS 2026 eVTOL LAUNCH",
    "bias": "None",
    "id": "1951767820553077139"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HELP US PICK NEXT WEEK'S PODCAST DEEP DIVE\n\nWhich company should Daniel and I dive into for Friday’s @FuturumEquities podcast? We’ll spend 10–15 minutes breaking it down.\n\nDrop a comment below if you want to suggest a different name 👇🏼",
    "bias": "Contrarian",
    "id": "1951718204193255824"
  },
  {
    "user": "@danielnewmanUV",
    "text": "Futurum Equities Pod is now on Apple and Spotify. \n\nLove y’all to check it out (below), subscribe, review, and send Shay your criticism 😏\n\nThis week we hit $AAPL $MSFT $HOOD $META $SOFI and more 👇🏻🙏🏻🔥",
    "bias": "None",
    "id": "1951705892199780611"
  },
  {
    "user": "@FuturumEquities",
    "text": "FUTURUM EU DEAL DOZEN REVEAL\n\nWe curated the Futurum EU Deal Dozen -- companies we believe will see accelerated demand from the U.S.–EU trade deal.\n\nRanked by our proprietary AIRometer Score 👇",
    "bias": "None",
    "id": "1951691413093323233"
  },
  {
    "user": "@StockSavvyShay",
    "text": "My new trade 👇🏼",
    "bias": "None",
    "id": "1951665365936955554"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE ARE THE TOP 5 NAMES ON MY WATCHLIST\n\n1). $GOOGL  -- Data Engine of the Modern Web\n2). $HOOD -- Command Hub of Modern Investing\n3). $ASTS -- Cell Tower in the Sky\n4). $OKLO -- Reactor of the AI Energy Era\n5). $AMD --  Inference Engine of the Agentic AI Economy",
    "bias": "None",
    "id": "1951647303158452527"
  },
  {
    "user": "@jonnajarian",
    "text": "thank you Mr Secretary!",
    "bias": "None",
    "id": "1951790265301151817"
  },
  {
    "user": "@jonnajarian",
    "text": "All just a coincidence i'm sure",
    "bias": "None",
    "id": "1951789379350888478"
  },
  {
    "user": "@jonnajarian",
    "text": "She makes some great points (parody)",
    "bias": "None",
    "id": "1951659016217645275"
  },
  {
    "user": "@jonnajarian",
    "text": "The logic here is undeniable",
    "bias": "None",
    "id": "1951645956807459172"
  },
  {
    "user": "@jonnajarian",
    "text": "Thank goodness liberals don't run the world anymore",
    "bias": "None",
    "id": "1951641826688917621"
  },
  {
    "user": "@NorthmanTrader",
    "text": "NorthCast Market Update: Kisses\n\nAmazingly precise technical reactions across multiple indices across the world, definitely worth being aware of.\n\npiped.video/watch?v=Bzpy5Sxo…",
    "bias": "None",
    "id": "1951645759947841695"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Quite the scene: $MSFT weekly close.",
    "bias": "None",
    "id": "1951598766714245564"
  },
  {
    "user": "@business",
    "text": "Finance as entertainment: As US option volumes reach records, Tom Sosnoff's tastytrade is selling complex strategies to retail traders through live shows and videos bloomberg.com/news/features/…",
    "bias": "Herd / Bandwagon",
    "id": "1951991474360381668"
  },
  {
    "user": "@biancoresearch",
    "text": "In recent years, all survey response rates have collapsed (chart). This is true for a political survey, a business customer satisfaction survey, or a government economic survey, which have seen respondents refuse or become uninterested in participating. This leads to ever larger error rates.\n\nThe trend in the chart is not reversing, so expect it to get worse.\n\n(My take: technology has made surveys easy to conduct, and way too many exist. So they lose their appeal. Not helping is the perception that political polls are biased and highly inaccurate, which has \"poisoned the well\" for all surveys. Furthermore, social media now provides people with an outlet to express their opinions. Filling out surveys, no matter their intention, has lost its appeal.) \n---\nSee how the University of Michigan Consumer Confidence Survey has been poisoned by partisanship.  Three years ago, the Federal Reserve proclaimed this one of its most important indicators.\n\nThe era of surveys is over. Unfortunately, surveys are the backbone of economic data. What is now required is to measure actual output, not samplings or opinions about it.\n\nIn the case of the jobs market, the solution can be to connect with the IRS databases and obtain real-time withholding data for every job in the country.\n\nBLS statisticians and IRS employees will likely agree and then drone on about the cost. \n\nThe cost can be free.  @elonmusk  tried to do it for free, and DC rebuffed him. If you don't like him, call Alex Karp @PalantirTech, CEO of Palantir, I'll bet you can talk him into doing it for free. Others might say the same.\n\nGovernment statisticians seem to have as their goal flawless execution of a flawed process. This has to change.\n\n@chamath @NickTimiraos  @BobEUnlimited",
    "bias": "FOMO",
    "id": "1951847270900482386"
  },
  {
    "user": "@biancoresearch",
    "text": "How \"exercised\" was Trump about the Fed today?\n\nDaily chart back to the beginning of the year of all of Trump's Fed-related \"truths.\"\n\nToday was a record, three times the old record.",
    "bias": "Herd / Bandwagon",
    "id": "1951465970545074569"
  },
  {
    "user": "@biancoresearch",
    "text": "Did Trump give us a \"tell\" about the coming payroll report, and everyone on Wall Street (including me) missed it?\n---\nHere are Trump's three Fed-related \"truths\" in the 25 hours before the payroll report.\n\nIn my subjective opinion, he was more strident and harsher than usual in his criticism of Powell.\n\nThis is especially the case for the two \"truths\" this morning, in the two hours before the release, when he could have seen the full report.\n\nWITH HINDSIGHT, it does read like him lashing out against Powell, blaming him for a weak payroll report that was not yet released.",
    "bias": "Herd / Bandwagon",
    "id": "1951462938935484806"
  },
  {
    "user": "@biancoresearch",
    "text": "What a Whipsaw!",
    "bias": "Panic / Capitulation",
    "id": "1951433643894722882"
  },
  {
    "user": "@KeithMcCullough",
    "text": "BULLISH (for Monday): I Fully Expect A September Rate Cut app.hedgeye.com/insights/169… via @hedgeye",
    "bias": "Euphoria / Greed",
    "id": "1951983288861475265"
  },
  {
    "user": "@KeithMcCullough",
    "text": "If you want to be bearish, being accurately bearish helps \n\nHere are 1/2 of my current Macro ETF Short Positions (which you can see in our ETF Pro product) \n\n#Timestamped",
    "bias": "Recency Bias",
    "id": "1951961940009336894"
  },
  {
    "user": "@KeithMcCullough",
    "text": "“For over thirty-five years, the Thomas J. Watson Research Center of the International Business Machines Corporation provided a unique haven for a variety of investigations that science and society demanded but Academia neither welcomed nor rewarded.” -Mandelbrot \n\n#BLSdata #government @federalreserve @SecScottBessent",
    "bias": "None",
    "id": "1951747072698277891"
  },
  {
    "user": "@KeithMcCullough",
    "text": "From the sweat of labor, humility blooms",
    "bias": "None",
    "id": "1951742612425036182"
  },
  {
    "user": "@KeithMcCullough",
    "text": "These Perma Bear Newsletter Guys are entertaining (we download their headlines into an AI Contra-Stream feed) #GreatFades",
    "bias": "Herd / Bandwagon",
    "id": "1951736778349543431"
  },
  {
    "user": "@KeithMcCullough",
    "text": "How was this for timing back in April?",
    "bias": "Overconfidence",
    "id": "1951735945453023423"
  },
  {
    "user": "@einthekitchen",
    "text": "I can finally answer yes to Keith’s 3am tweets about the guy running your money being awake. Great work McGroarty!",
    "bias": "None",
    "id": "1951702870883250353"
  },
  {
    "user": "@HedgeyeAM",
    "text": "Hedgeye Asset Management CIO John McNamara sits down with Hedgeye Quality Growth ETF (NYSE: HGRO) Portfolio Manager Sam Rahman (@SamofAmerica) for a wide-ranging conversation on Sam’s investment journey—from his time at the Fidelity Family Office and lessons learned from legendary investor Ned Johnson, to the philosophy and strategy behind his concentrated, actively managed ETF HGRO.\n \nTo learn more about our holdings and for important information about the fund, please click here: hedgeyeam.com/HGRO",
    "bias": "Overconfidence",
    "id": "1951637927059964280"
  },
  {
    "user": "@KeithMcCullough",
    "text": "\"Temporal goods are subject to man, that he may use them according to his needs, not that he should make them his main purpose, or be overly anxious about them” -St Thomas Aquinas",
    "bias": "None",
    "id": "1951582017239322811"
  },
  {
    "user": "@KeithMcCullough",
    "text": "1 down day and panic resumes",
    "bias": "Panic / Capitulation",
    "id": "1951579168673550369"
  },
  {
    "user": "@Beth_Kindig",
    "text": "HBM demand from GPUs is expected to rise 23% YoY in 2026, while ASICs demand is projected to surge 82%, taking its share of the market up to 33%, per Goldman Sachs. \n\n$NVDA $AMD $AVGO $MRVL $MU",
    "bias": "None",
    "id": "1951764852332216709"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Google Cloud $GOOG added nearly $5.5 billion in ARR in Q2, its highest on record and a more than 4x increase from $1.2 billion in Q1.\n\n$MSFT $AMZN",
    "bias": "Euphoria / Greed",
    "id": "1951751311361556884"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Piper Sandler recently rated Palantir $PLTR at overweight, saying the stock \"has a one-of-a-kind growth + margin model that if proven durable could grow into a $24B run-rate by CY32E.\"",
    "bias": "Recency Bias",
    "id": "1951625291606212705"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Nvidia $NVDA and MediaTek have reportedly delayed their co-developed Arm-based PC chip, the N1X, until Q1 2026. The chip is a modified version of Nvidia’s GB10 chip for its Project Digits computer, built on TSMC’s N3B process.\n\n$ARM $AMD $QCOM $INTC $TSM",
    "bias": "Recency Bias",
    "id": "1951654174841819282"
  },
  {
    "user": "@RedDogT3",
    "text": "You never know where the active corrective phase can take u. So once the $SPX breaks the 8 day, it’s always better to get more tactical.  This way u can test levels below vs being trapped if u trade for a living.",
    "bias": "Sunk Cost Fallacy",
    "id": "1951998011208278083"
  },
  {
    "user": "@RedDogT3",
    "text": "Some ask what’s my Financial Road Map doing now they the $spx is below the 8/21day",
    "bias": "None",
    "id": "1951997640456978678"
  },
  {
    "user": "@RedDogT3",
    "text": "Get my #1 options idea every week:\n\nt3live.com/ppo",
    "bias": "Herd / Bandwagon",
    "id": "1951996474251718743"
  },
  {
    "user": "@RedDogT3",
    "text": "#1. $spx below 8/21 day the active account becomes MORE active (more Day Trades)\n\n#2 not many swing long trades now. \n\n#3. Less risk on so BOX holds less and does less\n\n#4 option account gets more busy- risk premium paid.   Higher Vix.  Sell some premium and play options in case spots don’t work \n\n#5 401k keeps monthly flows a corrective phase Helps average cost \n\n#6 529 keeps monthly flow as a corrective phase helps average cost for college \n\n#7 BOS is in full cash and starts 4%-5% off highs so might come into play again. We only did two this year \n\n# 8 whole life in two years is 20 years in. Nice cash value building and death benefit",
    "bias": "FOMO",
    "id": "1951994115895230753"
  },
  {
    "user": "@RedDogT3",
    "text": "Nice write up @chace_r18 \nYoung Parents.  Start em Early",
    "bias": "None",
    "id": "1951823275106894320"
  },
  {
    "user": "@TheDealTrader_",
    "text": "Lessons from Rich Dad Poor Dad",
    "bias": "None",
    "id": "1951752868765077972"
  },
  {
    "user": "@RedDogT3",
    "text": "Interesting",
    "bias": "None",
    "id": "1951822319401189379"
  },
  {
    "user": "@mybookmojo",
    "text": "MACD indicator cheat sheet",
    "bias": "None",
    "id": "1951568906784518573"
  },
  {
    "user": "@RedDogT3",
    "text": "I love seeing like minded individuals from around the World supporting their kids dreams @chace_r18 thanks for saying hi",
    "bias": "Loss Aversion",
    "id": "1951682401412800927"
  },
  {
    "user": "@RedDogT3",
    "text": "4 tips for trading earnings",
    "bias": "None",
    "id": "1951679887678533710"
  },
  {
    "user": "@RedDogT3",
    "text": "If you don't have $$, spend a little time learnings:\n\nFree trading education:\n\nt3live.com/learning-center/s…",
    "bias": "None",
    "id": "1951634337679765678"
  },
  {
    "user": "@RedDogT3",
    "text": "The best players in the World do the little things at the highest levels!",
    "bias": "Euphoria / Greed",
    "id": "1951632287411400967"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None",
    "id": "1951630193484849659"
  },
  {
    "user": "@RedDogT3",
    "text": "This is what a recruitment camp looks like.  Lotta kids for a few spots!👀",
    "bias": "None",
    "id": "1951629496185983343"
  },
  {
    "user": "@alphatrends",
    "text": "This means a lot to me\n\nThe most liked X post in the last 3 months was about he loss of ZZ\n\nthank you for being kind humans",
    "bias": "None",
    "id": "1951451583377764642"
  },
  {
    "user": "@alphatrends",
    "text": "Stock Market & Crypto Analysis for Week Ending 8/1/25\n\n$SPY $QQQ #Bitcoin $AAPL $SMH $NVDA $AMZN $GOOGL $META $MSFT #Ethereum #Solana etc",
    "bias": "Confirmation Bias",
    "id": "1951450451033071762"
  },
  {
    "user": "@leadlagreport",
    "text": "The ATAC Credit-On/Credit-Off Index (JOJO.INDEX) rotates between long-term US treasuries & high yield junk debt on a weekly basis based on the performance of Utilities and the broad stock market.           \n\nAs of Friday, the Index remains junk-off.     marketvector.com/indexes/cus…",
    "bias": "Euphoria / Greed",
    "id": "1951758321620250898"
  },
  {
    "user": "@leadlagreport",
    "text": "I’m beyond excited about what @Mela_Schaffer is building.\n\nMake sure you follow her right now.\n\nAbsolutely incredible market content coming shortly.",
    "bias": "None",
    "id": "1951672571713171816"
  },
  {
    "user": "@LeadLagMedia",
    "text": "The USDA says ground beef is averaging $6.12 a pound, up nearly 12% from a year ago.\n\nSo, what are my protein bros doing? Are we eating more chicken?",
    "bias": "None",
    "id": "1951679397498323156"
  },
  {
    "user": "@LeadLagMedia",
    "text": "In a July survey of 1,267 U.S. small-business owners by digital marketing platform Constant Contact, 44% of respondents said demand for services and products is higher than they had forecasted back in January.\n\nMoreover, a third were extremely optimistic that their business would perform better in the coming three months, and nearly a third expect to add more employees by then.\n\nIs it party time?",
    "bias": "Euphoria / Greed",
    "id": "1951869391936634921"
  },
  {
    "user": "@LeadLagMedia",
    "text": "Nearly 32% of people aged 15 and above in low-income countries reported having a mobile money account.\n\nAt the same time, only 26% reported having a traditional bank account. \n\nThe future is now.",
    "bias": "None",
    "id": "1951992958183494113"
  },
  {
    "user": "@leadlagreport",
    "text": "Bring back real music",
    "bias": "None",
    "id": "1951825488604750259"
  },
  {
    "user": "@leadlagreport",
    "text": "Bring back from real music",
    "bias": "None",
    "id": "1951814947626692997"
  },
  {
    "user": "@leadlagreport",
    "text": "AND WHY THE FUCK IS DOGECOIN DOWN",
    "bias": "Euphoria / Greed",
    "id": "1951810145249345643"
  },
  {
    "user": "@leadlagreport",
    "text": "Engagement on X has been terrible the last few days",
    "bias": "None",
    "id": "1951803087129338331"
  },
  {
    "user": "@AskPerplexity",
    "text": "The ATAC Credit-On/Credit-Off Index (ticker: JOJO) is a tactical index that switches between long-term US Treasuries and high-yield “junk” corporate bonds each week, based on a signal comparing the recent performance of US utilities stocks and the broader equity market.\n\nWhen utilities outperform, the index moves into the safety of Treasuries (“junk-off”); when the broad market is strong, it rotates into riskier high-yield debt (“credit-on”), aiming to capture gains but avoid big drawdowns.\n\nAs of the latest update, the index is “junk-off”—so right now, it’s positioned defensively in Treasuries instead of high-yield bonds.\n\nThis approach is designed to provide investors with a dynamic allocation depending on risk signals from the stock market, and you can see from the chart that it’s delivered strong cumulative returns since inception, up about 483%.",
    "bias": "Recency Bias",
    "id": "1951760866484822064"
  },
  {
    "user": "@UltimateAdvisor",
    "text": "Also, let’s remember markets don’t tend to crash until margin debt begins to decline.",
    "bias": "Panic / Capitulation",
    "id": "1951684809744658622"
  },
  {
    "user": "@leadlagreport",
    "text": "My default now is to think every video is AI",
    "bias": "None",
    "id": "1951674273258410368"
  },
  {
    "user": "@LeadLagMedia",
    "text": "The US will soon require international visitors to pay a $250 \"visa integrity fee\" in addition to existing visa costs.\n\nThe fee only applies to visitors who are required to obtain nonimmigrant visas (of which there were nearly 11 million in 2024).\n\nHowever, the fee is reimbursed after the trip is over (assuming the traveler complied with their visa conditions).\n\nGood idea?",
    "bias": "None",
    "id": "1951640888372863264"
  },
  {
    "user": "@LeadLagMedia",
    "text": "National median home sale prices in the US rose on an annual basis for the 24th consecutive month in June, reaching a record high of $435,300.",
    "bias": "Euphoria / Greed",
    "id": "1951644646225961391"
  },
  {
    "user": "@LeadLagMedia",
    "text": "Things really are looking up...\n\nRespondents in the University of Michigan's May survey said they expect year-ahead inflation to hit 6.6% (a 23-year high).\n\nTwo months later, that number is down 2.2 percentage points to 4.4%.",
    "bias": "Euphoria / Greed",
    "id": "1951666052464546236"
  },
  {
    "user": "@leadlagreport",
    "text": "Is A Bottoming In China The Catalyst For A Global Risk Repricing?, by @leadlagreport open.substack.com/pub/leadla…",
    "bias": "None",
    "id": "1951665755684041178"
  },
  {
    "user": "@leadlagreport",
    "text": "The whole rally is built on speculative leverage.\n\nThe precursor to every single crash in history is leverage.",
    "bias": "FOMO",
    "id": "1951621778368848121"
  },
  {
    "user": "@leadlagreport",
    "text": "Alex want me ded",
    "bias": "None",
    "id": "1951618904607871068"
  }
]