[
  {
    "user": "@StockSavvyShay",
    "text": "Jensen Huang is basically saying custom chips from $GOOGL, $AMZN, $AMZN, $MSFT & $META struggle to compete with $NVDA because Nvidia is singularly focused on AI acceleration at a scale no one else matches.\n\nCUDA is the default language developers build on, NVLink is still ahead when it comes to scaling GPUs together and Nvidia spends ~$20B a year with its entire org dedicated to making AI faster. \n\nThe simple reality is Nvidia is all-in, all the time.",
    "bias": "None",
    "id": "2017977619883675683"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL CEO Sundar Pichai said they don’t fully understand their own AI systems after models began doing things they weren’t explicitly programmed to do.\n\nOne model even taught itself a foreign language.",
    "bias": "None",
    "id": "2017960310033048030"
  },
  {
    "user": "@StockSavvyShay",
    "text": "SpaceX just filed with the FCC to launch up to 1M satellites designed to function as solar-powered orbital data centers creating massive AI compute capacity in space.\n\nElon wants to use Starship’s low launch costs and laser-linked satellites to scale AI compute without stressing Earth’s power grid.",
    "bias": "None",
    "id": "2017952081014075459"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$ASML machines use extremely tiny light (~13.5 nanometers wide) to draw patterns on computer chips allowing chipmakers to create features thousands of times thinner than a human hair.\n\nThe smaller those patterns are, the more powerful and energy-efficient the chips become.",
    "bias": "None",
    "id": "2017934588925100160"
  },
  {
    "user": "@StockSavvyShay",
    "text": "If you’re wondering why asset prices are getting hit like gold down over 10% and silver down more than 30% in a day then listen to this Kevin Warsh clip. \n\nHe’s openly critical of QE and favors a tighter Fed balance sheet which means less liquidity across markets.",
    "bias": "None",
    "id": "2017928064588730823"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Jensen Huang said AI performance depends on both HBM & LPDDR highlighting just how critical memory is to $NVDA stack which is an obvious tailwind for suppliers like $MU.\n\nHe added that demand is still growing faster than supply across the chain.",
    "bias": "None",
    "id": "2017787957307183232"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Jensen Huang said $TSM will need to “work very hard” this year to meet $NVDA needs for wafers and CoWoS.\n\nHe added that demand remains very strong and that TSMC is doing an “incredible job” ramping supply.",
    "bias": "None",
    "id": "2017772183179956644"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Waymo is finalizing a $16B raise at a ~$110B valuation with $GOOGL supplying over 75% of the capital alongside Sequoia Capital.\n\nSources say ARR is now $350M+ and the round was 3x oversubscribed.",
    "bias": "None",
    "id": "2017691136001994884"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$MSTR Bitcoin position has officially turned negative as $BTC slips below $76,000.\n\nThis is the first time Bitcoin has traded below Michael Saylor’s cost basis since October 2023.",
    "bias": "None",
    "id": "2017675024711487946"
  },
  {
    "user": "@StockSavvyShay",
    "text": "BITCOIN $BTC JUST DROPPED BELOW $80,000",
    "bias": "None",
    "id": "2017647264324530586"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$ASML just raised EUV machine prices ~50% since last year to $284M per machine.\n\nThis is what true monopoly power looks like when demand explodes and customers have zero alternatives.\n\nASML is the only company on Earth that makes EUV lithography machines where $TSM + $INTC need them to produce the advanced nodes that power $NVDA + $AMD GPUs, $GOOGL TPUs and every other frontier AI accelerator.",
    "bias": "None",
    "id": "2017642161718890694"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$SOFI just posted its largest quarterly member growth ever by adding 1M new members in Q4.\n\nThe company is positioning itself as the full digital on-ramp where retail banking, investing and digital assets converge.",
    "bias": "None",
    "id": "2017633394407133559"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Stanley Druckenmiller said in 2023 that copper was “the tightest position I’ve ever studied.”\n\nThe AI economy’s power buildout only tightens that further with every viable path running straight through copper.\n\nInitiated a starter position in the growth port for copper exposure.",
    "bias": "None",
    "id": "2017606430979985429"
  },
  {
    "user": "@jonnajarian",
    "text": "\"George Soros that's funding these operations. These people are being paid between $80 and $120,000 a year to be paid protesters.\"\n\nI hope @SecScottBessent gets the goods on Soros soon, as George is funding an insurrection.",
    "bias": "None",
    "id": "2017955763973476826"
  },
  {
    "user": "@jonnajarian",
    "text": "Go get 'em Nick @nickshirleyy!! I cannot wait for the fraud videos from what was once the golden state!",
    "bias": "None",
    "id": "2017954451437273232"
  },
  {
    "user": "@jonnajarian",
    "text": "what did you expect Virginia?",
    "bias": "None",
    "id": "2017675617819599067"
  },
  {
    "user": "@jonnajarian",
    "text": "Now THAT's marketing!",
    "bias": "None",
    "id": "2017666070413512815"
  },
  {
    "user": "@jonnajarian",
    "text": "Dude F'ed around and found out",
    "bias": "None",
    "id": "2017665698735264228"
  },
  {
    "user": "@jonnajarian",
    "text": "People confuse gifts with hard work all the time. Gifts get you so far, but without hard work gifts can be wasted.",
    "bias": "None",
    "id": "2017664679661928590"
  },
  {
    "user": "@jonnajarian",
    "text": "Legendary college football coach Lou Holtz has entered hospice care. I join my brother @petenajarian & coach's family, players & friends in saying prayers for this incredible example that he's been to so many of us.",
    "bias": "None",
    "id": "2017656503151599816"
  },
  {
    "user": "@jonnajarian",
    "text": "\"Am I the only one\" @Aaronlewismusic \npiped.video/zkKb4Zt48x8?si=CaX-…",
    "bias": "None",
    "id": "2017622481163710579"
  },
  {
    "user": "@biancoresearch",
    "text": "Will this complicate his nomination to be Fed chair?\n--\nKevin Warsh is named in the latest Epstein files release:\n\n* 2010 St. Barts Xmas guest list email \n\n* Dinner attendee hosted by British Aristocrat William Astor. \n\nNo island visits or misconduct evidence.",
    "bias": "None",
    "id": "2017839118978347369"
  },
  {
    "user": "@biancoresearch",
    "text": "4/4\n\nToday, it is silver-market stress (for now??). See the last few days of premium/discounts.\n\nIf silver \"rights the ship\" in the next few days, we live to fight another day.\n\nIf not, that \"another day\" might be now for the firms caught on the wrong side of this liquidity gap.",
    "bias": "None",
    "id": "2017834787885519253"
  },
  {
    "user": "@biancoresearch",
    "text": "3/4\n\nWhile -1.7% sounds small vs 19%, it is historically massive.\n\nThis is the deepest liquidity dislocation in $SLV since Aug 9, 2011—the day after the US lost its AAA rating.\n\nDiscounts don't mean the ETF is broken. They signal the underlying market is under severe stress.",
    "bias": "None",
    "id": "2017834786119684242"
  },
  {
    "user": "@biancoresearch",
    "text": "2/4\n\nBut the stress is still real.\n\nThe chart below recalculates SLV's \"fair value\" at 4 PM ET using spot prices to eliminate the timing lag.\n\nWhen we do that, the \"timing\" 19% discount vanishes, revealing the real discount: -1.7%.\n\n@dampedspring @EricBalchunas @SantiagoAuFund",
    "bias": "None",
    "id": "2017834784223879227"
  },
  {
    "user": "@biancoresearch",
    "text": "1/4\n\nThe viral \"19% discount\" in $SLV is a timing artifact, not a broken product.\n\nThe Official NAV is based on the London Fix (~7 AM ET). This means the official price missed the entire afternoon crash in the US futures market.🧵",
    "bias": "None",
    "id": "2017834781740814705"
  },
  {
    "user": "@biancoresearch",
    "text": "To be clear, I said the \"silver market is broken,\" not $SLV is broken.\n\nETFs always trade at premiums/discounts. That does not mean something is wrong with the ETF. Instead, extremes signal problems in the underlying market.\n\nLike this chart, the biggest move in 75+ years.",
    "bias": "None",
    "id": "2017763045057917281"
  },
  {
    "user": "@EricBalchunas",
    "text": "$SLV saw volume than the most traded stocks on the planet last week, I still can't get over that. More than Tesla, more than Nvidia (chart). It's not even gold either, it's fricken silver. A month ago the volume was 10x less. A year ago it was the 170th biggest ETF, out of sight, out of mind. The only thing in recent memory that's felt similar is $GME and maybe $MSTR.",
    "bias": "None",
    "id": "2017724794708353494"
  },
  {
    "user": "@biancoresearch",
    "text": "\"Nah… nothing is broken\"\n\nJust the biggest single-day decline in at least 75 years.\n\nAll is well, all is normal. Nothing to see here ... move along.",
    "bias": "None",
    "id": "2017756797998645382"
  },
  {
    "user": "@biancoresearch",
    "text": "SLV's NAV was $95 on Friday. The closing price was $75 (the record 19% discount).\n\nSilver can be unchanged on Monday (NAV stays at $95), and the price can be up $20 (or 27%) to close this premium/discount.\n\nMy guess is we SHOULD see massive degen/retail buying right on the open Sunday night, trying to take advantage of the massive discount.\n\nIf that does not happen, or the immediate bound fades into Monday, I would interpret that as a forced liquidation steamrolling the degens/retail. \n\nForced liquidation is the result of a troubled firm being forced to sell due to margin calls and other immediate creditor demands, in a desperate attempt to stay solvent.\n\nIf the bounce holds, however, this market is \"righting\" itself, the premium/discount is closing, and everyone lives to die another day.",
    "bias": "None",
    "id": "2017722773645222394"
  },
  {
    "user": "@biancoresearch",
    "text": "Yesterday's 19% discount to NAV broke the record set on 10/10/2008, the day the TARP was introduced during the Global Financial Crisis.\n\nBefore Friday's collapse, SLV had about $60 billion in assets.\n\nThe chart above shows that the silver market is now broken, meaning there is a high risk that a financial firm heavily involved in this market is either bankrupt (causing the large discount above) or in serious trouble (due to the large discount above).\n\nIt doesn't mean we will automatically see a firm fail, but the silver market needs to correct itself quickly; otherwise, it probably will.\n\nQuickly correct itself = Monday or Tuesday.",
    "bias": "None",
    "id": "2017718845474300085"
  },
  {
    "user": "@biancoresearch",
    "text": "5/5\n\nDon’t get excited if Larry Fink likes you. Work to take his business away from him.\n\nnitter.net/BitcoinMagazine/status…\n\nIt will be hard, but:\n\nA South African outsider didn't ask the aerospace establishment or Detroit for permission. He just rendered them obsolete. 🚀\n@elonmusk",
    "bias": "None",
    "id": "2017698479603060819"
  },
  {
    "user": "@biancoresearch",
    "text": "4/5\n\nWinter continues until a new narrative emerges.\n\nIt won't be about institutional permission. It will be about replacement.\n\nThe next leg up belongs to builders creating an alternative financial system (BTC/DeFi/Stables) that makes legacy finance irrelevant.",
    "bias": "None",
    "id": "2017698477719892104"
  },
  {
    "user": "@biancoresearch",
    "text": "2/5\n\nYes, we saw a marginally higher high in Oct 2025 ($126k), but it was a \"zombie rally.\" \n\nIt looked like a breakout, but it was just residual momentum. The smart money riding the institutional adoption wave had begun exiting in Dec 2024.\n\nStop chasing a ghost.",
    "bias": "FOMO",
    "id": "2017698473034838078"
  },
  {
    "user": "@biancoresearch",
    "text": "Bitcoin is now below $80k for the first time since April 7th.\n\nThis was just a few days after the April 2nd \"Liberation Day\" collapse began, when markets were in full hyperventilation mode.\n\n$BTC",
    "bias": "None",
    "id": "2017659030093561863"
  },
  {
    "user": "@PriceAction",
    "text": "Gold went through the top of the Risk Range, which is a place to take profit. \nIf one follows the process, there should not have been any bag holding there.\nIt did take me a while to learn the Hedgeye process, but once you learn it, it keeps  you out of trouble.",
    "bias": "None",
    "id": "2017961118937784593"
  },
  {
    "user": "@KeithMcCullough",
    "text": "You'll see a lot of bears come out of the woods this weekend...\n\nBut the only major Macro Short that's really worked has been Bitcoin, Crypto, $MSTR, etc.\n\n$MSTY is the longest time-held SELL position in our ETF Pro product #timestamped",
    "bias": "None",
    "id": "2017931708469772773"
  },
  {
    "user": "@KeithMcCullough",
    "text": "If you got into these Gold, Silver, Metals, etc. Asset Allocations WHEN we did... \n\nThe only thing that matters is risk managing them WHEN the market gives you opportunities",
    "bias": "None",
    "id": "2017930867276927274"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Your \"experience\" as an investor is directly a function of WHEN you got in",
    "bias": "None",
    "id": "2017930515861409862"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Just a dumb tweet. Inclusive of last week's correction, Gold is still +74% from where Full Cycle Investors loaded up on it in FEB of last year",
    "bias": "None",
    "id": "2017925391239856532"
  },
  {
    "user": "@cathy_reif",
    "text": "Yes, I agree.  You were very clear about what could happen.   Thank you.  I listened to that part several times.",
    "bias": "None",
    "id": "2017762826312425607"
  },
  {
    "user": "@DaKnifeMan",
    "text": "By the end of the trading session on Thursday all my currency positions were at the minimum after booking gains, therefore my loss on Friday was also at the minimum. \nNew to the game but dang it felt good risk managing like a pro. @KeithMcCullough #thankscoach",
    "bias": "None",
    "id": "2017743011103289532"
  },
  {
    "user": "@KeithMcCullough",
    "text": "I'll give the mathematical setup on The Macro Show on Monday. Less narratives, more numbers",
    "bias": "None",
    "id": "2017727973265154206"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Not prophecy—process. Gold's fractal Vol Signal was just math and pattern recognition, not a crystal ball",
    "bias": "None",
    "id": "2017722324070379809"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Yep. Did everything I could. The Signals for a major Gold/Silver etc. correction (and another Bitcoin/Crypto Crash) were crystal clear",
    "bias": "None",
    "id": "2017698732368695712"
  },
  {
    "user": "@KeithMcCullough",
    "text": "VIDEO #timestamped : Don't Chase Silver At All-Time Highs app.hedgeye.com/insights/177… via @hedgeye $SLV",
    "bias": "None",
    "id": "2017695849963258261"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Reiterating @Hedgeye SELL views on both The Saylor's $MSTR and Telecom Tom's pumper $BMNR",
    "bias": "None",
    "id": "2017690262475038905"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Hearing our community is happy that they got out of Bitcoin and Crypto on time",
    "bias": "None",
    "id": "2017689737532682733"
  },
  {
    "user": "@Beth_Kindig",
    "text": "In my analysis hitting inboxes today, I examine what TSMC $TSM is signaling about the strength of the AI trade in commentary that offers multi-year visibility - which few companies in the AI ecosystem can match. Link in bio. \n\n$NVDA $AMD $AVGO",
    "bias": "None",
    "id": "2017957710881308702"
  },
  {
    "user": "@Beth_Kindig",
    "text": "By 2027, TrendForce projects the memory market to rise another 53% YoY to $842.7 billion, again led by DRAM with growth of 65% YoY to $667 billion. \n\nThis would represent approximately 7X growth in DRAM revenue from 2024’s $95.9 billion. \n\n$MU $AMD $NVDA $AVGO",
    "bias": "None",
    "id": "2017711246938628377"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Counterpoint Research estimates that cumulative AI ASICs shipments will reach 40 million at the top 10 hyperscalers from 2024 through 2028, with 15 million shipments in 2028.\n\n$AVGO $GOOG $META $MSFT",
    "bias": "None",
    "id": "2017727353653272877"
  },
  {
    "user": "@Beth_Kindig",
    "text": "This week I spoiled I/O Fund Members with a 60+ page report on the Top 15 AI Stocks for Q1 2026. \n\nDon't miss this in-depth report detailing many under-the-radar stocks leading the three key pillars of AI: networking, inference and energy. Link in bio.",
    "bias": "None",
    "id": "2017759109269835937"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Data center developers expect one-fifth of sites to exceed 1GW by 2030 and one-third by 2035, up from just one-tenth today, per Bloom.\n\n$MSFT $AMZN $GOOG $ORCL $NVDA",
    "bias": "None",
    "id": "2017630405420060968"
  },
  {
    "user": "@RedDogT3",
    "text": "This is what I tell my community all the time!",
    "bias": "None",
    "id": "2017958706672013787"
  },
  {
    "user": "@RedDogT3",
    "text": "Agreed!  I say all the time.  2-3 months a year make ur year. (So u must execute). The rest of the year u need to be very disciplined \n\nAlso 2/3 years make ur decade.  \nCost average ur career",
    "bias": "None",
    "id": "2017958565504323631"
  },
  {
    "user": "@TrendSpider",
    "text": "One of these lines has to be support right?  $BTC",
    "bias": "None",
    "id": "2017795051116761271"
  },
  {
    "user": "@RedDogT3",
    "text": "Seat time matters!  It helps ur develop a \nTraders “Feel” for the market",
    "bias": "None",
    "id": "2017954932796666261"
  },
  {
    "user": "@RedDogT3",
    "text": "I read this book many times",
    "bias": "None",
    "id": "2017953017631224055"
  },
  {
    "user": "@RedDogT3",
    "text": "I thought my $gld puts weren’t going to work. They worked huge on Friday. So did the \n$zsl (leverage short silver). Took a few days \n\nMy 20@520 leads into the #630club Monday thru Thursday.  Subscribe above as I will do some on Friday’s",
    "bias": "None",
    "id": "2017730373585678644"
  },
  {
    "user": "@RedDogT3",
    "text": "$bitcoin $72k-$74 is a good spot for longer term bitcoin investors to add. \n\nOr those looking to tier in!\n\nNo active traders should have been big as most of crypto has been below the 8/21 day for a month plus especially $bitcoin",
    "bias": "None",
    "id": "2017689360016023899"
  },
  {
    "user": "@MarketRebels",
    "text": "Scott Redler @RedDogT3 with @petenajarian at today's Active Trader Event in Miami..Are you coming to our next one in Chicago in April?",
    "bias": "None",
    "id": "2017413448536150243"
  },
  {
    "user": "@leadlagreport",
    "text": "Nearly 2 years ago.\n\nThis is the original long form video I made explaining Japan and the reverse carry trade.\n\nThe thesis that everyone who insulted me personally is now repeating.\n\nEarly? Wrong? I don't give a fuck.\n\nI will be proven right.\n\nWatch the video.\n\nRepost.\n\nFUCKED.",
    "bias": "None",
    "id": "2017685767242256712"
  },
  {
    "user": "@duderino210",
    "text": "The oil spike in 2008 was a highly deflationary phenomenon once we reached the fall.\n\nPepperidge Farm remembers.",
    "bias": "None",
    "id": "2017974137075949589"
  },
  {
    "user": "@beau1416",
    "text": "@leadlagreport is this why you said deflation ?",
    "bias": "None",
    "id": "2017976272610103458"
  },
  {
    "user": "@leadlagreport",
    "text": "$COMB: A Broad Commodity Strategy for a Policy-Driven World via @willrhind @graniteshares \nopen.substack.com/pub/granit…",
    "bias": "None",
    "id": "2017808855422374349"
  },
  {
    "user": "@most_real_psymd",
    "text": "I like and respect your takes, Michael, but there is not a case for a \"margin call\" here, factually. The leverage ratio for MSTR is less than 20% (8 billion debt and 50 billion assets) and they have 30 months of div coverage in cash.",
    "bias": "None",
    "id": "2017803036429586764"
  },
  {
    "user": "@futurist_101",
    "text": "😂😂😂 people are fucked!!",
    "bias": "None",
    "id": "2017799443756814528"
  },
  {
    "user": "@nickaic",
    "text": "I took the CFA. Saw a bunch of people crying in the hallway on the floor during the break studying frantically. Me and my buddy went out for burger and a beer instead because we knew there was NO WAY we were prepared for that exam. Few understand this.",
    "bias": "None",
    "id": "2017795646418227696"
  },
  {
    "user": "@leadlagreport",
    "text": "*CFA Charterholder.\n\nBut you wouldn’t know the difference.",
    "bias": "None",
    "id": "2017793266633040051"
  },
  {
    "user": "@leadlagreport",
    "text": "Is 2026 the Year Structural Market Regimes Replace Cyclical Trends? via @DynamicAlphaSol \nopen.substack.com/pub/dynami…",
    "bias": "None",
    "id": "2017780433463709838"
  },
  {
    "user": "@DynamicAlphaSol",
    "text": "AI spending can continue to grow, even as AI stock valuations compress.\n\nThat’s what happened with tech leaders after 2000: earnings grew, but multiples didn’t.\n\n#DynamicWealthGroup",
    "bias": "None",
    "id": "2017616869486665867"
  },
  {
    "user": "@DynamicAlphaSol",
    "text": "CapEx booms don’t always end when investment stops.\n\nMore often, stock prices peak years before spending does, as valuations adjust faster than real-world activity.\n\n#DynamicWealthGroup",
    "bias": "None",
    "id": "2017662167869223297"
  },
  {
    "user": "@leadlagreport",
    "text": "Don’t know you, but have seen you take personal shots at me for no reason. Best of luck Fred.",
    "bias": "None",
    "id": "2017778006379426116"
  },
  {
    "user": "@leadlagreport",
    "text": "WHERE IS THE XRP ARMY TODAY",
    "bias": "None",
    "id": "2017766443006206437"
  }
]