[
  {
    "user": "@StockSavvyShay",
    "text": "CYBERSECURITY VALUE CHAIN\n\n• $ZS zero-trust access\n• $CRWD endpoint protection\n• $FTNT network firewalls at scale\n• $RBRK data resilience & recovery\n• $NET network security at the edge\n• $OKTA identity & access management\n• $PANW unified network, cloud & SecOps security\n• $MSFT Azure-integrated security across identity, endpoint & cloud",
    "bias": "None",
    "id": "1994049625289056422"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$SPY is about to trigger the Zweig Breadth Thrust indicator which basically means the market goes from “no one is buying” to “everyone is buying” in a very short amount of time.\n\nIt almost never happens & when it does it usually marks the beginning of a real trend rather than a short bounce. Perfect example was the last time it triggered was near the April lows & that ended up being the start of a HUGE move higher.\n\nEvery single instance going back to the 1950s has led to higher S&P levels one year later.",
    "bias": "None",
    "id": "1994040819133956570"
  },
  {
    "user": "@StockSavvyShay",
    "text": "If the Thanksgiving conversation five years ago was that AI was about to change the world then these are the names that ended up proving it.\n\n• $NVDA +1,259%\n• $AVGO +907%\n• $PLTR +501%\n• $GOOGL +258%\n• $CRWD +233%\n• $TSM +194%\n• $NET +164%\n• $AMD +146%",
    "bias": "None",
    "id": "1994035014909272173"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL CEO basically just said quantum is entering the same acceleration curve AI hit five years ago.",
    "bias": "None",
    "id": "1994021385233178867"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PENTAGON SAYS $BABA SHOULD BE ON A LIST FOR CHINA MILITARY TIES",
    "bias": "None",
    "id": "1993744728958103574"
  },
  {
    "user": "@StockSavvyShay",
    "text": "BITCOIN $BTC JUST BROKE ABOVE $90K",
    "bias": "None",
    "id": "1993743662996705359"
  },
  {
    "user": "@StockSavvyShay",
    "text": "This is why the AI cycle is nothing like the dot-com era.\n\nEarly-2000s fiber ran at roughly 7% utilization because the industry built far ahead of demand that never showed up. The physical layer scaled faster than the software.\n\nToday is the inverse. $NVDA clusters inside $MSFT, $AMZN, $GOOGL and $META are running ~80% utilization because every model lab is capacity-constrained. The software layer is scaling far faster than the physical.\n\nOne cycle had excess supply and no demand. This one has excess demand and not nearly enough supply. That’s the entire difference.\n\n$NVDA",
    "bias": "None",
    "id": "1993720817608458303"
  },
  {
    "user": "@StockSavvyShay",
    "text": "I laugh when people call $AMZN overvalued.\n\nIt runs the most advanced logistics network in the world, owns the strongest point-of-purchase ad business in the consumer economy & AWS now generates more profit than the entire retail arm.\n\nAnd it still trades cheaper than $WMT & $COST.",
    "bias": "None",
    "id": "1993704576726466622"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Why is $ORCL down 30% in the past month? \n\nBecause Oracle is taking on the most aggressive capex plan in the industry & funding a data center buildout that is outsized relative to its revenue base.\n\nWhen you tie ~$500B of future obligations to one counterparty in OpenAI then the market starts assigning a Sam Altman risk premium.\n\nThe upside is very real if demand holds & if Oracle can deploy capacity faster than $AMZN, $MSFT or $GOOGL but the balance-sheet and concentration risks are just as real.\n\nI think the payoff will be enormous.",
    "bias": "None",
    "id": "1993685197855105436"
  },
  {
    "user": "@StockSavvyShay",
    "text": "This chart shows the real state of AI.\n\n• Capex is tracking toward $600B 2028 which means $AMZN, $MSFT, $GOOGL, $META & $ORCL are now building some of the largest industrial projects ever attempted.\n• The real constraint is shifting from GPU supply to power + land because every new model cycle adds another wave of megawatt demand.\n• This spending will not normalize since a multi-gigawatt footprint needs to be refreshed every 3-4 years.\n\nWhoever secures power and land & can stand up capacity the fastest will end up owning the AI economy of the next decade.",
    "bias": "None",
    "id": "1993677110406169086"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL is basically saying the long-term bottleneck for AI is power. \n\nIf TPUs can operate in space where solar is 8x stronger then power stops being the constraint & the cost curve for compute opens up in a meaningful way.",
    "bias": "None",
    "id": "1993664646767944126"
  },
  {
    "user": "@jonnajarian",
    "text": "Throwback pic with @petenajarian &  @KristenKuliga from the Super Bowl events in Los Angeles a couple years back!",
    "bias": "None",
    "id": "1993717726712561692"
  },
  {
    "user": "@jonnajarian",
    "text": "In Minnesota +$2B in losses across schemes includes $250M (Feeding Our Future) + $399M (autism surge) + $100M+ (HSS) + $550M (COVID) + smaller cases. Investigators warn the full scope could be higher, with remittances to Somalia totaling $1.7B, some to terror groups.",
    "bias": "None",
    "id": "1993695838288359916"
  },
  {
    "user": "@jonnajarian",
    "text": "Has Sen Slotkin followed illegal orders herself, such as those that were criticized by Amnesty International for civilian casualties & potential war crimes as well as over 13,000 munitions dropped by 2016, raising legality concerns under international humanitarian law? Hmmm?",
    "bias": "None",
    "id": "1993694287452676376"
  },
  {
    "user": "@jonnajarian",
    "text": "We sleep safely in our beds because of the sacrafices of brave soldiers & sailors. Only 337 men were rescued, 862 perished. Nov 25th, 1941.",
    "bias": "None",
    "id": "1993687219022839866"
  },
  {
    "user": "@jonnajarian",
    "text": "The ballance and speed are insane",
    "bias": "None",
    "id": "1993684366510206981"
  },
  {
    "user": "@jonnajarian",
    "text": "It's no surprise that ‘Captain’ Kelly can’t even display his uniform correctly. \"Your medals are out of order & rows reversed. When/if you are recalled to active duty, it’ll start with a uniform inspection.” @SecWar",
    "bias": "None",
    "id": "1993679027056636219"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Market Dashboard:\nnorthmantrader.com/2025/11/2…",
    "bias": "None",
    "id": "1993720820368286172"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Daily Market Brief:\nnorthmantrader.com/2025/11/2…",
    "bias": "None",
    "id": "1993633711103861217"
  },
  {
    "user": "@biancoresearch",
    "text": "Tagging a few other people, hoping they read this \n\n@DanProft @AldKnudsen43 @PaulVallas @John_Kass @GregHinz @wesbury @DianeSwonk @RahmEmanuel",
    "bias": "None",
    "id": "1994043614096445543"
  },
  {
    "user": "@biancoresearch",
    "text": "The Nov Chicago Business Barometer (formerly ISM) was released y'day. It collapsed.\n\nSomething similar happened in Dec 2024, and I suggested that it was not a signal of a national downturn, but was the Chicago-area Purchasing Manager \"sending a hostage note pleading for help.\"\n\nSame here, consider (all in the last month):\n\n* Property taxes assessments were mailed in November, and they soared as much as 100% in some neighborhoods.\n* Illinois now  has the highest property taxes in the country\n*  The Mayor wants to raise taxes on businesses.\n* The Governor wants to raise the state income tax\n* Several people are shot at a Christmas Tree lighting\n* An entire class of 10-year-olds beat up a pregnant mother and her physically challenged son.\n* A woman was doused with gasoline and set on fire on Public Transportation\n* Every Monday comes with the weekend tally of crime and carnage.\n* The Government and Mayor dismiss the violence as an \"isolated incident\" and refuse any help to get crime under control.\n\nFrankly, I'm surprised the purchasing managers are this optimistic.\n\n@marcuslemonis @GovPritzker @ChicagosMayor",
    "bias": "None",
    "id": "1994040282673811661"
  },
  {
    "user": "@biancoresearch",
    "text": "Looking forward to speaking with @cvpayne today on Making Money on the Fox Business Network",
    "bias": "None",
    "id": "1993722318192095341"
  },
  {
    "user": "@tonyruscitti101",
    "text": "Thanks, you too. Hedgeye takes a bit of time to learn, but your process can truly be life-changing. That's not an overstatement.  I have more confidence and control of my finances thanks to your process. It's nice to be able to avoid the potholes of Wall Street.",
    "bias": "None",
    "id": "1993816697330139394"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The Fam's Long Only Account ramped back to new all-time highs today \n\nWe have 24 Core ETF Asset Allocations and our biggest losers was down -0.27% on the day\n\nGold Miners, Silver, and Natty drove the perf #thankful",
    "bias": "None",
    "id": "1993815452544586163"
  },
  {
    "user": "@Hedgeye",
    "text": "🚨 MARK YOUR CALENDAR\n\nJoin us for a special Cyber Monday webcast on Monday, Dec. 1 at 11am ET with Hedgeye CEO @KeithMcCullough.\n\nKeith will break down his #Quad4 December playbook and the market setup heading into the final month of 2025.\n\nYou won't want to miss this.\n\nGet access here 👇\napp.hedgeye.com/insights/174…",
    "bias": "None",
    "id": "1993758403358081153"
  },
  {
    "user": "@ManowarDigital",
    "text": "“Work ethic and handshakes are important to me. I think they are to other people, too.”\n~Diary of a Hedge Fund Manager\n@KeithMcCullough",
    "bias": "None",
    "id": "1993797258538807331"
  },
  {
    "user": "@HedgeyeTV",
    "text": "Get your portfolio prepared ahead of the market open with @KeithMcCullough on THE MACRO SHOW\nLive @ 9:00am ET 11/26/2025\nSubscribers, check your email for access. Not a Subscriber yet? Access here👉 info.hedgeye.com/TMSNY",
    "bias": "None",
    "id": "1993677398429024704"
  },
  {
    "user": "@KeithMcCullough",
    "text": "\"Do the things external which fall upon thee distract thee?\"\n\nGive thyself time to learn something new and good, and cease to be whirled around\" \n-Marcus Aurelius",
    "bias": "None",
    "id": "1993656370600751421"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Among the hyperscalers with links to OpenAI, Oracle $ORCL has the highest concentration to the company, with OpenAI accounting for ~58% of its backlog, versus 39% for Microsoft $MSFT and 16% for Amazon $AMZN, per Jefferies.",
    "bias": "None",
    "id": "1993742729877033396"
  },
  {
    "user": "@Beth_Kindig",
    "text": "The Mag 7 combined account for almost 35% of the S&P 500, with Nvidia $NVDA, Apple $AAPL and Microsoft $MSFT alone accounting for more than one-fifth of the index with a combined weighting of 19.7%.",
    "bias": "None",
    "id": "1993695335475286023"
  },
  {
    "user": "@RedDogT3",
    "text": "This is a great listen. Especially on Thanksgiving!  \n\npiped.video/sFeprOWWjVU\n\nThe power of Gratitude \nHave a fantastic holiday",
    "bias": "None",
    "id": "1994031804211179806"
  },
  {
    "user": "@RedDogT3",
    "text": "Some asked for Wednesday’s pre-Thanksgiving recap and look ahead \n\npiped.video/live/7BP90Jxj9FA…",
    "bias": "None",
    "id": "1994030466593157428"
  },
  {
    "user": "@RedDogT3",
    "text": "If you missed the Red Dog Reversal in $QQQ and many tech names Friday, watch this:\n\nnitter.net/RedDogT3/status/189632…",
    "bias": "None",
    "id": "1993823834290655247"
  },
  {
    "user": "@RedDogT3",
    "text": "$spy midday glance as this Four day move was super impressive",
    "bias": "None",
    "id": "1993714680481849510"
  },
  {
    "user": "@RedDogT3",
    "text": "Crypto still lags. But I have a level $IBIT I’m long against / vs",
    "bias": "None",
    "id": "1993681056201937210"
  },
  {
    "user": "@RedDogT3",
    "text": "$tsla helped my week.",
    "bias": "None",
    "id": "1993673584905269745"
  },
  {
    "user": "@RedDogT3",
    "text": "$SPX reclaimed 6534 last Friday to start a Four Day Active Sequence, now above 6776 this morning. I’d trim and trail this is Day #4 to the upside with the oscillator back near +30 this morning.",
    "bias": "None",
    "id": "1993664932177731902"
  },
  {
    "user": "@leadlagreport",
    "text": "If you’re in your 40s and think you can’t build muscle, you need to work a lot harder than you think.\n\nShit ain’t easy, but every single day I get in the best shape of my life.",
    "bias": "None",
    "id": "1994070173024731447"
  },
  {
    "user": "@leadlagreport",
    "text": "Have gone as long as 9 days without food.",
    "bias": "None",
    "id": "1994056400427692293"
  },
  {
    "user": "@leadlagreport",
    "text": "Give thanks to those who are no longer with us today.\n\nThe memories will never die.",
    "bias": "None",
    "id": "1994045248734155246"
  },
  {
    "user": "@leadlagreport",
    "text": "People.",
    "bias": "None",
    "id": "1994031173404700826"
  },
  {
    "user": "@graniteshares",
    "text": "Happy Thanksgiving from GraniteShares!\n\nAs we enter the holiday weekend, we’d like to acknowledge everyone who has engaged with us this year, from investors and partners to our wider industry community. Your collaboration and support play an important role in what we do.\n\nWe wish you a great holiday break and a strong finish to the year ahead.\n\nInvesting involves risk, including the possible loss of principal. This communication is for informational purposes only and is not an offer or solicitation to buy or sell any financial product. For important risk disclosures, learn more at graniteshares.com/institutio…",
    "bias": "None",
    "id": "1994028437279760853"
  },
  {
    "user": "@leadlagreport",
    "text": "Might start a new podcast focused on physical fitness, mental health, and markets.",
    "bias": "None",
    "id": "1994010800046878862"
  },
  {
    "user": "@StephenPunwasi",
    "text": "🔥🔥🔥 \n\nBIS GM presents tomorrow on global financial risks from pandemic-era government debt converging with persistent fiscal deficits.\n\nCan’t share the data yet, but I can share a relevant Bank of Canada staff chart.\n\nIn the words of the great @leadlagreport—you’re f*cked.",
    "bias": "None",
    "id": "1993899070050718164"
  },
  {
    "user": "@leadlagreport",
    "text": "Biotech Breaks Away: Risk-On Rally Underpins Sector Outperformance, by @leadlagreport open.substack.com/pub/leadla…",
    "bias": "None",
    "id": "1993845590669840543"
  },
  {
    "user": "@leadlagreport",
    "text": "How Deregulation Could Accelerate U.S. Infrastructure open.substack.com/pub/freema…",
    "bias": "None",
    "id": "1993834169684595091"
  },
  {
    "user": "@leadlagreport",
    "text": "If I can do it, so can you. 💯 I changed my life, and a daily fish oil habit was one of my tools. It's not flashy, but it works. Here's to health, strength, and longevity! Never stop improving, and don't underestimate the small things that keep you moving forward. 🙌 (10/10)",
    "bias": "None",
    "id": "1993829261363564878"
  }
]