[
  {
    "user": "@LizAnnSonders",
    "text": "Joining @SchwabNetwork for #MorningTradeLive around 9:15am ET this morning",
    "bias": "None",
    "id": "1961034135465595150"
  },
  {
    "user": "@LizAnnSonders",
    "text": "My chart mavens, including @KevRGordon, are taking some much-needed time off, so I decided to take a two-day break (not from work; just from this platform) … have a great long weekend everyone … I’ll be back here on Tuesday",
    "bias": "Herd / Bandwagon",
    "id": "1960802483040870877"
  },
  {
    "user": "@LizAnnSonders",
    "text": "This is a fantastic new app/site created by my friend and former Schwab colleague Theran Lee … lots of incredible stats and visuals essentially about how our government works re: the spending and revenue side … chock full of helpful visuals that are super easy to understand … all created in a non-partisan way and with verifiable facts and data",
    "bias": "None",
    "id": "1960786418713944228"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Looking forward to joining @YahooFinance this morning around 9:15am ET",
    "bias": "None",
    "id": "1960675668380782908"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Performance: sectors/indexes yesterday and MTD/YTD",
    "bias": "Recency Bias",
    "id": "1960671978488058089"
  },
  {
    "user": "@KevRGordon",
    "text": "2y inflation swap at its highest since November 2022",
    "bias": "Euphoria / Greed",
    "id": "1960671753065111855"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Performance: index tables and Mag7 chart/table updated thru yesterday’s close",
    "bias": "Recency Bias",
    "id": "1960671708668706913"
  },
  {
    "user": "@LizAnnSonders",
    "text": "MA breadth charts updated thru yesterday’s close",
    "bias": "Recency Bias",
    "id": "1960671540917199158"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Labor Differential metric from ⁦@Conferenceboard⁩ (blue) continued to deteriorate in August, suggesting upward pressure on unemployment rate (orange)",
    "bias": "None",
    "id": "1960669559653883992"
  },
  {
    "user": "@LizAnnSonders",
    "text": "12m inflation expectations spiked in August to 6.2% per ⁦@Conferenceboard⁩ Consumer Confidence Index",
    "bias": "None",
    "id": "1960669288903172498"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Services Index from ⁦@DallasFed⁩ improved in August to +6.8, but there was some softness in capex component (orange)",
    "bias": "Confirmation Bias",
    "id": "1960668808865099937"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Skills gap in manufacturing sector (blue) got noticeably worse in August per ⁦@RichmondFed⁩ … opposite case for services (orange)",
    "bias": "None",
    "id": "1960668690002636882"
  },
  {
    "user": "@LizAnnSonders",
    "text": "House Price Index from ⁦@FHFA⁩ contracted for a third consecutive month in June (hasn’t happened since 2011)",
    "bias": "None",
    "id": "1960668563603153272"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Year/year trends for core cap goods orders (blue) and shipments (orange) remained firm in July … uptrends still in place over past year",
    "bias": "FOMO",
    "id": "1960668354559271073"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Consumers’ expectations for worse business conditions (orange) have fallen sharply over past few months per ⁦@Conferenceboard⁩ … expectations for better conditions (blue) haven’t improved as dramatically",
    "bias": "Confirmation Bias",
    "id": "1960668229983986035"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Durable goods orders (blue) growth slipped to +3.52% year/year in July … core orders (orange) growth moved up to +3.82%",
    "bias": "None",
    "id": "1960668100564582698"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Both employment components in ⁦@philadelphiafed⁩ Services Index fell back into contraction in August",
    "bias": "None",
    "id": "1960667903008629081"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Prices paid component of ⁦@philadelphiafed⁩ Services Index spiked in August and is getting closer to a cycle high again",
    "bias": "Euphoria / Greed",
    "id": "1960667510912545099"
  },
  {
    "user": "@elerianm",
    "text": "From @johnauthers' note, and further to the post from earlier this morning.\n\n#economy #markets @nvidia #nvidia",
    "bias": "None",
    "id": "1961081397059195251"
  },
  {
    "user": "@elerianm",
    "text": "Thank you, @BeckyCNN, for the interesting conversation.\n\n#economy #markets @CNN @cnni #FederalReserve",
    "bias": "None",
    "id": "1961070754029551861"
  },
  {
    "user": "@elerianm",
    "text": "So why are investors in corporate bonds undeterred despite the significant tightening in risk spreads (chart below)?\nThe answer lies in their operational focus on the overall yield—the combined return from the risk spread and the \"safe asset\" component.\nRelative to recent history, this overall yield remains attractive to them, outweighing the signal that tight spreads might otherwise send.\n#economy #investing #investors #markets #bonds",
    "bias": "Recency Bias",
    "id": "1961068050087547385"
  },
  {
    "user": "@elerianm",
    "text": "Further to the prior post, the hypothesis of a resilient US economy just got support from the revised estimate of Q2 GDP for the US.\nThis was increased from 3% to 3.3%, surpassing the consensus forecast of 3.1%. \nThe data beat was driven by a strengthening in exports and gross domestic investment. #economy #growth #marketFu",
    "bias": "Loss Aversion",
    "id": "1961051764892774681"
  },
  {
    "user": "@elerianm",
    "text": "Some insights on the US economy from the latest round of corporate earnings:\nRetailers: Consumer demand remains resilient, including for companies serving lower-income households. While tariffs have increased costs, companies have only partially passed these costs on to consumers. This pass-through is notably uneven across different companies, sectors, and products.\nNvidia: The bedrock of the AI boom remains solid. Both supply and demand for critical AI inputs are robust, and adoption is spreading. The impact on economy-wide variables, particularly productivity, will depend on significantly extending this diffusion in an efficient and scalable manner. (History suggests that the pattern of widespread adoption for general-purpose technologies like AI can vary considerably in terms of speed and evenness.)\n#economy #markets #retailers #nvidia @nvidia #growth #Inflation",
    "bias": "Recency Bias",
    "id": "1961044031229624659"
  },
  {
    "user": "@elerianm",
    "text": "Wonderful night at Citi Field as my beloved Mets completed the sweep of the Phillies, and I got to meet Mr. Met!\n\n #LGM #MrMet #Sweep @Mets @Phillies @MLB @CitiField",
    "bias": "None",
    "id": "1960882429037830461"
  },
  {
    "user": "@elerianm",
    "text": "The link to this morning's conversation with @carlquintanilla  and @contessabrewer:\n\ncnbc.com/video/2025/08/27/al…\n\n#economy #markets #federalreserve #inflation @CNBC",
    "bias": "None",
    "id": "1960772590676636153"
  },
  {
    "user": "@elerianm",
    "text": "Further to earlier posts, the US yield curve is extending its steepening trend, with the 2s–30s closing in on 130 basis points.\n\n#economy #markets",
    "bias": "Herd / Bandwagon",
    "id": "1960765825721221236"
  },
  {
    "user": "@elerianm",
    "text": "Many thanks to Carl and Contessa for the interesting conversation on CNBC.\n\n#economy #FederalReserve #markets @carlquintanilla @contessabrewer",
    "bias": "None",
    "id": "1960732531495477459"
  },
  {
    "user": "@elerianm",
    "text": "Add this to the list of developments once thought highly unlikely just a few years ago:\nAs the chart below shows, the spread between French and Italian government bonds has narrowed sharply, to just 5 basis points — this as markets focus increasingly on France’s politically driven deficit and debt challenges.\n#economy #markets #bonds #italy #france",
    "bias": "Euphoria / Greed",
    "id": "1960708403359060042"
  },
  {
    "user": "@elerianm",
    "text": "Good morning.\n\nFYI, two bond market/interest rate charts from @johnauthers' daily note. \n\n#economy #markets",
    "bias": "None",
    "id": "1960663841865437215"
  },
  {
    "user": "@morganhousel",
    "text": "Interesting point on why college students are putting less effort into class: courses don't prepare them for real jobs (like they should), so they have to spend more and more time making up the difference after class: \n\ntheatlantic.com/ideas/archiv…",
    "bias": "None",
    "id": "1961089967670853971"
  },
  {
    "user": "@RayDalio",
    "text": "For example, if you come up with something the world values, you almost can't help but be rewarded. Conversely, reality tends to penalize those people, species, and things that don't work well and detract from evolution. #principleoftheday",
    "bias": "Contrarian",
    "id": "1961054854769455389"
  },
  {
    "user": "@RayDalio",
    "text": "When considering an issue or situation, there should be two levels of discussion: the case at hand and the relevant principles that help you decide how the machine should work. You need to clearly navigate between these levels in order to handle the case well, test the effectiveness of your principles, and improve the machine so similar cases will be handled better in the future. #principleoftheday",
    "bias": "None",
    "id": "1960788039073935754"
  },
  {
    "user": "@RayDalio",
    "text": "I'm looking forward to the AMA I’ll be doing on Reddit (r/IAmA) on September 4th from 1-3PM ET.\n\nFor over 50 years, I’ve been in the business of studying the cause/effect relationships that drive how reality works and developing principles for dealing with reality well. I then programmed these principles into computers as decision rules to bet on them working.  Because the causes come before the effects, this principles-based approach worked amazingly well for me.\n\nSince I’m 76, I’m now at a stage in my life that I want to pass along what’s of value. So far, I’ve passed along my perspectives and principles about how to approach life, work, the changing world order, debt, and markets in my books, videos, and social media.  But I think that what is most important is that you have your own good principles and perspectives that suit you, and I believe in thoughtful disagreement to find out what’s best, so I love to have exchanges about how the world works with you and others.\n\nIf you want to ask me anything, you don’t have to wait for the AMA to begin. We’re going to collect questions from my social media pages so I can answer as many as possible when the time comes.\n\nSo please ask your questions in the comments below.",
    "bias": "Herd / Bandwagon",
    "id": "1960721663999332352"
  },
  {
    "user": "@barronsonline",
    "text": "Federal Reserve governor Lisa Cook sued to block President Donald Trump’s recent move to dismiss her, setting up a potentially precedent-setting legal showdown between the White House and the central bank.",
    "bias": "Recency Bias",
    "id": "1961088922060014072"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Earnings Disappointed. GE Vernova and 5 More Industrial Stocks Get a Boost. trib.al/Qn6t68y",
    "bias": "None",
    "id": "1961087798015897979"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Is Riding the AI Revolution. What the Chip Maker Isn’t Telling Us. trib.al/AxCPMbf",
    "bias": "None",
    "id": "1961076464251510848"
  },
  {
    "user": "@barronsonline",
    "text": "Boeing CEO Has Revived the Stock in His First Year. There’s More Work to Do. trib.al/kcMWtdX",
    "bias": "None",
    "id": "1961075355839606955"
  },
  {
    "user": "@barronsonline",
    "text": "This Struggling Food Stock Is Today’s Worst in S&P 500. Why It’s Raising Prices. trib.al/oGdaedm",
    "bias": "None",
    "id": "1961070815950024899"
  },
  {
    "user": "@barronsonline",
    "text": "Pure Storage Stock Rallies 24%. A Meta Deal Has Something to Do With It, Say Analysts. trib.al/uX3qwRg",
    "bias": "None",
    "id": "1961068560148467774"
  },
  {
    "user": "@barronsonline",
    "text": "Fed Gov. Cook Launches Legal Challenge Against Trump’s Firing trib.al/rUigwSo",
    "bias": "None",
    "id": "1961060633496973710"
  },
  {
    "user": "@barronsonline",
    "text": "Burlington Stores Stock Surges on Earnings, Guidance. Off-Price Retailers Are Thriving. trib.al/yPW4TmD",
    "bias": "None",
    "id": "1961042491525706158"
  },
  {
    "user": "@barronsonline",
    "text": "CrowdStrike Stock Falls After Disappointing Guidance. But This Is a Possible Upside. trib.al/C5MWBfa",
    "bias": "Herd / Bandwagon",
    "id": "1961039101315961248"
  },
  {
    "user": "@barronsonline",
    "text": "Why Warren Buffett’s Berkshire Hathaway Still Likes Japan trib.al/jKy4EDL",
    "bias": "FOMO",
    "id": "1961035696426082415"
  },
  {
    "user": "@barronsonline",
    "text": "This Chip Stock Is Soaring Amid Nvidia’s China Problems. The AI War Has Taken a Turn. trib.al/1juJNzG",
    "bias": "None",
    "id": "1961034582469263843"
  },
  {
    "user": "@barronsonline",
    "text": "Trump Administration’s Firing Spree Continues. CDC Director Refuses to Leave, Like Fed’s Lisa Cook. trib.al/FuEeddX",
    "bias": "None",
    "id": "1961033442533003516"
  },
  {
    "user": "@barronsonline",
    "text": "Dick’s Sporting Goods Stock Slips on Earnings Ahead of Foot Locker Acquisition trib.al/d1FiKy9",
    "bias": "None",
    "id": "1961032310930686422"
  },
  {
    "user": "@barronsonline",
    "text": "Best Buy Stock Falls After Earnings Beat. Why Wall Street’s Disappointed. trib.al/yA6fJN3",
    "bias": "None",
    "id": "1961028924588150827"
  },
  {
    "user": "@barronsonline",
    "text": "Dollar General Stock Rises on Earnings Beat. Why It’s Raising Guidance. trib.al/Xq3KhfJ",
    "bias": "None",
    "id": "1961025505173401872"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Points to a China Crisis. That’s a Big Problem for Stock Markets, the Economy. trib.al/JpTV9dx",
    "bias": "None",
    "id": "1961013046794428912"
  },
  {
    "user": "@barronsonline",
    "text": "Broadcom, AMD, Micron Other Chip Stocks Fell After Nvidia Earnings. What They’re Doing Now. trib.al/DacCD09",
    "bias": "None",
    "id": "1961009654110069164"
  },
  {
    "user": "@barronsonline",
    "text": "These Stocks Are Moving the Most Today: Nvidia, CrowdStrike, Snowflake, Cooper, HP, and More trib.al/OAABzyf",
    "bias": "Herd / Bandwagon",
    "id": "1960993787338956976"
  },
  {
    "user": "@barronsonline",
    "text": "Li Auto Stock Dives. How China’s EV Price War Dented Earnings. trib.al/teQHakW",
    "bias": "None",
    "id": "1960992683087802604"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Stock Drops After Earnings. 3 Reasons Not to Panic About the AI Trade. trib.al/kc8ECja",
    "bias": "Panic / Capitulation",
    "id": "1960991579897733374"
  },
  {
    "user": "@matt_levine",
    "text": "Money Stuff has what we believe to be the largest digital newsletter to market cap ratio in history. bloomberg.com/opinion/newsle…",
    "bias": "Herd / Bandwagon",
    "id": "1960756780381896744"
  },
  {
    "user": "@saxena_puru",
    "text": "AI data centre CapEx is booming but it’s cyclical - growth will eventually slow post buildout. \n\nMeanwhile, AI agents are just starting and inference workloads will drive compounding recurring revenue. \n\nThe opportunity is also in software, not just in chips.",
    "bias": "None",
    "id": "1961076151574470851"
  },
  {
    "user": "@saxena_puru",
    "text": "Market realising AI isn't going to kill all software firms. \n\nAI agents deployed by infrastructure software vendors will likely accelerate growth and improve margins.",
    "bias": "None",
    "id": "1961074087897280748"
  },
  {
    "user": "@DamiaOthman",
    "text": "$NVDA data centre revenue rose to US$41.1 billion (+56% YoY, +5% QoQ) in Q2 FY 2026, but came in below consensus estimates.\n\nBlackwell Data Centre revenue grew 17% QoQ.\n\nGroup revenue grew to US$46.7 million (+56% YoY, +6% QoQ).",
    "bias": "None",
    "id": "1961035786499072425"
  },
  {
    "user": "@saxena_puru",
    "text": "AI was supposed to eat software companies. Instead, consumption-based infrastructure software vendors are seeing accelerating revenue growth. \n\nAI is becoming a tailwind (not an existential threat) for quality software firms.",
    "bias": "Contrarian",
    "id": "1960865579209822618"
  },
  {
    "user": "@saxena_puru",
    "text": "Data shows that for decades, a handful of secular compounders have driven most of the indices’ returns. Surprisingly, the majority of companies actually lag the index.\n\nThat’s why we run a concentrated portfolio of disruptive, high growth businesses and monitor them closely.",
    "bias": "Euphoria / Greed",
    "id": "1960726230971416873"
  },
  {
    "user": "@BjerkeOy",
    "text": "Hyperscalers’ Spending Boom\nWe are still early in the AI CAPEX cycle, with spend forecast to double from 2024 to 2027.\nThis wave will support AI model training and the surging demand for inference compute, which is set to take a larger share of capacity.",
    "bias": "Herd / Bandwagon",
    "id": "1960690401376948473"
  },
  {
    "user": "@elonmusk",
    "text": "Explaining Starship",
    "bias": "None",
    "id": "1960704268186607631"
  },
  {
    "user": "@SpaceX",
    "text": "This is the 30th flight for the Falcon 9 booster supporting today’s @Starlink mission, now launching the most missions of the Falcon fleet",
    "bias": "Loss Aversion",
    "id": "1960979520804282691"
  },
  {
    "user": "@CilComLFC",
    "text": "🚨BREAKING: Conor McGregor has announced that he has SECURED the required number of Parliamentary Votes to CONFIRM his candidacy for President of Ireland. \n\nHe added that “those who align in support of the policies I have presented will be the saviours of our Great Nation.”\n\n🔥🔥",
    "bias": "Loss Aversion",
    "id": "1960825617366311397"
  },
  {
    "user": "@iamyesyouareno",
    "text": "Sexual offences in London by nationality.\n\nBritish people are in 39th place.",
    "bias": "None",
    "id": "1961024898555347006"
  },
  {
    "user": "@ambermarieduke",
    "text": "If you look at WaPo's school shooting database and remove accidental discharges, gang violence, police shootings, etc., there have been four mass school shootings since 2023. Two of the perpetrators were transgender. 50%.",
    "bias": "None",
    "id": "1960793972777083191"
  },
  {
    "user": "@elonmusk",
    "text": "Exactly correct. \n\nA similar tragedy unfolded in the US back when anyone with a child was allowed entry in the spirit of being humanitarian. \n\nThis unfortunately backfired, resulting in massive child-trafficking, physical abuse and rape, as evil criminals would snatch kids to use as a “get-into-America” free pass.",
    "bias": "None",
    "id": "1961022410297364953"
  },
  {
    "user": "@BasedMikeLee",
    "text": "When oppressed by tyrants, armed citizens awaken\n\nOnly tyrants disarm the law-abiding\n\nShare if you agree",
    "bias": "None",
    "id": "1960896925961740560"
  },
  {
    "user": "@elonmusk",
    "text": "Great progress by the Starlink team!",
    "bias": "None",
    "id": "1961011607267610880"
  },
  {
    "user": "@elonmusk",
    "text": "This slide needs an update, but gives a rough idea of what we’re aiming for with V3 and V4.\n\nV3 should be built & tested (maybe flown) by end of this year. \n\nV4 is 2027. Probably closer to 150m height and 7500 tons.",
    "bias": "None",
    "id": "1960812698037518540"
  },
  {
    "user": "@elonmusk",
    "text": "It’s a good model, sir",
    "bias": "None",
    "id": "1960807337285050436"
  },
  {
    "user": "@elonmusk",
    "text": "There is a clear pattern here",
    "bias": "None",
    "id": "1960806599217570083"
  },
  {
    "user": "@luismbat",
    "text": "People forget: until 1980, schools didn’t even teach that an asteroid killed the dinosaurs - the theory wasn't put forward.\n\nNow we’re planning Mars colonies to make sure we’re not next. \n\nThe pace of progress is wild.",
    "bias": "None",
    "id": "1960733854786052583"
  },
  {
    "user": "@SamAntar",
    "text": "BREAKING: We exposed how George Soros converts tax-deductible donations into political campaigns through a $34 million pipeline where Tides and Working Families Party coordinate to support candidates like Zohran Mamdani\n\nOur investigation uncovered a $2+ billion tax-exempt network that systematically converted charitable donations into political power. The numbers tell the story.\n\nFULL INVESTIGATION: [link]: ➡️whitecollarfraud.com/2025/08…\n\nTHE BASIC SCHEME: George Soros donates to his Foundation to Promote Open Society (501c3) - tax deductible → $8.4M flows to Tides Foundation (501c3) → $29.3M flows to Tides Advocacy (501c4) for \"political advocacy\" → Coordinates with Working Families Organization supporting candidates like Mamdani\n\nTHE SMOKING GUN - REVERSE FLOWS: After receiving $9.71M from the Soros pipeline, Working Families Organization sent $325,000 BACK to Tides entities. Independent charities don't do this. It's mathematical proof of coordination. \n\nSYSTEMATIC CONCEALMENT: Tides Advocacy (501c4) lists Janiece Evans-Page as Director, while she simultaneously serves as CEO of both Tides Foundation (501c3) and Tides Center (501c3), yet Tides Advocacy filed NO disclosure forms for 5+ years while receiving $29.3M. \n\nTHE EIN SCANDALS: \n➡️Working Families Organization reported $80,000 to \"WFP National PAC\" but used an EIN that actually belongs to \"International Earthlight Alliance.\"\n➡️Tides Center reported a $343,753 contribution to \"Tides Advocacy\" using an EIN that belongs to \"Think Outside Da Block Inc.\n\nPROFESSIONAL AUDITOR CONFIRMATION: Deloitte auditors confirmed operational integration between Tides Foundation and Tides Center, requiring consolidated financial statements. Yet Tides Advocacy - sharing the same leadership - systematically concealed these relationships. 6/\n\nTHE SCALE:\n➡️$34.4M in documented flows between supposedly independent entities\n➡️$16.1M in government grants flowing to organizations with political arms\n➡️$36.5M in admitted \"political transfers\" by Open Society Institute\n➡️Over $2B in total network operations\n\nOUR EVIDENCE: Every dollar amount traced to original IRS Form 990 filings. We've filed a Fifth Supplemental IRS whistleblower complaint documenting potential $500M+ in tax recovery from this coordination system.\n\nTHE MAMDANI CONNECTION: This network manufactured his \"grassroots\" campaign while maintaining the illusion of independent charitable work. The infrastructure that created his political rise operates continuously, creating candidates nationwide. \n\nWHY IT MATTERS: If charitable tax deductions can be systematically converted into political coordination through concealed control structures, it undermines the entire tax-exempt system. Donors get tax breaks, candidates get \"grassroots\" cover, taxpayers subsidize political operations.\n\nThe mathematics don't lie. When organizations engage in $34M+ flows while concealing key relationships and sending money backward through the system, these patterns warrant investigation.",
    "bias": "FOMO",
    "id": "1960765867907576111"
  },
  {
    "user": "@SciGuySpace",
    "text": "Incredibly, SpaceX just landed its 400th rocket on a drone ship. This has all happened in less than a decade since the first one, CRS-8, back in April 2016.",
    "bias": "Euphoria / Greed",
    "id": "1960663664312086703"
  },
  {
    "user": "@elonmusk",
    "text": "Starship will also launch from Florida!",
    "bias": "None",
    "id": "1960717530680684638"
  },
  {
    "user": "@SciGuySpace",
    "text": "Before Starship, no orbital rocket stage had ever made a soft, vertical landing back on Earth.",
    "bias": "Euphoria / Greed",
    "id": "1960501836739436779"
  },
  {
    "user": "@elonmusk",
    "text": "",
    "bias": "None",
    "id": "1960712894019985678"
  },
  {
    "user": "@pmarca",
    "text": "❤️",
    "bias": "None",
    "id": "1960778900575019427"
  },
  {
    "user": "@kennardmatt",
    "text": "An undercover Al Jazeera reporter recorded an official from Israeli embassy in London promising £1 million to Labour Friends of Israel\n\nWalthamstow MP @stellacreasy is a “parliamentary supporter” of this front group \n\nWalthamstow deserves much better👇",
    "bias": "Loss Aversion",
    "id": "1960637036999631305"
  },
  {
    "user": "@gazanotice",
    "text": "🚨HORRIBLE: Explosive robots: Israel’s new method to wipe out Gaza neighborhoods\n\nIsrael is using ‘explosive robots’ in Gaza ,armored vehicles (often outdated M113s) packed with 3–5 tons of explosives and remotely driven into residential areas before being detonated. \n\nThe blasts can level 100–300m², wiping out entire neighborhoods. Over 500 homes in Al-Zaytoun alone were destroyed this way since August 2025.",
    "bias": "None",
    "id": "1960649175281848738"
  },
  {
    "user": "@ycombinator",
    "text": "YC President & CEO @garrytan recently joined @jesslivingston and Carolynn Levy on the Social Radars podcast to talk about the Founder Mode retreat we organized for YC alumni.\n\nHe shared why founder mode matters, and how the concept is evolving in the age of AI.",
    "bias": "Herd / Bandwagon",
    "id": "1960785324571009315"
  },
  {
    "user": "@paulg",
    "text": "\"Every time she hears a rocket she starts trembling and crying. I used to tell her: 'Don’t worry. They’re not targeting us.' It’s a myth that all of us in Gaza tell our children. But it doesn't work anymore; she knows that it's a lie.\"",
    "bias": "Euphoria / Greed",
    "id": "1960797991662432537"
  },
  {
    "user": "@paulg",
    "text": "Are they really this clueless about how rocket development works, or do they hate SpaceX because of Elon? As so often happens, it's hard to distinguish incompetence from politics.",
    "bias": "Euphoria / Greed",
    "id": "1960749876683399658"
  },
  {
    "user": "@paulg",
    "text": "Russell's History of Western Philosophy reads like it was written for himself, which on the whole is a good thing.",
    "bias": "None",
    "id": "1960714153695310090"
  },
  {
    "user": "@Noahpinion",
    "text": "Poor countries are using solar because it's cheaper than coal or gas",
    "bias": "None",
    "id": "1960508011153383793"
  },
  {
    "user": "@jessegenet",
    "text": "3yo and 4yo asked to take photos with my phone during an active instacart order\n\nThen I received a phone call from the shopper about the ‘crazy amount of ice cream’ in my order…\n\nMOST, not all, of the ice cream was able to be canceled 🤣",
    "bias": "None",
    "id": "1960504836576960929"
  },
  {
    "user": "@peterhansVC",
    "text": "It was great speaking with @laurashin on one of my favorite podcasts @Unchained_pod - I got started in crypto by mining ETH almost 10 yrs ago, and it's latest move is a great example of narrative power and the economic influence of tradfi",
    "bias": "Recency Bias",
    "id": "1961084246367289786"
  },
  {
    "user": "@laurashin",
    "text": "ETH was ‘a dinosaur’ just months ago 🦕\n\nNow TradFi calls it the settlement layer of the internet.\n\nHack VC’s Peter Hans (@peterhansVC)  on how ETH’s narrative flipped overnight 🔄",
    "bias": "None",
    "id": "1961036224551899179"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n• 💥 XPL short squeeze nets $48M on Hyperliquid\n• ⚡ Tron’s fee-cut proposal races toward approval\n• 🏛️ Aave pushes into RWAs with Horizon platform\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Herd / Bandwagon",
    "id": "1961021020292129245"
  },
  {
    "user": "@__f_i_n_k__",
    "text": "I always thought @CoinbaseDuck was the most bullish person on $COIN 🟦...@LukeYoungblood just said, hold my beer 😂",
    "bias": "Euphoria / Greed",
    "id": "1960844142201987582"
  },
  {
    "user": "@ethentree",
    "text": "WOW! Someone should build this and slap a good name on it\n\nLike the best name you could come up with for P2P payments\n\nTHE WHOLE WORLD WILL /SEND",
    "bias": "None",
    "id": "1960776602599743773"
  },
  {
    "user": "@laurashin",
    "text": "ETH had its turn. Is SOL next? 🚀\n\n@jon_charb says TradFi is speedrunning crypto narratives — and SOL is the next obvious candidate if flows keep coming",
    "bias": "None",
    "id": "1960770862287630520"
  },
  {
    "user": "@laurashin",
    "text": "Unchained LIVE: Dapps on Base nitter.net/i/broadcasts/1MnGnPBlD…",
    "bias": "Contrarian",
    "id": "1960733850432364986"
  },
  {
    "user": "@laurashin",
    "text": "I'm happy that this tweet engendered a number of responses from real humans rather than mostly bots 😂",
    "bias": "FOMO",
    "id": "1960730435584974882"
  },
  {
    "user": "@laurashin",
    "text": "I'm going live in 30 minutes at 12 ET / 9 PT to chat with @wagmiAlexander and @LukeYoungblood! Tune in here on X or YouTube!",
    "bias": "None",
    "id": "1960726060707742077"
  },
  {
    "user": "@laurashin",
    "text": "Random thought: maybe it should be Coinbase that develops a crypto phone?? Wdyt",
    "bias": "None",
    "id": "1960720476960911423"
  },
  {
    "user": "@laurashin",
    "text": "Also available on YouTube!\npiped.video/Vzu9FlqvNik",
    "bias": "None",
    "id": "1960704904885862595"
  },
  {
    "user": "@laurashin",
    "text": "Two VCs on Why the 4-Year Cycle Is Dead, DATs & Hyperliquid vs. Binance\n\nOn @unchained_pod, Hack VC’s @peterhansVC & DBA’s @jon_charb debate:\n\n💸 How long the DATs trend will last\n🔥 Why ETH’s narrative flipped overnight, and why SOL looks great\n⚡ How Hyperliquid could outcompete Binance\n🤔 The rise of stablechains: do we even need them?\n\nTimestamps:\n🎬 0:00 Intro\n🎯 2:44 Whether the DAT trend is peaking or just getting started\n🧾 10:57 Whether $SOL DATs include locked funds from the FTX estate\n🙅‍♂️ 11:52 Why Jon hasn’t touched any of these products\n📈 16:28 Why Peter still sees long-term value in these vehicles\n🔥 20:24 Why $ETH is suddenly hot in TradFi and how SOL could follow\n🏦 28:49 What makes a stablecoin-specific chain attractive\n😶‍🌫️ 32:42 How crypto overlooked privacy for far too long\n🔗 38:48 What it’ll take for stablecoin chains to win the payments game\n⚠️ 45:39 Whether stablechains could hurt Ethereum, Tron, or Solana\n🔍 47:46 Which stablechain has the best shot at success\n💸 52:07 Why @HyperliquidX beat Robinhood in trading volume\n🧨 56:00 How Hyperliquid could break Binance’s listing chokehold\n🕵️‍♂️ 59:23 What makes anonymous, no-KYC products appealing\n📉 1:01:30 Whether the 4-year crypto cycle is officially dead",
    "bias": "Herd / Bandwagon",
    "id": "1960692372305592701"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n   🇺🇸 GDP data is going onchain under Commerce Department\n   💸 Trump Media + Crypto.com build massive CRO war chest\n   🧑‍💼 Trump Jr. joins Polymarket as platform eyes US comeback\n  📲 MetaMask says goodbye to seed phrase\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "None",
    "id": "1960660630437810203"
  },
  {
    "user": "@CryptoWendyO",
    "text": "JP Morgan was a Bitcoin enemy \n\nNow they are saying its undervalued \n\nThere is a lesson here and most of you know",
    "bias": "Contrarian",
    "id": "1961092170221572429"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I'm proud of you.",
    "bias": "None",
    "id": "1961084719698788697"
  },
  {
    "user": "@CryptoWendyO",
    "text": "CHAINLINK is the ticker of the day for fundamental reasons.",
    "bias": "None",
    "id": "1961068330485506206"
  },
  {
    "user": "@CryptoWendyO",
    "text": "The White House, the SEC and the CFTC are not only pro Crypto, but they’re excited for fair regulatory guidelines.\n\nAll we need is a heavily revised accredited investor act that allows competent Americans from all wealth backgrounds to participate .",
    "bias": "None",
    "id": "1961054465361846752"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto things you might have missed:\n\n-XRP futures hit insane milestone☑️\n-Standard Chartered calls ETH 'cheap' at current levels\n-Binance stablecoin inflows are surging\n-Aave builds RWA platform for institutions\n-BTC-backed loans done right with @hodlwithLedn\n\nLINK IN BIO",
    "bias": "Loss Aversion",
    "id": "1960746394635132969"
  },
  {
    "user": "@CryptoWendyO",
    "text": "No one really fits in during the awkward high school or jr high years \n\nThat’s ok but in most cases you shouldn’t use it as an excuse for your bad behavior and lack of accountability.",
    "bias": "Euphoria / Greed",
    "id": "1960859509179707634"
  },
  {
    "user": "@CryptoWendyO",
    "text": "DID YOU STAY HYDRATED TODAY?\n\nCATCH THE REPLAY DOWN THERE\n\npiped.video/live/uFGXyBdFVC8…",
    "bias": "None",
    "id": "1960838741167141328"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I have tired to tell you all… \n\nRetail loves XRP \n\nIt is the easiest trade/investment this cycle and possibly beyond",
    "bias": "None",
    "id": "1960831319577124868"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Aave Launches Platform For Institutional Borrowing Of Ripple’s RLUSD Using Chainlink Tech\n\nAave Labs has launched Horizon, a new platform for institutional investors to borrow stablecoins like USDC, GHO, and RLUSD, using tokenized RWAs like U.S. Treasuries as collateral.\n\nBuilt on Aave V3, the platform supports assets from Superstate, Circle, and Centrifuge, with more issuers including VanEck and WisdomTree to follow.\n\nHorizon uses Chainlink’s NAVLink to provide real-time net asset values on-chain, ensuring proper collateralization.\n\nThe platform blends compliance-checked collateral with open lending pools, aiming to unlock liquidity in the growing $26B+ RWA market.\n\nSource: Coindesk",
    "bias": "Loss Aversion",
    "id": "1960802003954590174"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Nvidia $NVDA reports $46.7 BILLION in revenue\n\nCan we send all AI cryptos?",
    "bias": "None",
    "id": "1960801252650242070"
  },
  {
    "user": "@CryptoWendyO",
    "text": "RIPPLE CRYPTO BITCOIN \n\nHIGHER",
    "bias": "Euphoria / Greed",
    "id": "1960788715233763640"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Spend less time online and more time with your kids.",
    "bias": "None",
    "id": "1960780951791001633"
  },
  {
    "user": "@CryptoWendyO",
    "text": "A lot of talk about mental illness on the feed.\n\nI'm not a very religious person, but I do have faith, and my child attends a private Christian school. \n\nBut it seems America really needs GOD.\n\nMost religions have some form of the 10 commandments, which are just basic human decency standards.\n\nAnd it seems to be heavily needed.",
    "bias": "None",
    "id": "1960764042890633272"
  },
  {
    "user": "@CryptoWendyO",
    "text": "WOW HEDERA HAS FIXED FEES! \n\nThis is MAJOR",
    "bias": "None",
    "id": "1960717567330541958"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Hey. \n\nI hold Ethereum. \n\nI’m just stating what I see in my mentions on all platforms. \n\nThe sooner you divorce your bags and remember why you are here the better you will perform.",
    "bias": "Herd / Bandwagon",
    "id": "1960705214601945168"
  },
  {
    "user": "@CryptoWendyO",
    "text": "38 years old is the median age of 1st time home owners.\n\nThis may be why fewer people are having children.\n\nThis is also why I hedged with Bitcoin and crypto \n\nThat seems to be the only hope for the future generation.",
    "bias": "Herd / Bandwagon",
    "id": "1960693624406249919"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Ethereum is now primarily for institutions.\n\nRetail has no interest.",
    "bias": "Herd / Bandwagon",
    "id": "1960686492000641190"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Happy International $DOG Day.",
    "bias": "None",
    "id": "1960545347081810381"
  }
]