[
  {
    "user": "@Ashcryptoreal",
    "text": "STOCKS ARE HITTING NEW ALL-TIME HIGH AHEAD OF THE SEPTEMBER POTENTIAL FED RATE CUT\n\nBITCOIN WILL FOLLOW!",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "FUD is temporary and fake \n\nFOMO is real and strong \n\nJust check how many and how much \nall these big companies are buying for \nTheir treasuries every week. Bears will\nget slaughtered as soon as QE and rate\ncuts start in Q3-Q4  \n\nBitcoin is going to $200,000 in 2025",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🐋 A WHALE BOUGHT 567 BTC WORTH $61.1 MILLION TODAY.\n\nWHILE PEOPLE PANIC SOLD DUE TO 80K BTC TRANSFER, SMART MONEY BOUGHT THE DIP.",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "ETH GOD CANDLE IN FEW WEEKS\n\nBEARS WILL GET SLAUGHTERED.\n\nPATIENCE.",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "For all the panic sellers",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "WHAT THE ACTUAL F*CK?\n\nANOTHER 10,000 BTC HAS BEEN ACTIVATED AFTER 14.2 YEARS.\n\nTHIS IS 4TH ONE THAT HAS HAPPENED TODAY.",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "𝟮𝟭𝘀𝘁 𝗗𝗲𝗰𝗲𝗺𝗯𝗲𝗿 𝟮𝟬𝟮𝟬\n\n➙ $1.4 trillion spending bill was passed\n\n➙ Altcoin MCap pumped 700% after that\n\n𝟯𝗿𝗱 𝗝𝘂𝗹𝘆 𝟮𝟬𝟮𝟱\n\n➙ $3.3 trillion spending bill has been passed \n\nAltseason 2.0 will now start 🚀",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "I DON'T WANT GF\n\nI DON'T WANT MANSION\n\nI DON'T WANT CARS\n\nALL I WANT IS $ETH PUMP TO $10K \n\nPLS GOD PLS 🙏",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BITCOIN TYPICALLY PEAKS 18 MONTHS AFTER EACH HALVING. \n\nWILL HISTORY REPEAT ITSELF?\n\nHistorically, Bitcoin reaches its cycle peak around 18 months after each halving.\n\nIf this pattern holds, the next peak could occur in September, aligning with a potential Fed rate cut.\n\nBut what makes this cycle different?\n\n➡️  It's institutionally driven\n➡️  Exhibits less volatility\n➡️  Shows a slower, more stable price climb\n\nUnlike past cycles, we may be in a longer, more sustained bull run.\n\nA Fed rate cut could further fuel this momentum, potentially signaling the beginning of an extended bull market.",
    "bias": "FOMO"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "ETH/BTC BOTTOM IS CONFIRMED\n\nETH/BTC JUST BOUNCED FROM THE SAME LEVEL AS IN 2020 WHICH TRIGGERED MASSIVE ETH PUMP. \n\nIF HISTORY REPEATS, WE CAN SEE A MASSIVE ALTCOINS RALLY.",
    "bias": "FOMO"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🇺🇸 BLACKROCK AND FIDELITY HAS \nBOUGHT 57,700 ETHEREUM WORTH \n$148.5 MILLION.\n\nTHEY KNOW ETH IS GOING TO $10K",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "20,000 BITCOIN WORTH $2.18 BILLION HAS BEEN ACTIVATED AFTER 14.3 YEARS.\n\nIN 2011, THESE BITCOIN WERE WORTH JUST $15,400.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇺🇸 BLACKROCK, FIDELITY AND ARK INVEST JUST BOUGHT $575.8 MILLION WORTH OF BITCOIN.\n\nWHALES ARE LOADING!! 🚀",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@StockSavvyShay",
    "text": "TOP 5 POSITIONS IN MY GROWTH PORTFOLIO\n\n1. $PLTR -- Operating System for AI\n2. $AMZN -- Ecosystem Powering the Digital Age\n3. $AXON -- Command Center for Public Safety\n4. $NET -- Gatekeeper of the Modern Internet\n5. $CRWD -- Shield for Enterprise Infrastructure",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Monday’s Futurum Daily Signal will break down why this bill is a major tailwind for these 10 names -- and what’s coming next.\n\nGet it FREE -- subscribe below 👇\n\nfuturumequities.com/",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "10 BIGGEST WINNERS FROM THE BIG BEAUTIFUL BILL ACT\n\n1. $NVDA | NVIDIA\n2. $TSM | Taiwan Semiconductor\n3. $PLTR | Palantir\n4. $AVGO | Broadcom\n5. $RKLB | Rocket Lab\n6. $ASTS | AST SpaceMobile\n7. $EOSE | Eos Energy\n8. $MU | Micron\n9. $VRT | Vertiv\n10. $OKLO | Oklo",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE ARE THE TOP 15 GROWTH PERFORMERS OF 2025\n\n1. $HOOD +153%\n2. $OKLO +153%\n3. $PGY +139%\n4. $ASTS +116%\n5. $TMDX +107%\n6. $MP +104%\n7. $STNE +103%\n8. $SYM +102%\n9. $QBTS +100%\n10. $HIMS +98%\n11. $NBIS +81%\n12. $TEM +81%\n13. $NVTS +80%\n14. $RBLX +79%\n15. $PLTR +78%",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "These figures only include browser-based web traffic, not mobile app usage -- meaning platforms like TikTok, Instagram, and X are heavily underrepresented.",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL OWNS THE ATTENTION STACK\n\nGoogle & YouTube pull more traffic than the rest of the top 20 combined. \n\nAnd yeah -- ChatGPT just passed Wikipedia. Let that sink in  🤯",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "WHEN THE GUY RUNNING THE WORLD PROMISES ATHs -- YOU DON’T FADE IT\n\nPresident Trump says “Stock markets are now at all-time high -- we’re going to maintain it, believe me.”",
    "bias": "FOMO"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PRESIDENT TRUMP TARGETS AI CHIP LOOPHOLES\n\nNew rule would block $NVDA exports to China via Malaysia and Thailand -- Trump’s first move to undo Biden’s AI policy.",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PRESIDENT TRUMP SIGNS BIG BEAUTIFUL BILL INTO LAW",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Two months out from marrying my favorite person 💍",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Wow -- didn’t expect all 25 slots to get claimed so fast.\n\nI’ve seen the DMs rolling in, and rather than send out custom codes, I’m just going to expand the coupon for another 25 spots.",
    "bias": "FOMO"
  },
  {
    "user": "@StockSavvyShay",
    "text": "4TH OF JULY SALE -- FIRST 25 ONLY\n\nGet access to research on 22 early-stage disruptors in my small-cap portfolio -- compounding at 84% CAGR.\n\nUse code INDEPENDENCE at checkout for 25% off.\n\nThis is the community I’m building  👇\nsavvytrader.com/StockSavvySh…",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "5 SMALL-CAP NAMES I’M MOST EXCITED ABOUT RIGHT NOW\n\n1. $RKLB -- Future of Space Logistics\n2. $ASTS -- Bridging Global Connectivity from Space\n3. $EOSE -- American Battery Vault of the Energy Grid\n4. $NVTS -- Power Switch for the AI Age\n5. $ACHR -- Platform for Urban Air Mobility",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "ZUCKERBERG IS IN FULL WAR-TIME CEO MODE AT $META\n\nLook at what the head of recruiting at OpenAI just said. \n\nZuck knows these AI big brains are the gatekeepers of the new digital economy -- whoever gets them, gets to shape the foundation models that shape everything.",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "YT⏯️lnkd.in/e6S5DGvf\n\nPodcast🎧lnkd.in/eVnejVFb",
    "bias": "Contrarian"
  },
  {
    "user": "@CarterBWorth",
    "text": "It never got me a better grade on an exam, a free ride on the train, a job offer, or a date, nor should it, but I’m proud of my grandfather’s great great great grandfather - Carter Braxton- who stood up to tyranny, put his life on the line and risked everything for independence.",
    "bias": "FOMO"
  },
  {
    "user": "@jonnajarian",
    "text": "Happy Birthday, America! 🇺🇸\nWishing everyone a joyful and meaningful #IndependenceDay! I’m enjoying time at the lake with friends and family — and feeling incredibly grateful for the freedoms we enjoy in this great nation.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@jonnajarian",
    "text": "Sad, but obvious that Dems don't love America",
    "bias": "None"
  },
  {
    "user": "@jonnajarian",
    "text": "Ending the Imperial Judiciary  realclearpolitics.com/articl…",
    "bias": "None"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Happy 4th of July from Monte Carlo ❤️",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "And tips in overtime will no longer be taxed.",
    "bias": "None"
  },
  {
    "user": "@LeadingReport",
    "text": "BREAKING: Every U.S. child will receive a $1,000 S&P 500 starter account at birth once President Trump signs the ‘BBB.’",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "Bonus\n\nDid we kill off everyone playing in DeFi from 2020 to 2022?\n\nBack then, we had similar arguments about stablecoins; interest rates drove their adoption. That was the appeal of OlympusDAO and UST; huge interest rates.\n\nTake away interest rates and what's left?",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@biancoresearch",
    "text": "7/7\n\nThere is one way to reach Bessent's \"very reasonable number\" of $2T in stablecoins within a decade.\n\n10x the price of crypto ($1m of stablecoins to buy 1 $BTC, vs $100k now).\n\nIf this is what they think, then say it this way.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "6/7\n\nRemittances and Merchant Payments are basic tradFi functions. MMMFs and demand deposit accounts pay interest.\n\nWhy would anyone trade out of them into a non-interest-bearing instrument?\n\n(Answer: they would not if acting rationally.)",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "5/7\n\nFor holders of stablecoins, it is \"dead money\" (no interest). This means the issuer keeps all the interest from the Treasuries that collateralize them.\n\nIs this why $CRCL is up 500% since its June 4th IPO?\nBy keeping all the interest, it has the fattest margins in Tradfi?",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "4/7\n\nThere is a big problem, as @DavidSacks explains: the banking industry is afraid of them.\n\nThe GENUIS Act legislates that stablecoins will not pay interest to the holders.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "3/7\n\nHowever, the hope is that the other 6%, such as remittances and merchant payments, will soar with the regulatory clarity provided by the GENIUS Act.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "2/7\n\nFirst, what are stablecoins used for? 88% are for trading, DeFi, or Treasury functions. In other words, on-chain functions (which need a dollar proxy).\n\nRegulatory clarity is not needed for these purposes.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "1/7\n\nI don't think it's about \"fesh\" USD for stablecoins.\n\nIt's about regulatory clarity creating demand for stablecoins, which in turn drives new demand for ST Treasuries.\n\nBut I'm skeptical this will even happen. The GENIUS ACT potentially has a fatal flaw.\n@nic__carter \n🧵",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "However:\n\nSlowing immigration, increased deportations, and the continuing low fertility rate (for decades), means population growth has really slowed.\n\nThis has lead some estimates that the economy now only needs to create 20k to 40k jobs a month to meet the now lower population growth.\n\nSo yes, 74k private sector jobs is slowing. But it’s more than enough to meet the economy’s needs. \n\nThe bond market reacted appropriately given this reality.",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Knowing the timing of the context is critical, otherwise your overall portfolio strategy will struggle",
    "bias": "Overconfidence"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Takes time for The People to learn The Way of Strategy",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "US JOBS \n\n= as we were Nowcasting, this was another month of NON-recessionary US labor data\n\nSlowing? Yes, but not discrete enough to shift the near-term policy calculus (July FOMC), particularly with Jobless Claims printing benignly (again), ISM Services New Orders back in Expansion and (what we expect to be) a relatively hawkish CPI update in queue @HedgeyeUSA",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@KeithMcCullough",
    "text": "\"America is another name for opportunity.\"\n— Ralph Waldo Emerson\n\n#Happy4thofJuly",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Yep, but he's right. He can't time markets.",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Macro isn’t a side hustle. It’s a daily grind.\n\n ➤ 445AM: Analyze the global tape\n ➤ 545AM: Adjust risk\n ➤ 6AM: Write the plan\n\nThen execute it. Every day. No feelings, no fluff.",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Nvidia CEO Jensen Huang: \"We’re working towards a day where there will be billions of robots, hundreds of millions of autonomous vehicles, and hundreds of thousands of robotic factories that can be powered by Nvidia technology.\"\n\n$NVDA",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Cloudflare predicts that by 2026, more than 80% of enterprises will use genAI APIs, models or apps, up from just 5% in 2023.",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "The median data center size is expected to increase from 175 MW today to 275 MW by 2030 and 375 MW by 2035, as GPU clusters and AI server racks increase in size, per Bloom Energy.",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Amazon is estimated to have around 5,000,000 servers deployed globally across more than 100 data centers to support cloud computing demand.\n\n$AWS",
    "bias": "Loss Aversion"
  },
  {
    "user": "@RedDogT3",
    "text": "Purpose is important!",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "nitter.net/i/broadcasts/1vOGwXEbY…",
    "bias": "Contrarian"
  },
  {
    "user": "@kenr0966",
    "text": "@RedDogT3 sounds like you Reddog. haaaa",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "How do u develop your “go time”",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Happy 4th Of July!",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Don’t you ever fucking relent.\n\nNothing in your life matters more than your health.\n\nPut that beer down and get the fuck after it.\n\nYou can change.",
    "bias": "None"
  },
  {
    "user": "@ces921",
    "text": "Earlier this week there was discussion on FinTwit about how great of a Fed Chair Jerome Powell has been. \n\nI would like to respectfully and wholeheartedly disagree. \n\nThe Powell Fed has proven that it no longer serves the public.\n\nIt has stopped fighting inflation, deepened inequality, and quietly handed monetary control back to the U.S. Treasury — all without saying a word.\n\nThat’s what Powell’s Fed has done. \n\nA thread 🧵",
    "bias": "Contrarian"
  },
  {
    "user": "@leadlagreport",
    "text": "Free markets.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Louder.",
    "bias": "None"
  },
  {
    "user": "@LeverageValueP",
    "text": "Yes. Stimulus money quickly leave the masses pockets into the mega-corps....",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "There is a DIRECT link between “stimulus for the masses” and the rising number of billionaires.\n\nYou fools begging for more freebies from the government while complaining about billionaires have no fucking idea what you’re talking about.\n\nYOU ARE THE CAUSE.\n\nFew understand this.",
    "bias": "None"
  },
  {
    "user": "@Gary_Brode",
    "text": "Can Robinhood buy Polymarket? How big a catalyst is deregulation? @leadlagreport is doing the work in this space.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "The same people who were begging for stimulus during the COVID lockdowns and for rates to stay at record lows are the ones now bitching about home prices being high.\n\nPeople complain about outcomes DIRECTLY related to their actions.\n\nTake fucking responsibility.\n\nAusterity. Now.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@LeadLagMedia",
    "text": "The latest data shows inflation in Europe's largest economy continues to ease.\n\nGermany's annual consumer price inflation softened to 2.0% in June, down 2.1% in May, and below forecasts of 2.2%.\n\nThis represents the lowest level recorded since October 2024.",
    "bias": "Recency Bias"
  },
  {
    "user": "@LeadLagMedia",
    "text": "Since 2019, US home prices have shot up nearly 30% when adjusted for inflation, according to a report from the State of the Nation's Housing.\n\nThe increase, however, has varied widely depending on the city.",
    "bias": "None"
  },
  {
    "user": "@LeadLagMedia",
    "text": "More Momentum\n\nPay Attention\n\nRead here: leadlagreport.substack.com/p…",
    "bias": "FOMO"
  },
  {
    "user": "@LeadLagMedia",
    "text": "Powell Might Be Worried About Trump; He Should Be Worried About The Housing & Labor Markets\n\nRead here: leadlagreport.substack.com/p…",
    "bias": "None"
  },
  {
    "user": "@LeadLagMedia",
    "text": "This 11% Yielder Is Well Constructed & Could Take Advantage Of The Dollar Swoon\n\nRead here: leadlagreport.substack.com/p…",
    "bias": "Contrarian"
  },
  {
    "user": "@leadlagreport",
    "text": "The only work that matters is the work that nobody sees.",
    "bias": "None"
  },
  {
    "user": "@JeffHo1160030",
    "text": "The best healthcare is eating right, working out and managing stress. Doctors are simply mechanics and purveyors of pharmaceuticals.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "BREAKING: WE’RE FUCKED.\n\nGoodnight.",
    "bias": "None"
  },
  {
    "user": "@OracleOfTexas",
    "text": "I had seen some of your other before photos.     They were all impressive.   And I know you had said 100lbs.  But.   This is the most “shocking” photo.   Good stuff.   Don’t ever quit.",
    "bias": "None"
  },
  {
    "user": "@Antonio82687742",
    "text": "I miss the funny, happy Michael Gayed. Now you’re all trying not to relent and stuff",
    "bias": "None"
  },
  {
    "user": "@G3AdvJeff",
    "text": "Losing weight and being healthy is a 40% cost reduction opportunity for all of us.  Why are we paying for repeated self-inflicted problems?",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Anyone who complains about healthcare being “free” for people who don’t work needs to look themselves in the mirror first.\n\nHealthcare costs are expensive because everyone in this country is overweight and obese. \n\nGet yourself healthy and lose weight. That’s how costs drop.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@markminervini",
    "text": "The past is dead.\nIt exists only in your mind, and you are the one keeping it alive. But here’s the truth: the past has no inherent meaning except for the meaning you choose to assign to it. You don’t have to forget what happened or pretend it didn’t exist. You simply have to revise its meaning.\n\nThat is the secret to happiness.\nThat is the gateway to success.",
    "bias": "None"
  },
  {
    "user": "@markminervini",
    "text": "Would you like to know the first and most important secret to becoming hugely successful?\n\nOk, here it is:\nStop being bitter about the past.\n\nBeacause all the money or success in the world isn't going to do anything to make your sorry ass happy, if you can't be so intensely grateful for being alive, that the past doesn't matter. \n\nWhen you become and live THAT, amazing things become possible in every aspect of your life.",
    "bias": "None"
  }
]