[
  {
    "user": "@StockSavvyShay",
    "text": "Based on this data, the most undervalued SaaS names entering 2026 are $S, $MNDY & $OS.",
    "bias": "None",
    "id": "2005303302913950029"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HOW THE MARKET PRICES GROWTH TECH ENTERING 2026 \n\nThis chart shows how the market is valuing growth SaaS based on 3-year revenue CAGR (2025-2028) against EV to gross profit. \n\nThe market is already separating the companies that already have AI boats and which still need to build them ahead of the AI tsunami.\n\n$NET, $PLTR, $SHOP, $FIG, $RBRK, $SNOW, $CRWD, $DDOG, $ZS, $KVYO, $MNDY, $TEAM, $IOT, $MDB, $NOW, $HUBS $PANW, $VEEV, $S, $ESTC, $PATH, $ADBE, $WDAY, $CRM, $OKTA, $GTLB, $OS, $FROG",
    "bias": "None",
    "id": "2005299888175931430"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE BULL CASE ON $OSCR\n\nIf Oscar can scale its routing engine & steer members toward urgent care instead of the ER & toward lower-complication providers then that directly lowers claims costs.\n\nIf this works, Oscar becomes insurance infrastructure rather than just an insurer.",
    "bias": "None",
    "id": "2005280999144575324"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Peter Lynch favored the PEG ratio because it ties valuation to growth.\n\nI prefer using it over a 3-year window so valuation adjusts for how fast the business is actually growing.",
    "bias": "None",
    "id": "2005273822124277812"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PETER LYNCH’S FAVORITE METRIC IS THE PEG RATIO\n\nPEG < 1 usually means mispriced growth\nPEG > 2 starts to push into the danger zone\n\nPopular names right now:\n• $PLTR ~4.6x\n• $TSLA ~4.6x\n• $GOOGL ~2.7x\n• $HOOD ~2.7x\n• $AAPL ~2.6x\n• $ASML ~2.3x\n• $ALAB ~2.0x\n• $NOW ~1.9x\n• $AMZN ~1.7x\n• $MSFT ~1.5x\n• $SOFI ~1.5x\n• $META ~1.4x\n• $CRM ~1.3x\n• $TSM ~1.2x\n• $ADBE ~1.2x\n• $AVGO ~1.0x\n• $HIMS ~1.0x\n• $ORCL ~0.9x\n• $NVDA ~0.8x\n• $PYPL ~0.8x\n• $AMD ~0.6x",
    "bias": "None",
    "id": "2005273243289358349"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NBIS on track to do ~$3.4B in 2026 revenue and exit the year at ~$8B ARR.\n\nCloud Utility for the AI Age.",
    "bias": "None",
    "id": "2005265543818035406"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NVDA CEO Jensen Huang on using AI early in your career:\n\nThe people who stand out aren’t the ones asking AI random questions but the ones asking how AI helps them do their job better.\n\nThat advice matters right now since younger grads are feeling the job market the most with unemployment for ages 20–24 jumping to 9.2% which is a level usually seen in recessions.",
    "bias": "None",
    "id": "2005253437819396264"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Which stock made you the most money in 2025?\n\nFor me it was $RKLB.",
    "bias": "None",
    "id": "2004983046446219525"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NVDA acquiring Groq turns a competitive threat into a customer segmentation tool by allowing Nvidia to route premium customers to GPUs, price-sensitive inference workloads to LPUs & capture revenue either way.",
    "bias": "None",
    "id": "2004968452164125084"
  },
  {
    "user": "@StockSavvyShay",
    "text": "The Godfather of AI saying pre-training gains are hitting data limits reinforces a point I’ve made for a while which is the AI economic gravity is shifting from training models to running them at scale through inference.\n\nThat’s exactly why $NVDA moved on Groq to make sure the future of real-time, low-latency inference still runs through Nvidia’s platform",
    "bias": "None",
    "id": "2004957867062034537"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE ARE THE TOP 15 GROWTH PERFORMERS OF 2025\n\n1. $PL +379%\n2. $IREN +310%\n3. $OPEN +276%\n4. $OKLO +262%\n5. $MP +242%\n6. $ASTS +241%\n7. $MU +238%\n8. $ONDS +231%\n9. $CIFR +227%\n10. $HOOD +217%\n11. $NBIS +216%\n12. $JMIA +212%\n13. $QBTS +201%\n14. $RKLB +177%\n15. $PLTR +150%",
    "bias": "None",
    "id": "2004945543169278009"
  },
  {
    "user": "@StockSavvyShay",
    "text": "I’ve owned most of these for years so this isn’t a call to buy at current levels.\n\nMy risk profile entering in 2023–2024 is very different from entering in 2026.\n\nIf we do get a real dislocation or black swan next year, these are the kinds of businesses with very high long-term ceilings if execution follows.",
    "bias": "None",
    "id": "2004943045608038430"
  },
  {
    "user": "@StockSavvyShay",
    "text": "A bullish setup for me is when the 9-day EMA is above the 21-day EMA & the stock is holding both the 50-day & 200-day SMA so both momentum + structure are moving in the same direction.\n\nIf the only level a stock is holding is the 200-day SMA then the long-term trend is still intact but the momentum has faded so I treat it as a hold.\n\nWhen the price breaks below all three levels then that is when I consider the trend bearish because the short-term, intermediate & long-term signals are all pointing the same way.",
    "bias": "Euphoria / Greed",
    "id": "2004930921238032877"
  },
  {
    "user": "@StockSavvyShay",
    "text": "KEY LEVELS TO WATCH FOR THE FINTWIT FAVORITES\n\nBullish | $NVDA, $TSLA, $PLTR, $RKLB, $ASTS\n\nHold | $AMD, $IREN, $CIFR, $OPEN, $NBIS, $OKLO, $IONQ, $HOOD, $SOFI, $EOSE\n\nBearish | $ACHR, $OSCR, $HIMS, $TEM",
    "bias": "Euphoria / Greed",
    "id": "2004930391501918486"
  },
  {
    "user": "@jonnajarian",
    "text": "Remember when LGBTW was just G?",
    "bias": "None",
    "id": "2005301451569127823"
  },
  {
    "user": "@jonnajarian",
    "text": "Here is Eva Vlaardingerbroek's speech, since youtube saw fit to censor it. @EvaVlaar",
    "bias": "None",
    "id": "2005295558274224530"
  },
  {
    "user": "@jonnajarian",
    "text": "Brigitte Bardot was prosecuted 6 times for criticizing  French immigration policies. France took its most internationally recognized cultural figure & turned her into a criminal for having \"wrong\" opinions. She passed away at 91. RIP legend.",
    "bias": "None",
    "id": "2005293232721428544"
  },
  {
    "user": "@jonnajarian",
    "text": "This $18B in fraud is NOT in the past, it is ongoing. IT IS STILL HAPPENING & MINNESOTA POLITICIANS ARE STILL COMPLICIT!!",
    "bias": "None",
    "id": "2005290139325813132"
  },
  {
    "user": "@jonnajarian",
    "text": "One man with determination and a camera found $110M worth of corruption in Minnesota in just hours. WHERE IS THE IRS, THE JUSTICE DEPARTMENT, THE FBI, THE STATE OF MINNESOTA? Prosecute @GovTimWalz @keithellison & all these fraudsters!",
    "bias": "None",
    "id": "2005286462313631873"
  },
  {
    "user": "@jonnajarian",
    "text": "Grok says TRUE",
    "bias": "None",
    "id": "2005265112085467556"
  },
  {
    "user": "@jonnajarian",
    "text": "Clemson receivers keep dropping balls, play calling is horrific and apparently the referee couldn't see the obvious DPI right in front of him. Other than that, things are fine.",
    "bias": "None",
    "id": "2004980316319228025"
  },
  {
    "user": "@jonnajarian",
    "text": "Depth and layers of Stairway to Heaven are so very special",
    "bias": "None",
    "id": "2004948773752246679"
  },
  {
    "user": "@jonnajarian",
    "text": "Smith's diving TD catch in overtime sends @GopherFootball Minnesota to 20-17 win over New Mexico in Rate Bowl espn.com/ncf/recap?gameId=40…",
    "bias": "None",
    "id": "2004946928304337264"
  },
  {
    "user": "@jonnajarian",
    "text": "Krampus in the US",
    "bias": "None",
    "id": "2004915420197769414"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Matt, you're up that much using the Hedgeye Process?",
    "bias": "None",
    "id": "2005295984386224470"
  },
  {
    "user": "@KeithMcCullough",
    "text": "I don't need to call it anything but a long. Less narratives/charts. More money.",
    "bias": "None",
    "id": "2005295330439655654"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Top Performing ETF Ideas app.hedgeye.com/insights/175… via @hedgeye",
    "bias": "None",
    "id": "2004878725352239158"
  },
  {
    "user": "@Beth_Kindig",
    "text": "TSMC $TSM is reportedly accelerating its second Arizona fab, aiming to move chipmaking equipment into place in the summer of 2026 to prepare for 3nm manufacturing in 2027.\n\n$NVDA $INTC $AMD",
    "bias": "None",
    "id": "2005009574890496093"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Micron $MU has projected the HBM TAM to nearly triple in three years, up from $35 billion in 2025 to $100 billion by 2028. \n\nThis is notably 2 years sooner than Micron had previously forecast.\n\n$NVDA $AMD $AVGO",
    "bias": "None",
    "id": "2004982731340743123"
  },
  {
    "user": "@RedDogT3",
    "text": "Rule #2 helps you avoid bad shorts\n\nnitter.net/RedDogT3/status/191650…",
    "bias": "None",
    "id": "2005269754425340167"
  },
  {
    "user": "@RebellioMarket",
    "text": "14 Top Technical Analysis Books\n\nFor Beginners\n\n1. \"Technical Analysis of the Financial Markets\" by John J. Murphy\nWidely considered the bible of technical analysis—covers charts, indicators, patterns, and more.\n\n2. \"Technical Analysis Explained\" by Martin J. Pring\nComprehensive and foundational, ideal for building a solid understanding of TA principles.\n\n3. \"A Beginner's Guide to Charting Financial Markets\" by Colin Bennett\nUser-friendly and simplified guide with focus on practical application.\n\n4. \"Japanese Candlestick Charting Techniques\" by Steve Nison\nThe definitive book on candlestick patterns—an essential visual tool for traders.\n\n5. \"Charting and Technical Analysis\" by Fred McAllen\nEasy-to-understand guide that breaks down concepts into beginner-friendly language.\n\n6. \"Encyclopedia of Chart Patterns\" by Thomas Bulkowski\nAn in-depth reference with statistical insights into over 60 chart patterns.\n\n7. \"Trading for a Living\" by Dr. Alexander Elder\nCovers psychology, technical analysis, and trading systems—great for developing discipline.\n\n8. \"The New Trading for a Living\" by Dr. Alexander Elder\nUpdated version with new tools and strategies.\n\n9. \"Technical Analysis Using Multiple Timeframes\" by Brian Shannon\n\n10. \"Market Wizards\" by Jack D. Schwager\n\nNot strictly a TA book, but includes insights from top traders who use technical strategies.\n\nBonus: Strategy & Indicators Focus\n\n11. \"Come Into My Trading Room\" by Dr. Alexander Elder\n\n12. \"Swing Trading Using the 4-Hour Chart\" by Laurentiu Damir\n\n13. \"The Art and Science of Technical Analysis\" by Adam Grimes\n\n14. \"How to Make Money in Stocks\" by William J. O'Neil",
    "bias": "None",
    "id": "2004989939457376666"
  },
  {
    "user": "@RedDogT3",
    "text": "Take 13 minutes - these are tactics \n\nHours before u should get ur mind right so U can think clearly to execute",
    "bias": "None",
    "id": "2004945461720089086"
  },
  {
    "user": "@AnkurPatel59",
    "text": "How to Improve Your Win Rate as a Swing Trader\n\nYour win rate matters. Not as much as your risk-reward, but it matters. A higher win rate means you stay in the game mentally. You build confidence and trust in your process. \n\nHere's how to improve it:\n\n1. Only enter when there is sufficient tightness on the chart\n\nTightness means the stock is coiling. The range is contracting. Volatility is compressing. When a stock tightens near highs, it's building energy for the next move. Loose, sloppy charts lead to loose, sloppy results.\n\n2. Focus on stocks near their 52-week highs, not lows\n\nUnless the entire market is recovering from bear market lows, stick to stocks making new highs. Stocks at lows are there for a reason. Stocks at highs are showing strength. Trade strength, not weakness.\n\n3. Only trade leading stocks from leading sectors\n\nA 3-star setup in a leading sector is better than a 5-star setup in a poorly performing sector. When the sector has momentum, even average setups work. When the sector is lagging, even great setups struggle.\n\n4. Trail your winners aggressively\n\nAs soon as a trade moves in your favor by a certain percentage, protect your breakeven. The winning horses don't come back to the starting line. If a stock starts reversing, don't let a winner turn into a loser.\n\n5. Stick to setups that form after a trend is established\n\nFlags are a perfect example. They form after a strong move. You're not trying to catch the beginning of the trend. You're joining a trend that's already proven itself. This increases your odds significantly.\n\n6. Take entries when setups form around key moving averages\n\nStocks respect moving averages. When a setup forms near the 10 EMA, 20 EMA, or 50 DMA, those levels often act as support. It gives your trade a higher probability of working out.\n\n7. Be patient when your setups are forming\n\nDon't anticipate. Don't enter early. Wait for the breakout. Trying to get in before the setup completes will cost you win rate. Let the pattern finish. Then enter.\n\n8. Trade with the overall market\n\nIf the market is in a strong uptrend, your win rate goes up. If the market is choppy or declining, even perfect setups fail. Align your trades with the market's direction.\n\n9. Only take 5-star setups\n\nNot every setup is worth taking. If you're unsure, skip it. The cleaner and more obvious your setups are, the higher your win rate will be. Quality over quantity.\n\n10. Review your losing trades\n\nYour losses will tell you where you're going wrong. Are you entering too early? Chasing weak stocks? Trading against the market? Your losing trades are feedback. Use them.\n\nImproving your win rate is all about being selective. Trading the right stocks, in the right sectors, at the right time, with the right market conditions.\n\nDo that, and your win rate takes care of itself",
    "bias": "FOMO",
    "id": "2004837657990328378"
  },
  {
    "user": "@RedDogT3",
    "text": "I’m sure I will chart and give a active approach to most of these throughout 2026\n\n*There will be times when they are correcting, to take care and avoid.  \n*times to accumulate after a low.  \n\nThe best times will be when they break down trends and weeks later look ready to breakout \n\nAfter, we manage our  size and the sequence",
    "bias": "FOMO",
    "id": "2004929027966968158"
  },
  {
    "user": "@RedDogT3",
    "text": "5 months ago the daily / weekly and monthly charts were all lining up $slv\n\nRecently it ignited again. That was $49.50 $slv and it’s been above the 8/22day since \n\nCharts and tactics help \nA narrative also makes many feel good",
    "bias": "None",
    "id": "2004927581175583156"
  },
  {
    "user": "@RedDogT3",
    "text": "One of my young traders said this helped him.  \nLike trading 101!  I have 30 years of seat time. \nIf u just started. Use ur resources",
    "bias": "None",
    "id": "2004923492786213266"
  },
  {
    "user": "@RedDogT3",
    "text": "If $SLV reverses, this is how to catch it:\n\nnitter.net/RedDogT3/status/189632…",
    "bias": "None",
    "id": "2004922214727254339"
  },
  {
    "user": "@RedDogT3",
    "text": "The Road I’ve traveled!  Maybe I can save u a few speed bumps!",
    "bias": "None",
    "id": "2004917156161437970"
  },
  {
    "user": "@RedDogT3",
    "text": "Get involved 2026!",
    "bias": "None",
    "id": "2004915285157965969"
  },
  {
    "user": "@leadlagreport",
    "text": "Materials stocks are screaming.\n\nEnergy is rolling over.\n\nConsumers are cracking.\n\nThis isn’t rotation — it’s a warning hiding inside a rally.\n\nThis is what markets look like right before something changes.\n\nopen.substack.com/pub/leadla…",
    "bias": "None",
    "id": "2005248133983515029"
  },
  {
    "user": "@leadlagreport",
    "text": "Every deflationary era starts with a commodity mania.\n\nSilver, Gold, Platinum - it has begun.\n\nLike and repost if you understand this.",
    "bias": "None",
    "id": "2005290954421670352"
  },
  {
    "user": "@leadlagreport",
    "text": "Markets at all-time highs.\n\nThe Fed is cutting.\n\nVolatility is changing the rules.\n\nThis is how portfolios fail — not in crashes, but in regime shifts.\n\nIgnore this at your own risk.\n\nNew episode of Lead-Lag Live, hosted by @Mela_Schaffer \n\nopen.substack.com/pub/leadla…",
    "bias": "None",
    "id": "2005289781081903276"
  },
  {
    "user": "@AOTINVEST",
    "text": "Nvidia dominates chip profitability\n\nWith 59% operating margins and 70% gross margins, Nvidia leads the industry by a wide margin.\n\nLearn more and view fund holdings at AOTETF.com/aotg and AOTETF.com/aots.\n\n$AOTG $NVDA $AMD $TSMC $AVGO\n\nDistributed by PINE Distributors LLC\n\nETFAC-5070847-12/25",
    "bias": "None",
    "id": "2005013824827449384"
  },
  {
    "user": "@leadlagreport",
    "text": "Legitimate question:\n\nHave people become considerably more dumb since Covid?\n\nI feel like average competence has collapsed.\n\nVaccine?",
    "bias": "None",
    "id": "2005280513989480876"
  },
  {
    "user": "@leadlagreport",
    "text": "I openly talk about being wrong.\n\nI openly talk about my failures.\n\nI openly talk about my vulnerabilities.\n\nAnd it’s still not enough.\n\nStill there are people who say comments like this, when I try to live my life with integrity.\n\nAs I build businesses and try to do right.",
    "bias": "None",
    "id": "2005267701313482980"
  },
  {
    "user": "@leadlagreport",
    "text": "There are no shortages, only manipulations.",
    "bias": "None",
    "id": "2005265748256547289"
  },
  {
    "user": "@leadlagreport",
    "text": "God did not forget you.\n\nHe is forming you.\n\nI asked God for strength.\n\nHe gave me challenges to overcome.\n\nThis was an incredibly painful and emotional year of transition for me.\n\nLost friends.\n\nPartners.\n\nHope.\n\nSometimes everything must fall apart.\n\nTo see what you’re made of.",
    "bias": "None",
    "id": "2005257389688426862"
  },
  {
    "user": "@williamwaite7",
    "text": "If only there was an investment vehicle to play such a trend. 🤔. Wait… I seem to remember something…\n\n$FMKT\n\nFor those of you who don’t know, FMKT is an #ETF that focuses benefiting from #deregulation.",
    "bias": "None",
    "id": "2005165411957166208"
  },
  {
    "user": "@RealKevinNash",
    "text": "Today  is the day in 1994 I lost my mother to breast cancer. Was thinking about her and realized it's been 31 years. I've lived 35 years since then. 58 years since my father passed of a heart attack. 3 years since I lost my son. Life is so precious and fragile. I'm going to train back and let my mind focus on the positive. One day at a time. It's all we're guaranteed",
    "bias": "None",
    "id": "2005025571613380891"
  },
  {
    "user": "@leadlagreport",
    "text": "I think I know a fund focused on deregulation @Todd_Sykon @MAGAindex",
    "bias": "None",
    "id": "2005079874382573800"
  }
]