[
  {
    "user": "@StockSavvyShay",
    "text": "Ray Dalio warned at Davos that rising trade tensions, widening deficits & policy uncertainty could erode confidence in U.S. assets triggering what he called “capital wars.”\n\nHe noted growing flows into gold as a hedge against a breaking monetary order arguing investors remain underallocated to hard assets even as debt & geopolitical risks rise.",
    "bias": "None",
    "id": "2013640951437377740"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$PLTR CEO Alex Karp said the real lesson from AI on the battlefield is that advantage comes from doing what no one else can.\n\nPalantir’s ontology does this by mapping a company’s data, systems & workflows into a shared language so AI can actually act.",
    "bias": "None",
    "id": "2013637693872488761"
  },
  {
    "user": "@StockSavvyShay",
    "text": "BITCOIN $BTC JUST BROKE BELOW $90K",
    "bias": "None",
    "id": "2013630807307407855"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Blackrock CEO Larry Fink said Davos is an elite gathering trying to shape a world that many affected by its decisions will never attend.\n\nHe acknowledged a deep loss of public trust and warned the World Economic Forum must regain legitimacy to remain relevant",
    "bias": "None",
    "id": "2013625427382935979"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$MSFT CEO Nadella says an AI bubble forms if the benefits stay concentrated.\n\nIf AI doesn’t show up as broad productivity gains and real economic growth beyond hyperscalers then it’s a warning sign we’re just recycling spend rather then creating value.",
    "bias": "None",
    "id": "2013547867848229084"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Ownership is starting to matter more than access in the AI economy.\n\nThe market is clearly rewarding companies that own AI compute like $NVDA & $GOOGL while separating them from those that primarily consume it like $AAPL & $MSFT.",
    "bias": "None",
    "id": "2013613212860633108"
  },
  {
    "user": "@StockSavvyShay",
    "text": "U.S. Treasury Secretary Scott Bessent said the U.S. has been pursuing Greenland for years and that the effort is not new.\n\nHe argued the U.S. must take a stronger role because Europe cannot guarantee its own security.",
    "bias": "None",
    "id": "2013605167120425088"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NOW & OpenAI signed a 3-year partnership to embed OpenAI models & agents directly into ServiceNow workflows with usage-based revenue tied to customers.\n\nThe deal includes voice agents for customer service & agent-driven IT actions like restarting machines & pulling data from legacy systems.",
    "bias": "None",
    "id": "2013598452777975838"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Japan’s bond market is in a full-blown selloff today with yields spiking to their highest level in ~20 years.\n\nWarning that global rates volatility is back.",
    "bias": "None",
    "id": "2013583517259829291"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$UBER CEO says he expects rides to be largely robot-driven over the next 20 years with autonomous drivers ultimately safer than humans as they never tire or stop improving.\n\nAdoption will be gradual but falling costs & L3/L4-ready vehicles point to a trillion-dollar transition.",
    "bias": "None",
    "id": "2013578220839580015"
  },
  {
    "user": "@StockSavvyShay",
    "text": "OVERNIGHT ACTION SO FAR\n\n• $IREN -6%\n• $CRWV -6%\n• $CIFR -5%\n• $BMNR -5%\n• $ASTS -5%\n• $NBIS -5%\n• $EOSE -5%\n• $RKLB -4%\n• $HOOD -4%\n• $IONQ -4%\n• $ONDS -4%\n• $PLTR -2%\n• $NVDA -2%\n\nPolicy-driven selling like this is typically an opportunity disguised as fear.",
    "bias": "None",
    "id": "2013419222353707148"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE’S TODAY’S FOX BUSINESS SEGMENT\n\n• What $TSM earnings revealed about the AI cycle: $NVDA, $ASML, $AMD\n• SMID names riding TSMC’s dominance: $AMKR, $AEHR, $ALAB, $PSTG\n• The space economy in 2026: SpaceX, $RKLB, $ASTS, $PL\n• FOMO vs. fear of buying the top and how growth investors build positions\n• Why tariff-driven volatility is political noise rather than a breakdown in bull market",
    "bias": "None",
    "id": "2013389089601700086"
  },
  {
    "user": "@jonnajarian",
    "text": "6⃣0⃣ Seconds $CDE #VIX $BOIL $UNG $UMC $CRVS $BULZ Rebel's Edge 🏴‍☠️1pm",
    "bias": "Panic / Capitulation",
    "id": "2013609846679994615"
  },
  {
    "user": "@jonnajarian",
    "text": "Joe Rogan vastly outpaces every other podcaster, often 2–5x in per-episode listeners, yet not nominated? Seems fishy to Bill Maher as well, @billmaher  tears into Golden Globes for Joe Rogan podcast snub: 'Only nominated like the super woke stuff' - msn.com/en-us/news/other/bil…",
    "bias": "None",
    "id": "2013636333160313336"
  },
  {
    "user": "@jonnajarian",
    "text": "Nima to Amal Clooney about her silence on IRAN",
    "bias": "None",
    "id": "2013296691739328837"
  },
  {
    "user": "@jonnajarian",
    "text": "Great to see the support for the Iranian people @patrickbetdavid",
    "bias": "None",
    "id": "2013273886222061637"
  },
  {
    "user": "@jonnajarian",
    "text": "ICE agents using mother nature to deal with Karens",
    "bias": "None",
    "id": "2013264332851736759"
  },
  {
    "user": "@jonnajarian",
    "text": "Who blinked? \nGermany deployed a reconnaissance team of 15 Bundeswehr soldiers to Greenland.  However, they departed just about 44 hours later on Sunday, January 18, 2026, flying out of Nuuk on a civilian flight to Copenhagen.",
    "bias": "None",
    "id": "2013263529982198187"
  },
  {
    "user": "@jonnajarian",
    "text": "\"Those who cannot remember the past are condemned to repeat it\".  \nWealthy exodus and capital flight UK: Reports (Henley & Partners) projected/recorded a net loss of around 16,500 millionaires from the UK in 2025, associated wealth outflows estimated in the tens of billions",
    "bias": "None",
    "id": "2013261851425993019"
  },
  {
    "user": "@jonnajarian",
    "text": "I'll bet Dana White @danawhite loves his ground & pound!",
    "bias": "None",
    "id": "2013256575515832471"
  },
  {
    "user": "@KeithMcCullough",
    "text": "In today's  Early Look: \"#Quad1 Tracking vs. Tourists\"\n\nAre you tracking The Cycle like Varty tracks lions, or are you having a panic attack like a Tourist who turned on CNBC instead of following your process?\n\nPersonally, I don't want the world to end today. If it does, this note doesn't matter. If it doesn't, I've already executed my pre-game process the same way I do every Game Day",
    "bias": "None",
    "id": "2013604882503045316"
  },
  {
    "user": "@KeithMcCullough",
    "text": "“To track is to discover that nature is alive and speaks a language of its own.”\n-Boyd Varty",
    "bias": "None",
    "id": "2013604362963026120"
  },
  {
    "user": "@KeithMcCullough",
    "text": "With the Yield Curve steepening towards new #Quad1 Cycle Highs (as we expected), I'll review the Bond Market Signals on The Macro Show 9AM ET @HedgeyeTV",
    "bias": "None",
    "id": "2013574942881611840"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Semis $SMH closed at all-time highs on Friday. It gets harder for a Tourist to remember things they don't keep track of and write down (long weekends are a killer for context!)",
    "bias": "None",
    "id": "2013573722385383511"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Before I publish it, guess where the TRR (top-end of the Risk Range™ Signal) is for Silver?",
    "bias": "None",
    "id": "2013572599943483575"
  },
  {
    "user": "@KeithMcCullough",
    "text": "If only someone created ETFs to A) hedge $SPY at all-time highs and B) stay with The Fourth Turning...",
    "bias": "None",
    "id": "2013571538847432772"
  },
  {
    "user": "@KeithMcCullough",
    "text": "GOLD: continues to deliver Full Investing Cycle alpha in #Quad1 & The Fourth Turning @HoweGeneration @RPKent",
    "bias": "None",
    "id": "2013571206771839236"
  },
  {
    "user": "@KeithMcCullough",
    "text": "TURKEY: doesn't care about Macro Tourists trading US Equity Futures \n\nStocks in Istanbul UP +0.4% to a blistering +12.9% in the last month for The Hedgeye Fam $TUR",
    "bias": "None",
    "id": "2013569537795297772"
  },
  {
    "user": "@KeithMcCullough",
    "text": "DENMARK: stocks only correcting -0.5% and that's after being +6.8% in the last month, despite the MSM \"news\" fearmongering #Greenland",
    "bias": "None",
    "id": "2013569141899157827"
  },
  {
    "user": "@KeithMcCullough",
    "text": "CHINA: in Shanghai, depsite the uniquely American MSM \"news\" flow, stocks closed flat overnight and are +5.7% in the last month",
    "bias": "None",
    "id": "2013568344440422846"
  },
  {
    "user": "@KeithMcCullough",
    "text": "And US Bond Market Volatility was at epic Cycle Lows on Friday, so the setup for a Touristy panic-attack in Bonds was perfect",
    "bias": "None",
    "id": "2013553834639913069"
  },
  {
    "user": "@KeithMcCullough",
    "text": "As a reminder, our Core Position in the Russell 2000 $IWM is coming off an all-time high on Friday \n\nIt was due for a correction",
    "bias": "None",
    "id": "2013553103635697883"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Looks like my \"get out\" of $QQQ move (on green) last week wasn't poorly timed",
    "bias": "None",
    "id": "2013551956954923256"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Today in 1986, Martin Luther King Jr. Day was celebrated as a federal holiday for the first time #USA",
    "bias": "None",
    "id": "2013550223855902811"
  },
  {
    "user": "@KeithMcCullough",
    "text": "How many Macro Tourists tried to waste your long weekend with clickbait about a \"down stock market\"?",
    "bias": "None",
    "id": "2013410941199614381"
  },
  {
    "user": "@KeithMcCullough",
    "text": "I have to pick 30 out of over 3,000 ETFs",
    "bias": "None",
    "id": "2013342382561927504"
  },
  {
    "user": "@KeithMcCullough",
    "text": "What were you buying during political \"news\" panic-attacks for the last 24 plus days? \n\nThis is our longer-term LONGS Investing Ideas product #timestamped",
    "bias": "None",
    "id": "2013295155348906197"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Goldman Sachs projects TSMC’s $TSM annual CoWoS capacity to more than triple between 2025 and 2027, from ~675K wafers to 2.31 million wafers, revised up from 1.74 million wafers. \n\n$NVDA $AMD $AVGO",
    "bias": "None",
    "id": "2013358203283620154"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Inference is projected to be the main driver of this growth, with global demand rising at a 35% CAGR from barely 21 GW to more than 93GW by the end of the decade.\n\n$NVDA $AMD $AVGO",
    "bias": "None",
    "id": "2013314002772775217"
  },
  {
    "user": "@Beth_Kindig",
    "text": "We first touched upon the rising importance of the memory market in AI GPUs in the summer of 2023.\n\nFor our Pro members recently, we circled back to the AI memory boom with a 6,000-word analysis covering surging HBM demand, how inference is creating a secular tailwind for a less-discussed memory product, and more.\n\n$MU $AMD $NVDA \nio-fund.com/premium-services…",
    "bias": "None",
    "id": "2013365956966248690"
  },
  {
    "user": "@RedDogT3",
    "text": "$ONDS helped us today. \nWent green first in a sea of red.",
    "bias": "None",
    "id": "2013642056292323537"
  },
  {
    "user": "@RedDogT3",
    "text": "Kind of cute that $DJT worked today. Posted this Friday. It’s up 6%",
    "bias": "None",
    "id": "2013641302378680729"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 VOLATILE DAY AHEAD: HERE’S WHAT I’M WATCHING\n\n$AAPL has been weak for a while—below short-term moving averages and trading poorly—but could be worth watching as a possible “safety trade” near its 200-day moving average, especially if it puts in an early low.\n\n$GOOGL has been the stronger name structurally, holding key moving averages, but is now testing the 21-day and showing the first signs of relative weakness, raising the question of whether it holds support or plays downside catch-up. \n\n$TSLA remains the weakest of the three, sitting near its lows of the year and below major averages, with no reason to be involved yet unless it stabilizes at those levels.\n\nThe focus today is on staying patient, simplifying decisions on a volatile day, and waiting to see which of these names sets up.",
    "bias": "None",
    "id": "2013613337670451514"
  },
  {
    "user": "@wallstengine",
    "text": "AkademikerPension manages roughly $23–$25 Billion USD. Even if they dumped 100% of their US Treasury holdings, it would barely register. The US Treasury market trades ~$600+ Billion per day.",
    "bias": "None",
    "id": "2013607164229861487"
  },
  {
    "user": "@RedDogT3",
    "text": "Sometimes $aapl likes days like today for cash flow",
    "bias": "None",
    "id": "2013612953937854667"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 THIS IS ONE OF THOSE MARKET DAYS – HERE IS MY PLAN\n\nGet on my insider newsletter list: t3live.com/scott-free-newsle…\n\nThis could be one of those rare, highly volatile days where traders must stay flexible and focus on controlling risk rather than reacting emotionally.\n\nToday multiple scenarios are possible—from an early bounce that offers trading opportunities to a breakdown that could start a multi-week downside sequence.\n\nHave multiple plans, define clear levels ($679 on $SPY and recent lows on $QQQ), and look for relative strength in a sea of red.\n\nTrade smaller, manage hedges, and understanding why you’re in each position as the market decides whether this move is a temporary shock or the start of something bigger.",
    "bias": "None",
    "id": "2013605689139011887"
  },
  {
    "user": "@RedDogT3",
    "text": "$SPX futures are -110 handles, trading down near the Jan 2nd lows with 6820ish as key support this morning.. Question is do we make our lows in the first 30–60–90 minutes and bounce, or do we get a real trend-down day.",
    "bias": "None",
    "id": "2013596025626230896"
  },
  {
    "user": "@RedDogT3",
    "text": "Scott Redler’s #630⏰ Scott Redler’s #630club - LIVE Premarket Stock Update $NVDA $TSLA $IBIT $SPY  ➡️ Get my #1 charting tool FREE: t3live.com/tsdealclub - LIVE Premarket Stock Update nitter.net/i/broadcasts/1ZkKzZbOB…",
    "bias": "None",
    "id": "2013575269580149236"
  },
  {
    "user": "@wallstengine",
    "text": "US Tsy Sec. Bessent Urges countries to stick with their trade deals and not escalate against the US:\n\n\"SIT BACK, TAKE A DEEP BREATH, AND LET THINGS PLAY OUT.\"",
    "bias": "None",
    "id": "2013544079980953890"
  }
]