[
  {
    "user": "@StockSavvyShay",
    "text": "We're live right now talking about our 2026 predictions \n\npiped.video/live/7LDAI1KUpw4…",
    "bias": "None",
    "id": "2003490804052967785"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Health care was the single largest driver of Q3 consumption growth.\n\nTwo names to watch:\n\n• $HIMS as the cash-pay healthcare layer benefiting from rising spend & demand for direct access outside the insurance system.\n• $OSCR as the digital insurer positioned to gain share in the ACA market as health care proves more resilient than discretionary spend.",
    "bias": "None",
    "id": "2003480726856171868"
  },
  {
    "user": "@StockSavvyShay",
    "text": "2026 Market Predictions | Live Q&A\n\nWanted to let you all know that Daniel and I will be livestreaming on the Futurum Equities YouTube channel with a special 2026 Market Predictions show where we’ll talk through what we expect to happen in the markets next year.\n\nWe’ll start streaming at 10:30 AM ET. We do a live Q&A during the last 5–10 minutes of each episode, so come with questions!",
    "bias": "None",
    "id": "2003477762166915553"
  },
  {
    "user": "@StockSavvyShay",
    "text": "This GDP print is huge for $AMZN. \n\nConsumption-driven growth lowers downside risk for Amazon by keeping retail and advertising demand steady while AWS continues to invest heavily in AI.",
    "bias": "None",
    "id": "2003475555308699661"
  },
  {
    "user": "@StockSavvyShay",
    "text": "U.S. SAYS TARIFFS ON CHINA-MADE SEMICONDUCTORS WILL STAY AT 0% THROUGH JUNE 2027",
    "bias": "None",
    "id": "2003468011513262325"
  },
  {
    "user": "@StockSavvyShay",
    "text": "So Singapore wasn’t actually the world’s biggest AI buyer of $NVDA chips after all.\n\nWho could’ve guessed.",
    "bias": "None",
    "id": "2003465586974888136"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$CIFR acquired a 200 MW Ohio site called Ulysses with secured power and PJM access which marks its first expansion outside Texas.\n\nThis positions Cipher as a landlord in the AI Utility era by owning power and sites others will rent.",
    "bias": "None",
    "id": "2003461732384354684"
  },
  {
    "user": "@StockSavvyShay",
    "text": "This image shows the top 10 AI chatbot and tool websites in the U.S. for November.",
    "bias": "None",
    "id": "2003450145879523791"
  },
  {
    "user": "@StockSavvyShay",
    "text": "ChatGPT still dominates usage but Gemini is the only platform showing meaningful share gains.\n\n$GOOGL distribution advantage is starting to show up in traffic.",
    "bias": "None",
    "id": "2003449542029824077"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NVDA is partnering with SK Hynix & Phison on a new “AI SSD” (Storage Next) built to sit between DRAM/HBM & traditional storage. \n\nThe goal is to keep GPUs fed as inference becomes a memory bottleneck with a prototype targeted for 2026.",
    "bias": "None",
    "id": "2003437754802405725"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN ad business now generates ~$177M per day.\n\nIt’s the only platform that monetizes users when they’re already buying.",
    "bias": "None",
    "id": "2003100541799551158"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NVO said the FDA approved the first oral GLP-1 pill for weight management in the U.S. with trial data showing ~16.6% mean weight loss with adherence.\n\nThe company expects a U.S. launch in early 2026.",
    "bias": "None",
    "id": "2003241191471743287"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN profit engine is AWS and its growth engine is advertising and together they’re now generating ~$50B per quarter.\n\nAs those high-margin businesses grow as a share of revenue and retail efficiency improves through automation, Amazon is set up to be a Mag 7 leader in 2026.",
    "bias": "None",
    "id": "2003218393286197539"
  },
  {
    "user": "@StockSavvyShay",
    "text": "The fact this isn’t priced at zero is alarming.\n\nIf it ever happens then China wins the AI arms race by default.",
    "bias": "None",
    "id": "2003213344468320510"
  },
  {
    "user": "@AdamSingolda",
    "text": "Thanks for having me ! This was a lot of fun talking AI, how i believe @OpenAI is the best thing that happen to Google search “being at risk”, how Gemini will make @google the first $10 trillion dollar company, and how AI and projects like DeeperDive can grow revenue in the open web beyond what “traditional ads” ever did. Future is bright ☀️ LG….cc @DivesTech @RiskReversal @taboola",
    "bias": "None",
    "id": "2003469183397298341"
  },
  {
    "user": "@RiskReversal",
    "text": "Watch or listen here🔗\n\nYouTube: piped.video/YNq9Q39dcTE\nApple: apple.co/49pb83j\nSpotify: tinyurl.com/5x43s4wn",
    "bias": "None",
    "id": "2003462181833310365"
  },
  {
    "user": "@RiskReversal",
    "text": "New pod out this morning with tech investing/fashion legend @DivesTech + a conversation with @taboola Founder & CEO @AdamSingolda on AI's impact on content algos and advertising🎙️",
    "bias": "None",
    "id": "2003462179706798198"
  },
  {
    "user": "@RiskReversal",
    "text": "Watch or listen here!\n\nYouTube: piped.video/ofcELu_4joo\nApple: apple.co/3Yaei4J\nSpotify: tinyurl.com/bddkwr83",
    "bias": "None",
    "id": "2003147269923913870"
  },
  {
    "user": "@jonnajarian",
    "text": "6⃣0⃣Seconds $NVO $ABL $SGML $RKLB $FJET $LUNR $ASTS Rebel's Edge 1pm 🏴‍☠️",
    "bias": "None",
    "id": "2003444456465584542"
  },
  {
    "user": "@jonnajarian",
    "text": "Adam, she has proved to be authentically a liar and a person of low IQ @adamcarolla",
    "bias": "None",
    "id": "2003463604008538236"
  },
  {
    "user": "@jonnajarian",
    "text": "And when you consider that her preferred candidate picked a VP that is now embroiled in a $20B theft of public funds in Minnesota, one has to wonder how badly she has tarnished her legacy",
    "bias": "None",
    "id": "2003462554845409286"
  },
  {
    "user": "@jonnajarian",
    "text": "Congratulations to Kansei \"Tokyo Toe\" Matsuzawa, a consensus All-American (U of Hawaii at Mānoa, first ever player to receive the title)",
    "bias": "None",
    "id": "2003460770194161849"
  },
  {
    "user": "@jonnajarian",
    "text": "God bless Paul Brittain, owner of Brittain's Tree and Crane Service in North Carolina. He also fixed her car, her roof and her HVAC as well as raised over $20K to help her get back on her feet. Amazing kindness!",
    "bias": "None",
    "id": "2003459283166617900"
  },
  {
    "user": "@jonnajarian",
    "text": "Also known as the Corporal Maxwell Q. Klinger Memorial Marriott",
    "bias": "None",
    "id": "2003437337489879459"
  },
  {
    "user": "@MarketRebels",
    "text": "#VIX 14.08 #10Year 4.16% Good Day Traders.. ⛅️",
    "bias": "Panic / Capitulation",
    "id": "2003425812419359070"
  },
  {
    "user": "@jonnajarian",
    "text": "Coffee ☕️ and Najarian Sports 🏈 with @petenajarian more on Rebel’s Edge today 1pm 🕐",
    "bias": "None",
    "id": "2003426913587724518"
  },
  {
    "user": "@jonnajarian",
    "text": "How it feels when you make 20X on your option trade while someone on tv thinks a 6% return is \"killing it\"!",
    "bias": "None",
    "id": "2003421973188055336"
  },
  {
    "user": "@jonnajarian",
    "text": "Vince Zampella died when he lost control of his 2026 Ferrari 296 GTS around 12:45 p.m. on Angeles Crest Highway in the San Gabriel Mountains north of Los Angeles. Zampella, aged 55 died at the scene, a passenger was ejected and later died at the hospital",
    "bias": "None",
    "id": "2003418443844899002"
  },
  {
    "user": "@jonnajarian",
    "text": "The future is here!",
    "bias": "None",
    "id": "2003242881843368389"
  },
  {
    "user": "@biancoresearch",
    "text": "If this is too expensive, there is a Jets game this weekend :)",
    "bias": "None",
    "id": "2003451723462189409"
  },
  {
    "user": "@biancoresearch",
    "text": "July 19\nMetLife Stadium\nEast Rutherford, New Jersey\n\nMight be the most expensive tickets ever sold in North America.",
    "bias": "None",
    "id": "2003445075842650487"
  },
  {
    "user": "@ToryAggeler",
    "text": "The white metals sure love Quad 1! Here are the quarterly averages in Hedgeye Quad 1’s over 25 years. At this point, these moves are to be expected! And it’s time for a ratio trade. I’ll reach out to see if interested.",
    "bias": "None",
    "id": "2003467729756651914"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Best ETFs yesterday acryoss ~3,000 ETFs?\n\n• Platinum $PPLT +6.7%\n• Lithium $LITP +5.8%\n• Space $UFO +5.1%\n• Gold Miners $GDMN +5%\n\nHedgeye Fam's Portfolio Solutions: 4 for 4.\n\nMetals aren’t a trade — they’re leadership.",
    "bias": "None",
    "id": "2003463970682994950"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Got the most disciplined investors on your team? We do. \n\n“A Disciplined mind leads to happiness, and an undisciplined mind leads to suffering.” – Dalai Lama",
    "bias": "None",
    "id": "2003462810253279341"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Most people don't have the modern resources to educate themselves on these critical questions \n\nThat's why I made my new book FREE! (Master The Market). You can also learn plenty for FREE @Hedgeye University \n\nIt's core curriculum for many new analysts on Wall Street",
    "bias": "None",
    "id": "2003452964644749569"
  },
  {
    "user": "@KeithMcCullough",
    "text": "What's Jonesy's fav holiday cocktail? @HedgeyeDJ \n\nIf you follow me on my insta @mucker11 you'll be in the know",
    "bias": "None",
    "id": "2003448787348631630"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Since I’ve sometimes had 30-40% of my portfolio in metals after buying dips , I think I can handle selling 50-100bps on some rips!",
    "bias": "None",
    "id": "2003444284494950663"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Thanks 🙏 for being such a loyal member of our community for such a long time",
    "bias": "None",
    "id": "2003443741856874684"
  },
  {
    "user": "@KeithMcCullough",
    "text": "If I sell-SOME it’s 50bps and at the New top end of Risk Range - never reduce core positions below your predetermined MIN size in a bull market 📈 and always buy more (patiently) on the dips",
    "bias": "None",
    "id": "2003443537694851099"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Poor Hedgeye Hater was hoping our ETF blew up lol 😂",
    "bias": "None",
    "id": "2003441860153688196"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The #1 Asset Allocation you should have built into #Quad1 Goldilocks vs. Down Dollar = Long Gold $GLD $AAAU",
    "bias": "None",
    "id": "2003408239757808074"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Right on #Quad1 Cycle time, our US Dollar Short position is getting smoked vs. bullish breakouts in EUR, GPB, CAD, etc.",
    "bias": "FOMO",
    "id": "2003407591297208383"
  },
  {
    "user": "@thE_dEwd87",
    "text": "A great day for Hedgeye Nation.",
    "bias": "None",
    "id": "2003273049668300927"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Google $GOOG is acquiring data center and energy infrastructure startup Intersect for $4.75B, with the deal expected to close in 1H '26.\n\nIntersect's operations will remain separate from Google, and the acquisition will help bring data center generation capacity online faster.",
    "bias": "None",
    "id": "2003223172573991268"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Alibaba $BABA is said to be considering purchasing between 40,000 to 50,000 of AMD's $AMD MI308 GPUs, as reports suggest its China-compliant GPU is nearing a commercial rollout.",
    "bias": "None",
    "id": "2003192214147727784"
  },
  {
    "user": "@Beth_Kindig",
    "text": "The GPU as a service market is projected to rise more than 8X over the next decade, from ~$30 billion in 2025 to $251 billion by 2034.\n\n$NVDA $CRWV $NBIS $IREN",
    "bias": "None",
    "id": "2003132603235492313"
  },
  {
    "user": "@RedDogT3",
    "text": "$qqq held $617 area to show some commitment to this “Santa” type move",
    "bias": "None",
    "id": "2003493519483371623"
  },
  {
    "user": "@Krobusek",
    "text": "OK worked as posted we see sup show good tails SPY QQQ IWM VIX has cof the rev trailing to be safe! You knew BTFD Herd would show Giddy UP Scott Dawgs! Are you having FUN YET!",
    "bias": "Panic / Capitulation",
    "id": "2003489718806401120"
  },
  {
    "user": "@RedDogT3",
    "text": "Power Plays is where I tell you what to do. Make sure you’re in for 2026.\n\nUse the links below for 👇\n\n🔴Power Plays Stocks: t3live.com/power\n🔴Power Plays Options: t3live.com/ppo",
    "bias": "None",
    "id": "2003467451481395367"
  },
  {
    "user": "@RedDogT3",
    "text": "$ASTS launch is tonight",
    "bias": "None",
    "id": "2003466290594562371"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 HOW TO TRADE $TSLA DURING CHRISTMAS WEEK\n\n⚡️Come trade $TSLA with me for free this week: t3live.com/at-trial\n\nThere are some concerns that #Tesla may have put in a short-term top.\n\n#TSLA still remains above its 8-day moving average, keeping the broader trend intact, but losing momentum makes upside harder in the near term.\n\nStay above key short-term levels, and it’s still constructive; lose them, and it becomes a trim-and-manage situation, not an all-in bet—especially during thin, holiday trading where follow-through is harder to find.",
    "bias": "None",
    "id": "2003463998985916538"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 DON’T CHASE THIS HOLIDAY RALLY\n$SPX $QQQ $IWM\n\nThe market is in a quiet holiday grind higher, not a time to force trades.\n\nManage what you have, keep stops tight, take easy gains when they’re there, and don’t chase extended moves—especially in gold $GLD and silver $SLV, where the money has already been made.",
    "bias": "None",
    "id": "2003460733665710464"
  },
  {
    "user": "@wallstengine",
    "text": "US 3Q GDP RISES ANNUALIZED 4.3% Q/Q; EST. +3.3%\n\nUS 3Q PERSONAL CONSUMPTION RISES ANNUALIZED 3.5% Q/Q",
    "bias": "None",
    "id": "2003458235685298252"
  },
  {
    "user": "@RedDogT3",
    "text": "Global markets are mixed, but there haven’t been any curveballs as the Santa Claus Rally kicked off last Thursday — $SPX pushed through 6758 to tag 6882, now we’ll see how much that momentum cools off.",
    "bias": "None",
    "id": "2003449524933795875"
  },
  {
    "user": "@RedDogT3",
    "text": "⏰ Scott Redler’s #630club - LIVE Premarket Stock Update $NVDA $TSLA $IBIT $SPY  ➡️ Join the Alpha Team VTF® for FREE t3live.com/at-trial nitter.net/i/broadcasts/1OyJAjePD…",
    "bias": "None",
    "id": "2003428493728886994"
  },
  {
    "user": "@wallstengine",
    "text": "Novo Nordisk $NVO says the FDA approved the once daily Wegovy pill (oral semaglutide 25 mg), the first oral GLP 1 for weight management in the US. In the OASIS 4 trial, mean weight loss was 16.6% with adherence. \n\nThe company expects a US launch in early Jan 2026.",
    "bias": "None",
    "id": "2003240378242335096"
  },
  {
    "user": "@wallstengine",
    "text": "Today's Key Events (All EST) — 12/23/2025\n\n08:30: US Q3 GDP QoQ Advance\n08:30: US Oct. Durable Goods\n09:15: US Oct/Nov Industrial Production\n10:00: US CB Dec. Consumer Confidence\n10:00: Richmond Fed Comp. Index\n13:00: US 5-Year Note Auction",
    "bias": "None",
    "id": "2003384108718915809"
  },
  {
    "user": "@UnicusResearch",
    "text": "🚨We received multiple interest/questions regarding our newsletter and whether we’re offering discount this season.\n\nAs we expand coverage and bring on senior industry contributors, subscription pricing for Confidential Insights will increase in 2026. \n\nCurrent (discounted) pricing is available through Dec 25.\n\nDetails below:",
    "bias": "None",
    "id": "2003199383639069115"
  },
  {
    "user": "@leadlagreport",
    "text": "$SMYY: What the Blackwell-Chip Cluster Means for 2026 Server Wars via @graniteshares \nopen.substack.com/pub/granit…",
    "bias": "None",
    "id": "2003171744484581741"
  },
  {
    "user": "@leadlagreport",
    "text": "Preparing for 2026: How to Position Portfolios for Rate Cuts, Policy Shifts, and Macro Risks via @DynamicAlphaSol \nopen.substack.com/pub/dynami…",
    "bias": "None",
    "id": "2003170107883946365"
  },
  {
    "user": "@JohnTinsman",
    "text": "AOT Software Platform ETF Expected to Launch December 23rd, 2025 $AOTS\n\nSoftware platforms provide the foundation or infrastructure upon which software applications can be built and run. From an investment standpoint, software platforms offer the potential for many strategic business advantages including: \n\n•Low marginal cost - Software platforms are scalable businesses that support high margins and revenue growth at scale with virtually no marginal costs or the need for debt financing. \n\n•Competitive moats - Low incremental sales costs means more revenue can be used to innovate, build new products, and provide increased utility to customers, creating the potential for a sustainable competitive advantage.\n\n•Recurring revenue models - Most software platforms operate under subscription-based models (SaaS), generating recurring revenues with high customer retention.  The SaaS model is also tariff-resistant. \n\n•AI and innovation tailwinds - Artificial intelligence and applications such as generative AI are creating new opportunities for software companies, as investor focus shifts from hardware infrastructure to software applications. \n\nOne of the critical strategic advantages for software platforms is scalability. While the marginal cost of traditional goods increases with production due to resource constraints, the marginal cost of digital goods trends to zero as production scales.  As a result, investing in software platforms creates an attractive  opportunity for investors. \n\nInvestors will soon be able to invest in this thematic, cross sector opportunity through the AOT Software Platform ETF, expected to launch on the New York Stock Exchange on December 23rd, 2025. Stay tuned for more information!\n\nETFAC-5037726-12/25\n \nThe registration statement for the Fund has been declared effective by the U.S. Securities and Exchange Commission (“SEC”). However, the Funds have not yet commenced operations. Shares of the Funds are expected to begin trading on or about December 23, 2025, subject to market conditions.\n\nInvesting involves risk.  Principal loss is possible. \n\nInvestors should consider the investment objectives, risks, charges and expenses before investing.  For a prospectus with this and other information about the Funds Click Here or please call +1.563.320.1688.    Read it carefully before investing.\nsec.gov/Archives/edgar/data/…",
    "bias": "None",
    "id": "2003128529483956259"
  },
  {
    "user": "@leadlagreport",
    "text": "Wait so Gold and Silver are sending a warning and I’ve been right this whole time that we’re fucked.",
    "bias": "None",
    "id": "2003100163615936722"
  },
  {
    "user": "@leadlagreport",
    "text": "I just found out that it was never in the script for Jimmy Stewart to cry in this scene.\n\nHe was never told to cry, nor was it ever mentioned beforehand.\n\nHe was overcome in the moment.",
    "bias": "None",
    "id": "2003084238456062224"
  },
  {
    "user": "@leadlagreport",
    "text": "Be not afraid.\n\nI’m going to annoy the fuck out of you and your whole lineage soon enough.",
    "bias": "None",
    "id": "2002922366267953156"
  }
]