[
  {
    "user": "@LizAnnSonders",
    "text": "August ISM Manufacturing ticked up to 48.7 vs. 49 est. & 48 prior … new orders back in expansion, up to 51.4 vs. 47.1 prior; prices paid down to 63.7 vs. 64.8 prior; employment up to 43.8 vs. 43.4 prior",
    "bias": "None",
    "id": "1962879103423414516"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Sepetember is historically worst performing month for S&P 500…since 1928, index was down an average of >1%, posting gains only 44% of time",
    "bias": "None",
    "id": "1962844962518683708"
  },
  {
    "user": "@LizAnnSonders",
    "text": "This week’s data dump",
    "bias": "None",
    "id": "1962844751662604789"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Performance: sectors/indexes Friday and MTD/YTD",
    "bias": "None",
    "id": "1962844507159814544"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Performance: index tables and Mag7 chart/table updated thru Friday’s close",
    "bias": "None",
    "id": "1962840852968948102"
  },
  {
    "user": "@LizAnnSonders",
    "text": "As a share of total import value, imports from China account for most tariff revenue right now per PIIE",
    "bias": "Contrarian",
    "id": "1962838477445156918"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Thru July, in year/year terms, both headline (blue) and core (orange) PCE Price Indexes have been >2% for 53 consecutive months",
    "bias": "None",
    "id": "1962838299698979115"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Price for a pound of ground coffee in U.S. has shot up considerably over past couple years ... from $6.31 in July 2024 to $8.41 to June 2025 \n⁦@stlouisfed⁩ ⁦@BLS_gov⁩ ⁦@DataArbor⁩",
    "bias": "None",
    "id": "1962838171768504709"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Chicago PMI fell sharply in August to 41.5 … index has been below 50 since November 2023",
    "bias": "None",
    "id": "1962837987617562908"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Inflation-adjusted personal income excluding government transfer payments increased in July and is close to an all-time high … growth since pre-pandemic peak has been relatively strong at +1.8% annualized",
    "bias": "Euphoria / Greed",
    "id": "1962837850631672252"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Of everything being imported, U.S. is collecting most tariff revenue from consumer goods (when looking at % of monthly total import value) per ⁦@PIIE⁩",
    "bias": "Contrarian",
    "id": "1962837731387519134"
  },
  {
    "user": "@LizAnnSonders",
    "text": "U.S. savings rate unchanged at 4.4% in July … mostly in line with average seen over the past couple years",
    "bias": "None",
    "id": "1962837518564348191"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Towards end of August, California had highest average cost of regular unleaded gasoline at $4.59 ... Hawaii ($4.48) followed, then Washington state ($4.40) per ⁦⁦@AAAnews⁩ ⁦@DataArbor⁩",
    "bias": "Herd / Bandwagon",
    "id": "1962836965218205869"
  },
  {
    "user": "@LizAnnSonders",
    "text": "As of August, % of consumers expecting unemployment to rise in coming year increased to 63% per ⁦@UMich⁩ … getting closer to cycle high",
    "bias": "Euphoria / Greed",
    "id": "1962836742081228944"
  },
  {
    "user": "@LizAnnSonders",
    "text": "Goods deficit widened to $103.6B in July … up from $84.9B in prior month",
    "bias": "None",
    "id": "1962836638905581726"
  },
  {
    "user": "@elerianm",
    "text": "This isn't just about an attempt to portray a united front -- China, India, and Russia -- that offer an alternative to the US/Western-led global economic order.\nThe series of bilateral discussions that took place included both China and India reinforcing their commitment to buying oil from Russia -- doubling down on what is already a source of tension with the US and Europe.\n#Geopolitics #GlobalEconomy #BRICS #oil #China #India #Russia #economy #markets",
    "bias": "None",
    "id": "1962839215999176936"
  },
  {
    "user": "@elerianm",
    "text": "Posted yesterday:\nPlease find below the link to my column in the Financial Times on what to make of last Friday's appeals court ruling on US tariffs:\nft.com/content/81be473e-7270…\n#economy #markets #tariffs #trade @ft",
    "bias": "Recency Bias",
    "id": "1962832162605932774"
  },
  {
    "user": "@elerianm",
    "text": "The court case involving Federal Reserve Governor Lisa Cook's lawsuit is scheduled to be back on today, with Cook suing the government for attempted dismissal (with the Fed and Chair Jerome Powell named as co-defendants).\nOver the weekend, Secretary Scott Bessent weighed in, stating that he was \"very surprised that the Fed has not done an independent review\" into the allegations against Governor Cook.\nThis adds to the sense that this is a significant moment for Fed independence.\n#economy #federalreserve #centralbanks #markets",
    "bias": "Herd / Bandwagon",
    "id": "1962830995859677238"
  },
  {
    "user": "@elerianm",
    "text": "The price of gold hit an all-time high this morning.\n\n#economy #markets #gold #investing #investors",
    "bias": "Euphoria / Greed",
    "id": "1962815380839121095"
  },
  {
    "user": "@elerianm",
    "text": "Good morning.\nYields on longer-dated government bonds in advanced countries continue to rise, with the UK notably experiencing this alongside a weaker currency—similar to what is more usual for developing countries.\nThe yield on British 30-year gilts has been trading at its highest level since 1998 this morning, while the pound has fallen nearly 1% against the dollar.\nAt 5.69%, this yield has increased 35 basis points over the past 30 days and by more than 100 basis points in the past year (see charts below), highlighting an already difficult fiscal and growth outlook.\n(The 10-year yield, also higher, is currently trading at 4.79%.)\n#economy #markets #bonds #yields #uk #budget #debt #growth",
    "bias": "Recency Bias",
    "id": "1962808483989872678"
  },
  {
    "user": "@elerianm",
    "text": "From the @FT:\n\"Gold and silver prices scaled record highs at auctions on Monday, bolstered by a sinking dollar and expectations of a US interest rate cut this month. \nA gold price of $3,475 per troy ounce was set at the afternoon auction of the London Bullion Market Association, a benchmark for the major bullion trading banks, surpassing a previous high of $3,454 on April 22.\nOn the spot market, gold reached a four-month high of $3,489 per troy ounce in intraday trading, just $11 shy of its all-time high.\"\n#gold #silver #economy #markets #investing #Investors",
    "bias": "Euphoria / Greed",
    "id": "1962556035509481920"
  },
  {
    "user": "@ftopinion",
    "text": "The real significance of the US court ruling on tariffs  — Mohamed El-Erian on.ft.com/3JKovRf",
    "bias": "None",
    "id": "1962516470513983626"
  },
  {
    "user": "@elerianm",
    "text": "Please find below the link to my latest column in the Financial Times on what to make of last Friday's appeals court ruling on US tariffs:\nft.com/content/81be473e-7270…\n#economy @FT #tariffs #trade #markets",
    "bias": "Recency Bias",
    "id": "1962520630873432456"
  },
  {
    "user": "@elerianm",
    "text": "From the article in @TheEconomist, \"Fear the deficit-populism doom loop: Politicians, particularly in Europe, are in a terrible bind.\"\n#economy #deficit #debt #markets",
    "bias": "Panic / Capitulation",
    "id": "1962510829703561254"
  },
  {
    "user": "@RayDalio",
    "text": "Worrying about \"blame\" and \"credit\" or \"positive\" and \"negative\" feedback impedes the iterative process that is essential to learning. Remember that what has already happened lies in the past and no longer matters except as a lesson for the future. The need for phony praise needs to be unlearned. #principleoftheday",
    "bias": "None",
    "id": "1962867763636039921"
  },
  {
    "user": "@barronsonline",
    "text": "Air Lease Is Going Private. Why Boeing Stock Is Up. trib.al/wlyiYgW",
    "bias": "None",
    "id": "1962903622808698910"
  },
  {
    "user": "@barronsonline",
    "text": "Cytokinetics Stock Jumps. The Biotech’s Heart Drug Wows. trib.al/YOr4IVe",
    "bias": "None",
    "id": "1962895727161381289"
  },
  {
    "user": "@barronsonline",
    "text": "Signet Jewelers Stock Gains on Earnings Surprise. Management Is Upbeat. trib.al/Xl8wtut",
    "bias": "None",
    "id": "1962881002038087793"
  },
  {
    "user": "@barronsonline",
    "text": "Firefly’s Initial Wall Street Ratings Highlight Hope, and Uncertainty trib.al/AjrVZRN",
    "bias": "Euphoria / Greed",
    "id": "1962877580324856127"
  },
  {
    "user": "@barronsonline",
    "text": "Klarna Aims to Raise $1.27 Billion Ahead of Trading Debut. Fintech Targets $14 Billion Valuation. trib.al/60Wag8u",
    "bias": "Confirmation Bias",
    "id": "1962875264184058256"
  },
  {
    "user": "@barronsonline",
    "text": "Constellation Brands Stock Slumps. Why It Slashed Guidance. trib.al/PMjjSWB",
    "bias": "None",
    "id": "1962870775095992591"
  },
  {
    "user": "@barronsonline",
    "text": "Trump Administration Looking to Sell 5% of Fannie Mae and Freddie Mac, Pulte Says trib.al/n8zEP2f",
    "bias": "None",
    "id": "1962869661445312657"
  },
  {
    "user": "@barronsonline",
    "text": "Alibaba Stock Gets a Boost. Wall Street Sees an AI Winner. trib.al/MKC2eCF",
    "bias": "None",
    "id": "1962862841670545920"
  },
  {
    "user": "@barronsonline",
    "text": "Tesla Stock Falls. Musk Now Has India to Worry About. trib.al/G8OUoid",
    "bias": "None",
    "id": "1962856109246431741"
  },
  {
    "user": "@barronsonline",
    "text": "PepsiCo Stock Jumps on Report Elliott Management Is Taking a $4 Billion Stake trib.al/x5aVAgM",
    "bias": "Euphoria / Greed",
    "id": "1962849269389365355"
  },
  {
    "user": "@barronsonline",
    "text": "Tariff Ruling Cements Fed Rate Cut Bets but Stokes Uncertainty in Stocks trib.al/pJfImjh",
    "bias": "None",
    "id": "1962843608194691456"
  },
  {
    "user": "@barronsonline",
    "text": "Why Trump Tariffs, Fed Fights Could Make This September Worse Than Usual for Stocks trib.al/eMlcJlb",
    "bias": "None",
    "id": "1962835678879732215"
  },
  {
    "user": "@barronsonline",
    "text": "Kraft Heinz Is Splitting Into Two. Food Breakups Are in Fashion. trib.al/PK5qyDD",
    "bias": "None",
    "id": "1962834554709766510"
  },
  {
    "user": "@barronsonline",
    "text": "Gold Just Hit a Record High. These Mining Stocks Are Glistening, Too. trib.al/NNn6kpS",
    "bias": "Euphoria / Greed",
    "id": "1962827737745305782"
  },
  {
    "user": "@barronsonline",
    "text": "NIO Posts Second-Quarter Loss. The Stock Is Rising Anyway. trib.al/DhgAxBw",
    "bias": "None",
    "id": "1962825491812859942"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Stock Falls. Why the Post-Earnings Slump Is Rolling On. trib.al/YcnqlT4",
    "bias": "None",
    "id": "1962822085731835922"
  },
  {
    "user": "@barronsonline",
    "text": "Bitcoin Rises, Ether and XRP Struggle. This Can Spark the Next Crypto Rally. trib.al/jzXE8l7",
    "bias": "FOMO",
    "id": "1962806250665611369"
  },
  {
    "user": "@barronsonline",
    "text": "These Stocks Are Moving the Most Today: Nvidia, Biogen, NIO, Spirit Aviation, and More trib.al/iyl5vVd",
    "bias": "None",
    "id": "1962801682590343276"
  },
  {
    "user": "@barronsonline",
    "text": "Aggressive investors can play both sides of the Fed’s decision on interest rates in September by considering put and call spreads on the iShares Russell 2000 exchange-traded fund.",
    "bias": "Herd / Bandwagon",
    "id": "1962666817010139617"
  },
  {
    "user": "@barronsonline",
    "text": "New companies are collecting any kind of business and consumer economic activity they can get their hands on and selling it to hedge funds and other investors.",
    "bias": "Herd / Bandwagon",
    "id": "1962636616104656928"
  },
  {
    "user": "@DamiaOthman",
    "text": "$MDB total number of customers reached over 59,900 as of 31 July 2025, adding 2,800 customers during Q2 FY 2026.\n\nAtlas added over 5,000 customers YTD, the strongest first-half performance ever, bringing its customer base to 58,300 by Q2 FY 2026.",
    "bias": "None",
    "id": "1962847474013651322"
  },
  {
    "user": "@AswathDamodaran",
    "text": "Coming after another strong month for stocks, with all three indices hitting new heights, the equity risk premium for the S&P 500 at the start of September 2025 drops below 4%. Stocks are undoubtedly richly priced, but whether they are in a bubble is your call to make. Webpage: damodaran.com.",
    "bias": "Euphoria / Greed",
    "id": "1962754863496122467"
  },
  {
    "user": "@balajis",
    "text": "DECOUPLING FROM DOLLARS\nThe US sends India billions in printed dollars for valuable goods. This is actually the US government ripping off India, like it does Vietnam, and everyone else, including its own citizens...not vice versa.\n\nTo be precise: last year India exported $87B of valuable goods to the US for $42B of goods plus $45B worth of increasingly worthless dollars:\n\nThat difference of $45B was, effectively, made up by money printing, which the Fed does at will:\n\nThe current administration incorrectly thinks this is a bad deal for America, because they haven’t fully thought through the fact that the US can print dollars. India was giving America something that's always valuable (namely goods) for something that America can just print out of thin air (namely US dollars):\n\nSo...who was really ripping off whom?\n\nAs mentioned, this is the same trade America had with Vietnam. Vietnam worked hard to send America shoes, while America sent Vietnam printed dollars. And it’s the same trade America had with many countries, before the trade war. The world sends the US valuable goods, and gets mere Federal Reserve database entries in return:\n\nThe only reason the US had the right to do that — to run the financial database of the world, to print trillions for itself, and to freeze and seize the funds of billions — is because it set up what we call the rules-based order, what is in reality the American Empire. And of course it profited from that empire tremendously, but so did most of the empire's participants.\n\nBut now MAGA is dismantling that empire. It’s cutting off trade, talent, and even tourism. It’s abandoning its military commitments and telling allies to fend for themselves. It’s cutting off foreign aid and domestic universities. It is, in short, becoming a country not an empire.\n\nThe reason is because MAGA is fundamentally confused. It romanticizes 1945 America (the manufacturing country) without fully admitting that 2025 America makes its money in a completely different way, by managing the hub of a global financial empire.\n\nBecause the US is in denial about what it is — a money printer, not a manufacturer — it's currently on track to lose both the money-printing and the manufacturing. For example, the tariffs target the entire world (thereby reducing demand for the dollar in global trade) while also cutting off machine tools and raw materials from US entrepreneurs (thereby inhibiting the buildout of domestic manufacturing).\n\nAnyway, I won't linger on the outlook for the US. It's made its decision and will live with it. Perhaps it will indeed be a Golden Age of Reindustrialization. And perhaps the transition to a \"republic, not an empire\" will go much better than the similar imperial climbdown of the UK or the USSR.\n\nWhat should countries like India and Vietnam do?\n\nThey should turn a necessity into a virtue. The trade war has provided a powerful Schelling Point for the entire world to simultaneously stop using the dollar at the same time. This is also what America says it wants, for foreigners to stop \"exploiting\" it by accepting its printed dollars for hard goods.\n\nSo: abide by America's wishes and stop trading goods with America for dollars. Instead, trade goods with each other for local currencies (rather than USDs) and use gold for storing value (rather than USTs). Because there is no global reserve currency issued by a single country, trade remains roughly balanced over time.\n\nSingapore's former PM calls this \"world minus one.\" It's the continuation of global capitalism, just without America, who has voluntarily taken itself out of the game. Yes, there's a short-term adaptation cost, but the quicker that a country can decouple from the dollar the better.\n\nStart saving in hard money instead.",
    "bias": "FOMO",
    "id": "1962618982692966850"
  },
  {
    "user": "@balajis",
    "text": "Bukele Kuan Yew.\nOrdered liberty.\n\nThe juvenile libertarian thinks freedom is about anti-social activity. The mature pragmatist understands that a virtuous, self-disciplined society actually maximizes practical freedom.",
    "bias": "Herd / Bandwagon",
    "id": "1962567484181233915"
  },
  {
    "user": "@balajis",
    "text": "But why are gold prices rising? Because BRICS is stacking gold bricks, and the Russian sanctions eroded the store-of-value function of the dollar.\n\nAnd why did the Fed hike rates and devalue Treasuries? Because inflation was eroding the purchasing power of the dollar.",
    "bias": "Contrarian",
    "id": "1962519735834411150"
  },
  {
    "user": "@balajis",
    "text": "Or the dollar almost halving.\n\nThe true rate of inflation is the rate at which the smart money is exiting the US dollar for hard money.",
    "bias": "None",
    "id": "1962467581866230038"
  },
  {
    "user": "@balajis",
    "text": "It is a huge deal, because in 1950 America made things while in 2025 it only prints things.\n\nSpecifically, the only two globally competitive exports of the US are (a) the dollar and (b) tech.\n\nAnd tariffs, sanctions, trade war, and printing are eroding the dollar.",
    "bias": "None",
    "id": "1962466874173829278"
  },
  {
    "user": "@balajis",
    "text": "Recall the Fed admitted that a “small number” of countries were switching to gold.\n\nBut that small number actually included Russia, India, and China: the RIC of BRICS.",
    "bias": "Herd / Bandwagon",
    "id": "1962448779854135357"
  },
  {
    "user": "@balajis",
    "text": "Digital gold is becoming the reserve currency of the individual.\n\nGold is returning as the reserve currency of the state.\n\nOriginal post below.",
    "bias": "None",
    "id": "1962446917792874606"
  },
  {
    "user": "@balajis",
    "text": "The dollar is losing reserve currency status. It’s down to 42% of global reserves, and gold is rapidly rising.",
    "bias": "None",
    "id": "1962446223627178394"
  },
  {
    "user": "@elonmusk",
    "text": "Demographics are destiny",
    "bias": "None",
    "id": "1962892837009359303"
  },
  {
    "user": "@RupertLowe10",
    "text": "As someone who had four armed police raid my home late on a Friday evening, I can safely say it was not a very pleasant experience.\n\nWe do not have many armed officers. Why don't we deploy them to combat dangerous criminals?  Rather than for social media posts?\n\nJust a thought!",
    "bias": "FOMO",
    "id": "1962895359471939984"
  },
  {
    "user": "@elonmusk",
    "text": "The Rape of Britain. \n\nRemember to drop a white feather for the cowards who failed to stop this. \n\n🪶",
    "bias": "FOMO",
    "id": "1962903682997182528"
  },
  {
    "user": "@cb_doge",
    "text": "BREAKING: 𝕏 is now the #1 news app on the AppStore in Australia. 🥇",
    "bias": "Herd / Bandwagon",
    "id": "1962899419906633874"
  },
  {
    "user": "@elonmusk",
    "text": "The death of Greece",
    "bias": "FOMO",
    "id": "1962901849172029859"
  },
  {
    "user": "@elonmusk",
    "text": "Grok Code sets all-time high usage record on OpenRouter!",
    "bias": "Euphoria / Greed",
    "id": "1962900411419148396"
  },
  {
    "user": "@RMistereggen",
    "text": "Islamist Afran Bhatti is on trial today, charged with with complicity in the terrorist attack in downtown Oslo on June 25, 2022 (also called the pride attack). He denies any guilt.\n\nFor the occasion, he appeared with short hair and no beard, unlike his normal Islamist self. \n\nThe key evidence in the case consists of messages on the encrypted service Telegram. The prosecution claims that Bhatti wrote messages to an undercover agent he believed to be an ISIS leader: \n\n“These chats show that the person we believe to be Arfan Bhatti both ties himself to Matapour’s terrorist attack and suggests new terrorist attacks to his counterpart that he could take part in,” said state prosecutor Sturla Henriksbø.\n\nAccording to the indictment, Bhatti proposed several acts of terrorism in both Pakistan and Norway. Among other things, he allegedly suggested that he could persuade a woman he knew to carry out a suicide attack. He also proposed luring Norwegian journalists down to Pakistan so they could be kidnapped, the indictment claims.\n\nBhatti has been a central figure in both gang crime and Islamist extremism in Norway for decades. His history includes repeated indictments and convictions:\n\n•1990s: Active in the violent street gangs Young Guns and B-gjengen. Convicted several times for armed robbery, violent assault, and weapons offenses.\n\n•2006 – Synagogue Shooting in Oslo:\n\n•Arrested after shots were fired at the Jewish synagogue in Oslo.\n\n•Indicted for terrorism, but acquitted of the terror charge.\n\n•Convicted for complicity in aggravated vandalism related to the shooting, and illegal possession of firearms.\n\n•2010 – Supreme Court Ruling:\nNorway’s Supreme Court increased his sentence to 8 years in prison for the synagogue case.\n\n•2012–2014 – Violence and Threats: After serving his sentence, Bhatti faced new cases involving threats and violence, including against family members and a former partner.\n\n•In 2014 he was convicted of domestic violence.\n\n•2016 – Flight to Pakistan: While wanted in connection with a violent case, Bhatti traveled to Pakistan and remained there. He was internationally wanted by Norwegian authorities, but Pakistan did not extradite him.\n\n•2010s–2020s – Islamist Activity: Throughout the decade, Bhatti became increasingly tied to radical Islamist networks and openly expressed sympathy for ISIS.\n\nHe used social media to spread jihadist propaganda and issue threats.\n\n•2022 – Arrest in Pakistan: Pakistani authorities arrested him at Norway’s  request after the Oslo Pride terrorist attack (carried out by Zaniar Matapour).\n\nBhatti was suspected of involvement and of encouraging further terrorist acts.\n\nDespite Norway’s extradition request, Pakistan released him, and he continued to live freely for some time.",
    "bias": "FOMO",
    "id": "1962811427132981745"
  },
  {
    "user": "@elonmusk",
    "text": "Wow",
    "bias": "None",
    "id": "1962898626688188894"
  },
  {
    "user": "@elonmusk",
    "text": "",
    "bias": "None",
    "id": "1962898342469681366"
  },
  {
    "user": "@elonmusk",
    "text": "My observation is that a major driver of white males becoming trans is the relentless propaganda portraying white men as the worst human beings.\n\nIf those lies land, especially during vulnerable teen years, and they are given an option to be a “celebrated” group, some will do it.",
    "bias": "Herd / Bandwagon",
    "id": "1962894413216334094"
  },
  {
    "user": "@skscartoon",
    "text": "I wonder how Winston Churchill would feel if he saw his countrymen arrested for displaying the Union Jack.",
    "bias": "None",
    "id": "1962859489151025615"
  },
  {
    "user": "@visegrad24",
    "text": "Migrants protesting against Israel have attacked a group of Swedes in the Swedish town of Uddevalla.\n\nOne of the Swedes could have suffered life-threatening injuries after one of the migrants slammed his head into the ground.\n\nWelcome to Sweden 🇸🇪🇵🇸",
    "bias": "None",
    "id": "1962831045792821403"
  },
  {
    "user": "@ElonClipsX",
    "text": "Elon Musk: I think hormonal birth control is making a lot of women sad and depressed.\n\n“I think a lot of women are unaware that hormonal birth control causes depression and dramatically increases risk of suicide and changes their preferences on who they want to marry or have kids with. It changes their personality. And it does say this on the box, by the way. The warnings are has significant significant risk of depression, significant increase in suicide and will make you want to go out with people that you don't actually like. \n\nI think hormonal birth control is making a lot of women sad and depressed. And they don't realize it and they don't realize that's the cause and that there are other forms of contraception that could be used. \n\nI think there are other forms of birth control I think have fewer negative effects than hormonal. We should just be aware that this is not a riskless thing and it does cause severe mood changes and dramatically increases risk of suicide and depression.”\n\nInterview with Tucker Carlson, October 7, 2024",
    "bias": "None",
    "id": "1962840430141403392"
  },
  {
    "user": "@elonmusk",
    "text": "Legacy media lies relentlessly",
    "bias": "None",
    "id": "1962880733690859833"
  },
  {
    "user": "@elonmusk",
    "text": "Facts are facts",
    "bias": "None",
    "id": "1962880525829587102"
  },
  {
    "user": "@elonmusk",
    "text": "Major upgrade of Grok Imagine in a few weeks",
    "bias": "None",
    "id": "1962879969010597971"
  },
  {
    "user": "@elonmusk",
    "text": "Mass importation of voters was and still is their goal",
    "bias": "None",
    "id": "1962879703028822484"
  },
  {
    "user": "@elonmusk",
    "text": "It’s just math",
    "bias": "FOMO",
    "id": "1962878861194256818"
  },
  {
    "user": "@elonmusk",
    "text": "Instead of arresting the violent criminals, the police in Britain are told to arrest people who tell the truth on social media …",
    "bias": "Herd / Bandwagon",
    "id": "1962870324221141445"
  },
  {
    "user": "@paulg",
    "text": "Dressing for an event:\n\nMe: I've looked worse.\n\nJessica: You *have*.",
    "bias": "None",
    "id": "1962765948894531591"
  },
  {
    "user": "@Noahpinion",
    "text": "Even a site filled with bots and Nazis is apparently more appealing than the zombie husk of 2010s Cancel Culture",
    "bias": "None",
    "id": "1962708402376974667"
  },
  {
    "user": "@RepThomasMassie",
    "text": "Our press conference with 10 victims of Epstein‘s sex trafficking is at 10:30 AM on September 3.\n\nI pray @SpeakerJohnson will listen to the pleas of these victims for justice and quit trying to block a vote on our legislation to release the Epstein files.\nfoxnews.com/politics/khanna-…",
    "bias": "Herd / Bandwagon",
    "id": "1962616541356134763"
  },
  {
    "user": "@erikbryn",
    "text": "Here's a fascinating new paper by @SeyedMH98  and @LichtingerGuy  about AI and the workforce. \n\nThey use different methods and data sources than @econ_b, @RuyuChen, and I do in our \"canaries\" paper, but they also find falling levels of employment for young workers in the occupations most affected by AI since early 2023.",
    "bias": "None",
    "id": "1962637359612338543"
  },
  {
    "user": "@paulg",
    "text": "Something I just told a founder: Stay as small as you can for as long as you can. People who come to visit your office should always be surprised that such an important company has so few employees.",
    "bias": "None",
    "id": "1962736318049288199"
  },
  {
    "user": "@paulg",
    "text": "People who think they no longer depend on trusting experts only survive because they're mistaken. Every time you get on a plane you trust experts implicitly about a million questions you're not even aware of.",
    "bias": "Overconfidence",
    "id": "1962731431534235773"
  },
  {
    "user": "@JoJoFromJerz",
    "text": "Why isn’t the guy who never shuts up talking to the press?",
    "bias": "None",
    "id": "1962570406834901380"
  },
  {
    "user": "@emollick",
    "text": "A second paper also finds Generative AI is reducing the number of junior people hired (while not impacting senior roles).\n\nThis one compares firms across industries who have hired for at least one AI project versus those that have not. Firms using AI were hiring fewer juniors",
    "bias": "None",
    "id": "1962513819990692211"
  },
  {
    "user": "@paulg",
    "text": "Jessica discovered something surprising now that she's doing some video interviews for The Social Radars. She says editing video is less work than editing audio, because with video she can't be such a perfectionist.",
    "bias": "Herd / Bandwagon",
    "id": "1962561347826123004"
  },
  {
    "user": "@robinhanson",
    "text": "I asked ChatGPT to collect a sample of 20 conflicts (that happened at least 50yr ago) between generations over cultural changes, & say in how many the young cohort won over the old in the long run. \nScore: Young 18, Old 1, Mixed 1.",
    "bias": "None",
    "id": "1962305485740093534"
  },
  {
    "user": "@paulg",
    "text": "It's official. It's genocide.",
    "bias": "None",
    "id": "1962512489452618056"
  },
  {
    "user": "@paulg",
    "text": "Nine former CDC directors who served under Republican and Democratic presidents warn that the damage RFK Jr is doing to America's public health system is \"unlike anything our country has ever experienced.\"",
    "bias": "None",
    "id": "1962512000656838804"
  },
  {
    "user": "@eshear",
    "text": "Railless light rail is actually a great idea, the best part about light rail isn’t the rail but the form factor and right of way and stations.",
    "bias": "None",
    "id": "1962317129061163289"
  },
  {
    "user": "@snowmaker",
    "text": "If you tell your friends you're burned out, they'll always prescribe the same thing: \"You need to take a vacation\".  But it never works.\n\nBurnout is completely misunderstood.  This new article by @bscholl is the best explanation I've seen.",
    "bias": "None",
    "id": "1962371548146532552"
  },
  {
    "user": "@laurashin",
    "text": "Unchained LIVE: Crypto Investigations with Bubblemaps nitter.net/i/broadcasts/1rmGPvWky…",
    "bias": "Euphoria / Greed",
    "id": "1962877807866134692"
  },
  {
    "user": "@laurashin",
    "text": "I'm going LIVE in < 10 min with @bubblemaps CEO & cofounder @Nickybubbly! Tune in here on X or on YouTube!",
    "bias": "Euphoria / Greed",
    "id": "1962875992365523199"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n   🤑 WLFI unlock makes Trump family $5B richer\n   ⚒️ Ethereum retires Holešky, moves to Hoodi testnet\n   🚀 DEXes break $1.1T monthly volume record\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Herd / Bandwagon",
    "id": "1962833153568960707"
  },
  {
    "user": "@zachxbt",
    "text": "NEW LEAK: Price sheet of 200+ crypto influencers and their wallet addresses from a project they were recently contacted by to promote. \n\nFrom 160+ accounts who accepted the deal I only saw <5 accounts actually disclose the promotional posts as an advertisement.",
    "bias": "Recency Bias",
    "id": "1962485396597776468"
  },
  {
    "user": "@rleshner",
    "text": "Some criminals (eg Lazarus or spearphishers) are using an AI deepfake of me to try to compromise devices and steal crypto.\n\nI will NOT cold DM you, ask you log into Zoom, or download anything. Stay frosty.",
    "bias": "None",
    "id": "1962306656898814459"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n   • 🚨 WLFI unlock day — $30B project in motion\n   • 💸 TRON just made USDT transfers cheaper\n   • 🐶 Musk’s top lawyer tapped for DOGE fund\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Euphoria / Greed",
    "id": "1962470832850018627"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Literally, Happy Monday.",
    "bias": "FOMO",
    "id": "1962897263870754983"
  },
  {
    "user": "@CryptoWendyO",
    "text": "A Bitcoin Bull and an Ethereum Elephant have entered the chat.\n\nHIGHER",
    "bias": "Euphoria / Greed",
    "id": "1962872798533337222"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Thanks for playing.",
    "bias": "None",
    "id": "1962727623748165957"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Tomorrow is Monday.",
    "bias": "None",
    "id": "1962703872943968762"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto Wendy O is crypto YouTube, TikTok, Instagram, Facebook and X on Tuesdays.",
    "bias": "None",
    "id": "1962685696210280919"
  },
  {
    "user": "@CryptoWendyO",
    "text": "",
    "bias": "None",
    "id": "1962676514438422544"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Did this conversation with @HotepJesus about Trump and crypto age well?",
    "bias": "None",
    "id": "1962669442636345699"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Today seems like a nice day to log off and eat some hot doggies.",
    "bias": "None",
    "id": "1962576850636730431"
  },
  {
    "user": "@CryptoWendyO",
    "text": "WHAT A GHETTO MESS! \n\nCATCH THE REPLAY! \n\npiped.video/live/S6_11BRSpC4…",
    "bias": "None",
    "id": "1962651180384788916"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Gavin Newsom rugs tax paying Californians daily so no need to launch a meme coin.",
    "bias": "Herd / Bandwagon",
    "id": "1962642750710710325"
  },
  {
    "user": "@CryptoWendyO",
    "text": "World Liberty Financial Launches Governance Token WLFI, Goes Cross-Chain With Chainlink\n\nTrump-backed World Liberty Financial officially launched its governance token, WLFI, on major exchanges including Binance, KuCoin, and Bybit, debuting at $0.30 with a $30B fully diluted valuation and $8.7B market cap, making it one of the top 30 crypto assets.\n\nShortly after launch, WLFI became cross-chain transferable via Chainlink’s CCIP, supporting secure movement across Ethereum, Solana, and BNB Chain. \n\nSources: Chainlink and Crypto Briefing",
    "bias": "Loss Aversion",
    "id": "1962621484788260903"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto things you might have missed:\n\n-YIKES\n-Massive Trump news could pump SOL to new highs!\n-ADA vs ETH rivalry is heating up🥵\n-Canary CEO makes $XRP prediction\n-Big updates for ADA, DOT, and SOL ETFs\n-Borrow against BTC without selling! @hodlwithLedn \n\nLIVESTREAM LINK IN BIO",
    "bias": "Euphoria / Greed",
    "id": "1962563240552218686"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I know all of you have seen the insanely bullish news from @cryptocom \n\nIf you haven’t already, download the app using my link and LEVEL UP!\n\nThank you to my partners at @cryptocom \n\ncryptocom.sjv.io/wendyo",
    "bias": "Herd / Bandwagon",
    "id": "1962531631216136668"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Hedera is major Defi. \n\nDefi is for everyone.",
    "bias": "Herd / Bandwagon",
    "id": "1962544936861253885"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto just changed forever.",
    "bias": "None",
    "id": "1962514411823976843"
  },
  {
    "user": "@CryptoWendyO",
    "text": "This is not a great monthly close for bitcoin but I am really good at holding until ZERO",
    "bias": "Herd / Bandwagon",
    "id": "1962332977603731703"
  }
]