[
  {
    "user": "@ftopinion",
    "text": "The real significance of the US court ruling on tariffs  — Mohamed El-Erian on.ft.com/3JKovRf",
    "bias": "None",
    "id": "1962516470513983626"
  },
  {
    "user": "@elerianm",
    "text": "Please find below the link to my latest column in the Financial Times on what to make of last Friday's appeals court ruling on US tariffs:\nft.com/content/81be473e-7270…\n#economy @FT #tariffs #trade #markets",
    "bias": "Recency Bias",
    "id": "1962520630873432456"
  },
  {
    "user": "@elerianm",
    "text": "From the article in @TheEconomist, \"Fear the deficit-populism doom loop: Politicians, particularly in Europe, are in a terrible bind.\"\n#economy #deficit #debt #markets",
    "bias": "Panic / Capitulation",
    "id": "1962510829703561254"
  },
  {
    "user": "@elerianm",
    "text": "From the @WSJ:\n“The [US] middle class—generally considered to include households making roughly $53,000 to $161,000 a year—is playing an outsize role in that waning optimism. After months of tracking high-income earners’ increasing confidence about the economy, households making between $50,000 and $100,000 made an abrupt about-face in June. They now more closely resemble low-income earners’ gloomier views, according to surveys done by Morning Consult, a data-intelligence firm.”\n#economy #inequality",
    "bias": "FOMO",
    "id": "1962279255930204448"
  },
  {
    "user": "@elerianm",
    "text": "This chart, illustrating how central bank direct holdings of gold now exceed those of U.S. Treasuries for the first time in some  thirty years, is attracting significant attention.\n#gold #centralbanks #markets #bonds",
    "bias": "None",
    "id": "1962275798619914297"
  },
  {
    "user": "@elerianm",
    "text": "Please find the link to my weekly outlook for the global economy and markets:\nmohamedelerian.substack.com/…\n#economy #markets #growth #inflation #federalreserve #trade #tariffs #investing #investors",
    "bias": "None",
    "id": "1962240617666261178"
  },
  {
    "user": "@elerianm",
    "text": "Below is the usual end-of-month summary of returns for major asset classes and assets.\nAugust was a relatively good, albeit bumpy, month for investors overall, thereby extending the year-to-date gains in many markets.\nStocks led the pack, particularly China, the Dow, and Japan. Gold also saw notable gains.\nOf the items covered, only Bitcoin and oil registered negative returns for the month.\n#economy #markets #gold #stocks #bitcoin #oil #investing #investors",
    "bias": "Herd / Bandwagon",
    "id": "1962150397654470672"
  },
  {
    "user": "@RayDalio",
    "text": "Every meeting should be aimed at achieving someone's goals; that person is the one responsible for the meeting and decides what they want to get out of it and how they will do so. Meetings without someone clearly responsible run a high risk of being directionless and unproductive. #principleoftheday",
    "bias": "Euphoria / Greed",
    "id": "1962127230017962421"
  },
  {
    "user": "@barronsonline",
    "text": "Gold Jumps to a Record. What’s Powering the Precious Metal Higher. trib.al/h3uEXNe",
    "bias": "Euphoria / Greed",
    "id": "1962538872635576563"
  },
  {
    "user": "@barronsonline",
    "text": "CoreWeave Faces a Fight to Buy Core Scientific Amid Stock Shifts. Why a Deal Needs to Be Done. trib.al/tBMPDa0",
    "bias": "None",
    "id": "1962534348504064105"
  },
  {
    "user": "@barronsonline",
    "text": "EV Sales Stay Strong in China. Why Profitability Is a Worry For Tesla, BYD, NIO, Others. trib.al/qG1niLr",
    "bias": "None",
    "id": "1962526508515205557"
  },
  {
    "user": "@barronsonline",
    "text": "Samsung, SK Hynix Stocks Drop on Export Curbs. What It Means for U.S. Chip Companies. trib.al/gmMhdt4",
    "bias": "None",
    "id": "1962510559250719055"
  },
  {
    "user": "@barronsonline",
    "text": "Stock Markets Had a Glorious Summer. Why That May Not Last. trib.al/PKxUAlF",
    "bias": "None",
    "id": "1962496953536634998"
  },
  {
    "user": "@barronsonline",
    "text": "Trump-Backed WLFI Crypto Starts Trading Today. What to Know. trib.al/udRreju",
    "bias": "None",
    "id": "1962486776074825974"
  },
  {
    "user": "@barronsonline",
    "text": "Alibaba Stock Soars 19%. What’s Behind the Jump. trib.al/DnfSjvo",
    "bias": "None",
    "id": "1962482226056015921"
  },
  {
    "user": "@barronsonline",
    "text": "BYD Stock Plummets. How China’s EV Price War Tanked Tesla Rival’s Earnings. trib.al/wmyWcE0",
    "bias": "Panic / Capitulation",
    "id": "1962470921186214212"
  },
  {
    "user": "@barronsonline",
    "text": "Novo’s Wegovy Beats Lilly’s Zepbound for Heart Health, Study Finds. What It Means for Stocks. trib.al/78xR0jJ",
    "bias": "None",
    "id": "1962466395226071228"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Is Set to Get a Big Boost From OpenAI. Here’s How Much. trib.al/yBrzmkT",
    "bias": "None",
    "id": "1962460702842532070"
  },
  {
    "user": "@barronsonline",
    "text": "European Stocks Rise, Japan Shares Slide as Tech Selloff Drags On trib.al/TJJcTwn",
    "bias": "Panic / Capitulation",
    "id": "1962442590227194052"
  },
  {
    "user": "@barronsonline",
    "text": "Bitcoin, Ethereum, XRP Fall. Why a Crypto Correction May Be Coming. trib.al/iSblODw",
    "bias": "Herd / Bandwagon",
    "id": "1962431258937483513"
  },
  {
    "user": "@barronsonline",
    "text": "Wyoming State Buys European Bank Stocks, Adjusts Healthcare Holdings trib.al/ZgOA5hB",
    "bias": "None",
    "id": "1962425594513076648"
  },
  {
    "user": "@barronsonline",
    "text": "You Think Tesla Sales Are Weak Now? Just Wait. trib.al/9gH3Or6",
    "bias": "None",
    "id": "1962396158610804825"
  },
  {
    "user": "@barronsonline",
    "text": "Mortgage Rates Could Shrug Off a Fed Cut—but Not This One trib.al/Q8YZx3N",
    "bias": "None",
    "id": "1962380279743430742"
  },
  {
    "user": "@barronsonline",
    "text": "Japan’s Surging Bond Yields Are a Headache for U.S. Treasuries trib.al/GnmWiTe",
    "bias": "Contrarian",
    "id": "1962372408955806121"
  },
  {
    "user": "@barronsonline",
    "text": "Is the Stock Market Open Today? Here Are the Trading Hours for Labor Day. on.barrons.com/3HUCPGq",
    "bias": "None",
    "id": "1962365625034043871"
  },
  {
    "user": "@barronsonline",
    "text": "The Trump administration removed the de minimus exemption for Chinese goods in May. It ended for all imports on Friday.",
    "bias": "None",
    "id": "1962274223591768514"
  },
  {
    "user": "@barronsonline",
    "text": "The stock market may no longer follow an old pattern of “reverting to the mean.”  Blame it on index funds.",
    "bias": "None",
    "id": "1962244039337545758"
  },
  {
    "user": "@barronsonline",
    "text": "Jobs, Inflation, Salesforce, Broadcom, Macy’s, and More to Watch This Week trib.al/DHr6FyB",
    "bias": "None",
    "id": "1962214992708612312"
  },
  {
    "user": "@balajis",
    "text": "But why are gold prices rising? Because BRICS is stacking gold bricks, and the Russian sanctions eroded the store-of-value function of the dollar.\n\nAnd why did the Fed hike rates and devalue Treasuries? Because inflation was eroding the purchasing power of the dollar.",
    "bias": "Contrarian",
    "id": "1962519735834411150"
  },
  {
    "user": "@balajis",
    "text": "Or the dollar almost halving.\n\nThe true rate of inflation is the rate at which the smart money is exiting the US dollar for hard money.",
    "bias": "None",
    "id": "1962467581866230038"
  },
  {
    "user": "@balajis",
    "text": "It is a huge deal, because in 1950 America made things while in 2025 it only prints things.\n\nSpecifically, the only two globally competitive exports of the US are (a) the dollar and (b) tech.\n\nAnd tariffs, sanctions, trade war, and printing are eroding the dollar.",
    "bias": "None",
    "id": "1962466874173829278"
  },
  {
    "user": "@balajis",
    "text": "Recall the Fed admitted that a “small number” of countries were switching to gold.\n\nBut that small number actually included Russia, India, and China: the RIC of BRICS.",
    "bias": "Herd / Bandwagon",
    "id": "1962448779854135357"
  },
  {
    "user": "@balajis",
    "text": "Digital gold is becoming the reserve currency of the individual.\n\nGold is returning as the reserve currency of the state.\n\nOriginal post below.",
    "bias": "None",
    "id": "1962446917792874606"
  },
  {
    "user": "@balajis",
    "text": "The dollar is losing reserve currency status. It’s down to 42% of global reserves, and gold is rapidly rising.",
    "bias": "None",
    "id": "1962446223627178394"
  },
  {
    "user": "@elonmusk",
    "text": "The Rape of Britain. \n\nNot. Any. More.",
    "bias": "None",
    "id": "1962387801233863149"
  },
  {
    "user": "@GoodwinMJ",
    "text": "This is how utterly insane the UK immigration system is\n\nIf you are a British person who wants to bring a foreign partner into the country then they will have to meet a minimum income requirement and show they can support themselves without welfare\n\nBut if you are an asylum-seeker or illegal migrant who has been allowed to stay in the UK you can bring family members into the UK who do NOT have to demonstrate they have the necessary housing or income to live in the UK without needing welfare and who do NOT even need to speak English\n\nWe are the architects of our own demise",
    "bias": "Loss Aversion",
    "id": "1962439905000161393"
  },
  {
    "user": "@darrengrimes_",
    "text": "Two Tier Tyranny.",
    "bias": "None",
    "id": "1962371975801618548"
  },
  {
    "user": "@elonmusk",
    "text": "Remigration is the only way",
    "bias": "None",
    "id": "1962406618886492245"
  },
  {
    "user": "@WallStreetMav",
    "text": "How did the UK get this messed up?\n\nWhich Prime Minister started this disaster?\nThey all continued it and did nothing to stop it, but which one started it?",
    "bias": "None",
    "id": "1962370044110782619"
  },
  {
    "user": "@elonmusk",
    "text": "Exactly. \n\nAnd it will work, unless the people of Britain put a stop to it.",
    "bias": "None",
    "id": "1962405091249692821"
  },
  {
    "user": "@elonmusk",
    "text": "Time to wake up to the horrific reality",
    "bias": "None",
    "id": "1962404672821657922"
  },
  {
    "user": "@elonmusk",
    "text": "🫡",
    "bias": "None",
    "id": "1962403151434383683"
  },
  {
    "user": "@elonmusk",
    "text": "💯",
    "bias": "None",
    "id": "1962402876007063615"
  },
  {
    "user": "@teslaownersSV",
    "text": "Starship the first ever designed rocket to get us to Mars.",
    "bias": "Euphoria / Greed",
    "id": "1962396743137644616"
  },
  {
    "user": "@elonmusk",
    "text": "The goal is obviously long-term settlement to import voters. \n\nIf mass importation of voters is allowed to continue, it will succeed and the vote of the Britain-born will not matter.",
    "bias": "None",
    "id": "1962401058057277882"
  },
  {
    "user": "@elonmusk",
    "text": "Should I go on this podcast?",
    "bias": "Contrarian",
    "id": "1962398666490343854"
  },
  {
    "user": "@elonmusk",
    "text": "This must stop now",
    "bias": "None",
    "id": "1962397700797948199"
  },
  {
    "user": "@TRobinsonNewEra",
    "text": "Speakers' Corner Shalini calls out the Met police:\n\n\"Radical Muslims, rapists, paedophiles they are all in this country, and the police have to remember they live here too. Save your family and save this country.\"\n\nCan't wait to meet this lady 🙌🏻",
    "bias": "None",
    "id": "1962102065691332882"
  },
  {
    "user": "@teslaownersSV",
    "text": "Now is the time to stand against the insane cover ups and speak up in you live in the UK\n\nFight fight fight.",
    "bias": "None",
    "id": "1962213984574296147"
  },
  {
    "user": "@elonmusk",
    "text": "Progress",
    "bias": "None",
    "id": "1962396751056482812"
  },
  {
    "user": "@antmiddleton",
    "text": "Safety and security are not just words — they are the foundation of a thriving city. London should be a capital where families, workers, and visitors all feel protected. As Mayor, I will bring back strong security and decisive leadership to make sure our capital is once again a city that people can trust, respect, and call safe.",
    "bias": "None",
    "id": "1962394787123740734"
  },
  {
    "user": "@SeibtNaomi",
    "text": "Justice for Liana. 🕯️\n\nShe is not just the victim of an Iraqi invader,\nshe was failed by a corrupt system.\n\nOnly the AfD can save Germany. 🇩🇪",
    "bias": "None",
    "id": "1962259703674650882"
  },
  {
    "user": "@elonmusk",
    "text": "He make a great point",
    "bias": "None",
    "id": "1962395788577014195"
  },
  {
    "user": "@elonmusk",
    "text": "Wow",
    "bias": "None",
    "id": "1962395390923477083"
  },
  {
    "user": "@elonmusk",
    "text": "The government in Britain is bribing hotel owners with multi-millions of pounds for SEVEN-year contracts to house illegal migrants. \n\nTheir goal is obviously to amplify and extend the illegal migrant tidal wave, not reduce it. Anyone saying otherwise is a liar. \n\nThankfully, this good man rejected the bribe.",
    "bias": "None",
    "id": "1962394431111516415"
  },
  {
    "user": "@VitalikButerin",
    "text": "IMO people who called network states \"colonialist\" are wrong and misguided.\n\nWe've seen a lot of large-scale colonialist evil the past few years. Almost none has come from network state exit libertarians, while a lot has come from people who decided libertarianism is outdated now\n\n\"If you disagree with how things are run, go start a new thing\" really is a very \"robust-to-error\" position to take. The potential negative consequences of what you do are localized, and are inherently bounded. Even though with the internet you can act globally you're taking a large handicap on network effects. AI doom will NOT come from an island or a boat in international waters. And much of what we're recently seen is some former libertarians realizing \"why oppose the government when you can just take it over\", which has MUCH LARGER downsides.\n\nI think we should update on this, and be kinder to the \"exit\" position going forward.\n\nCaveat: I think there is evil that has recently come from libertarians, notably from political lobbying, both for \"bad deregulation\" (eg. I oppose deregulating AGI/ASI) and for \"deregulation no matter the side effects of how you achieve the outcome\". But the people doing these things are specifically not the \"exit\" faction.",
    "bias": "Recency Bias",
    "id": "1962287488942153899"
  },
  {
    "user": "@robinhanson",
    "text": "I asked ChatGPT to collect a sample of 20 conflicts (that happened at least 50yr ago) between generations over cultural changes, & say in how many the young cohort won over the old in the long run. \nScore: Young 18, Old 1, Mixed 1.",
    "bias": "None",
    "id": "1962305485740093534"
  },
  {
    "user": "@paulg",
    "text": "It's official. It's genocide.",
    "bias": "None",
    "id": "1962512489452618056"
  },
  {
    "user": "@paulg",
    "text": "Nine former CDC directors who served under Republican and Democratic presidents warn that the damage RFK Jr is doing to America's public health system is \"unlike anything our country has ever experienced.\"",
    "bias": "None",
    "id": "1962512000656838804"
  },
  {
    "user": "@DKThomp",
    "text": "The American protein craze seems to hinge on a biological misunderstanding. \n\nYes, muscles are \"made of protein.\" But it doesn't follow that more protein always = bigger muscles. \n\nThere is no way to store excess protein in the body, and the more protein we take in beyond what can be used that day, the more is wasted.\n\n\"You can eat a ton of protein. You can digest a ton of protein. But the key question is: How much can you use? And we don’t have a way of stocking away extra amino acids.”",
    "bias": "None",
    "id": "1962166282968547392"
  },
  {
    "user": "@eshear",
    "text": "Railless light rail is actually a great idea, the best part about light rail isn’t the rail but the form factor and right of way and stations.",
    "bias": "None",
    "id": "1962317129061163289"
  },
  {
    "user": "@snowmaker",
    "text": "If you tell your friends you're burned out, they'll always prescribe the same thing: \"You need to take a vacation\".  But it never works.\n\nBurnout is completely misunderstood.  This new article by @bscholl is the best explanation I've seen.",
    "bias": "None",
    "id": "1962371548146532552"
  },
  {
    "user": "@paulg",
    "text": "13 yo just started dictating the fourth book in his series, and a character he created when he was 9 just met a character from the book he finished a few weeks ago. They're really starting to take on lives of their own.",
    "bias": "None",
    "id": "1962280639840788745"
  },
  {
    "user": "@davidfrum",
    "text": "I visited Norway earlier this year. Leaders told me they had initially favored a US bid for the frigates. Trump's comments about \"kill switches\" alarmed Norwegians that the US was no longer a trustworthy supplier of equipment to defend Norway against Trump's friends in Russia.",
    "bias": "None",
    "id": "1962132751609475392"
  },
  {
    "user": "@MustafaBarghou1",
    "text": "The Israeli army is brutally destroying the remaining homes and buildings in Gaza city .",
    "bias": "None",
    "id": "1961995332721807810"
  },
  {
    "user": "@zachxbt",
    "text": "NEW LEAK: Price sheet of 200+ crypto influencers and their wallet addresses from a project they were recently contacted by to promote. \n\nFrom 160+ accounts who accepted the deal I only saw <5 accounts actually disclose the promotional posts as an advertisement.",
    "bias": "Recency Bias",
    "id": "1962485396597776468"
  },
  {
    "user": "@rleshner",
    "text": "Some criminals (eg Lazarus or spearphishers) are using an AI deepfake of me to try to compromise devices and steal crypto.\n\nI will NOT cold DM you, ask you log into Zoom, or download anything. Stay frosty.",
    "bias": "None",
    "id": "1962306656898814459"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n   • 🚨 WLFI unlock day — $30B project in motion\n   • 💸 TRON just made USDT transfers cheaper\n   • 🐶 Musk’s top lawyer tapped for DOGE fund\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Euphoria / Greed",
    "id": "1962470832850018627"
  },
  {
    "user": "@0xMert_",
    "text": "> \"twice as fast as solana\"\n\ni) wrong, this deliberately takes the concept of shreds from Solana and then compares them to the concept of blocktimes instead. if you compared them to shreds, then solana is 30-50ms faster. in fact, I did this test this week\n\nimportantly, it is faster while not being a centralized server\n\nii) even if you compared them to finality for example, solana with alpenglow will have finalization with a global validator set in 100ms, which is 2x faster than a centralized multisig\n\nread that again ^. Solana will reach finality with thousands of nodes and censorship resistance TWO times faster than a centralized server \n\n> re sequencers\n\njito's BAM provides all the same benefits as what luke says but actually on the L1 and in a permissionless way where one giant corp doesn't fully control the sequencer, which is no different than tradfi\n\n> re 80-90% being \"extracted\". \n\ni) that's not even close to the actual number, just made up\n\nii) the actual number has been steadily declining over time as engineers all over the ecosystem are solving the hard problems instead of giving up on all blockchain ideals and saying let's just use centralized servers instead — ppl are literally iterating on market structure with prop AMMs and giving better spreads than 0.5bps \n\nthat said I agree that solana technically has the highest amount of retail \"extraction\", since it does have the most retail and activity. and just like every other time, we will solve the hard problems and make the experience better than all others",
    "bias": "FOMO",
    "id": "1962187149085700371"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I know all of you have seen the insanely bullish news from @cryptocom \n\nIf you haven’t already, download the app using my link and LEVEL UP!\n\nThank you to my partners at @cryptocom \n\ncryptocom.sjv.io/wendyo",
    "bias": "Herd / Bandwagon",
    "id": "1962531631216136668"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto just changed forever.",
    "bias": "None",
    "id": "1962514411823976843"
  },
  {
    "user": "@CryptoWendyO",
    "text": "This and my portfolio 1000X overnight",
    "bias": "None",
    "id": "1962021052600721544"
  },
  {
    "user": "@CryptoWendyO",
    "text": "This is not a great monthly close for bitcoin but I am really good at holding until ZERO",
    "bias": "Herd / Bandwagon",
    "id": "1962332977603731703"
  },
  {
    "user": "@CryptoWendyO",
    "text": "You guys know it’s a holiday weekend and you don’t have to post stupid tales for engagement today?",
    "bias": "None",
    "id": "1962312284434477511"
  },
  {
    "user": "@CryptoWendyO",
    "text": "$WLFI will prob be the play. \n\nTraditional finance and the ivory towers for the win. \n\nDo you know what to do?",
    "bias": "None",
    "id": "1962285792543519050"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Also….",
    "bias": "None",
    "id": "1962271957434650844"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I just restrained from saying something true on the internet that would make people mad.\n\nI rewarded myself.",
    "bias": "None",
    "id": "1962261546387792127"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I have no idea what is going on in Europe but I love it in California.",
    "bias": "None",
    "id": "1962231033421857006"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I really really love it here.",
    "bias": "None",
    "id": "1962185781277323556"
  },
  {
    "user": "@brave",
    "text": "On the latest #TheBraveTechnologist episode, The O Show host @CryptoWendyO talks with @LukeMulks about the critical importance of privacy once you begin accumulating wealth in crypto. \n\nCheck out the full episode, recorded at @RareEvo in Las Vegas, here: brave.com/podcast/e85/",
    "bias": "Recency Bias",
    "id": "1962166447771111476"
  },
  {
    "user": "@CryptoWendyO",
    "text": "What meme coins and altcoins should I look at during the stream this week?",
    "bias": "Herd / Bandwagon",
    "id": "1962125718520766485"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I love it here",
    "bias": "None",
    "id": "1961948266083627110"
  }
]