[
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL CEO has been consistently discussing data centers in space. \n\nGiven it already owns ~3% of $ASTS, that stake looks like early positioning for deeper commercial partnerships.",
    "bias": "None",
    "id": "2002403883281187175"
  },
  {
    "user": "@StockSavvyShay",
    "text": "THE TOP GROWTH PERFORMERS OF 2025\n\n1. $PL +375%\n2. $IREN +307%\n3. $OPEN +298%\n4. $OKLO +292%\n5. $ONDS +260%\n6. $ASTS +259%\n7. $CIFR +249%\n8. $MP +246%\n9. $JMIA +238%\n10. $HOOD +226%\n11. $NBIS +223%\n12. $QBTS +219%\n13. $MU +216%\n14. $RKLB +177%\n15. $EOSE +169%",
    "bias": "None",
    "id": "2002394834674262228"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$MELI IS TRADING AT ITS LOWEST MULTIPLE IN A DECADE",
    "bias": "None",
    "id": "2002389075509080452"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$NVDA should say $170**  🤦‍♂️",
    "bias": "None",
    "id": "2002373953004753328"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Fibonacci levels help you see where momentum pauses by mapping potential areas of support & resistance using ratios from the Fib sequence.\n\nI find them useful because strong trends often consolidate at these levels before continuing higher.",
    "bias": "None",
    "id": "2002373121878397347"
  },
  {
    "user": "@StockSavvyShay",
    "text": "UPDATED FIB LEVELS FOR POPULAR STOCKS \n\n1. $NVDA -- $70\n2. $AMD -- $211\n3. $TSLA -- $474\n4. $HIMS -- $33\n5. $ASTS -- $70\n6. $RKLB -- $66\n7. $TEM -- $55\n8. $IONQ -- $38\n9. $JOBY -- $14\n10. $PLTR -- $185\n11. $IREN -- $38\n12. $NBIS -- $87\n13. $OSCR -- $14\n14. $CIFR -- $15\n15. $SOFI -- $27\n16. $BMNR -- $30\n17. $HOOD -- $117\n18. $OKLO -- $75\n19. $ACHR -- $6.50\n20. $ONDS-- $7.50",
    "bias": "None",
    "id": "2002372249547108634"
  },
  {
    "user": "@StockSavvyShay",
    "text": "All portfolio performance has been independently validated by a third party:\n\nsavvytrader.com/StockSavvySh…",
    "bias": "None",
    "id": "2002364851318853722"
  },
  {
    "user": "@StockSavvyShay",
    "text": "MY 2026 PICKS ARE IN\n\nWhen I started the growth portfolio, I didn’t expect it to double in each of the first three years. \n\nI make a small set of high conviction picks each year where I focus on early disruptors & reratings the market is overlooking:\n2023: $RKLB, $IONQ\n2024: $AEHR, $EOSE\n2025: $ASTS, $NVTS, $JMIA\n\nThe 2026 picks are out. One is around a $400M market cap & the other around $4B. \n\nAny guesses?",
    "bias": "None",
    "id": "2002364265689223338"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN is building an $11B data center campus in Indiana dedicated to training and inference at scale.\n\nThe site will draw ~2.2 GW of power which is equivalent to powering 1M homes.",
    "bias": "None",
    "id": "2002348670201565510"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$EOSE is my favorite name in this space because it sits at the exact fault line of the AI power problem that almost no one is pricing correctly yet. \n\nAI data centers create violent load swings that break grids and long-duration storage sits directly at that bottleneck.",
    "bias": "None",
    "id": "2002345606807781518"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL controls the full AI stack from models to silicon to distribution which matters in 2026 as AI platform wars shift from model quality to data and distribution advantage.\n\nDaniel and I dug into this on the FE podcast episode below:\n\npiped.video/FjlXoydLDlU?si=97Rr…",
    "bias": "None",
    "id": "2002184865207501292"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Daniel and I shared our latest thoughts on the FE podcast on how the $NVDA ecosystem is shaping up heading into 2026\n\npiped.video/2qQgY7TmIfY?si=mXwj…",
    "bias": "None",
    "id": "2002178232226099215"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Went deeper on my thoughts around $AVGO earnings on the FE podcast, especially where the market is still underestimating the setup into 2026.\n\npiped.video/UKp-mMadhVI?si=yvEd…",
    "bias": "None",
    "id": "2002160662982836358"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Here’s a fun clip from the FE podcast where I talked about the insatiable demand coming for the space economy in 2026 with $RKLB & $ASTS as the biggest beneficiaries: \n\npiped.video/5zkdiYtph7I?si=4NLh…",
    "bias": "None",
    "id": "2002132095804846084"
  },
  {
    "user": "@StockSavvyShay",
    "text": "The Delaware Supreme Court ruled that $TSLA Elon Musk’s $56B 2018 pay package must be reinstated.",
    "bias": "None",
    "id": "2002129622415360195"
  },
  {
    "user": "@RiskReversal",
    "text": "Links to watch/listen here!  \n\nYouTube: piped.video/wXA9wBzUrrY\nApple: apple.co/4s1txe1\nSpotify: tinyurl.com/ytpyynyr",
    "bias": "None",
    "id": "2002050249469436010"
  },
  {
    "user": "@RiskReversal",
    "text": "\"What you've got with a lot of the Chinese hardware chips. Are there anywhere as good as Nvidia? Absolutely not. There are a couple of generations behind... but there are a lot of people out there that have an iPhone 15 are doing just fine. You don't need the latest thing, sometimes a couple of years old is just fine.\"\n\n@DanielTNiles joins Dan Nathan on the latest episode to talk all things AI, Chips & China!",
    "bias": "None",
    "id": "2002046526760116392"
  },
  {
    "user": "@jonnajarian",
    "text": "6⃣0⃣ Seconds $NKE $KBH $DECK $LYFT $WGO $ETHU $FOLD Have a Great Weeknd 🇵🇷",
    "bias": "None",
    "id": "2002019376728309767"
  },
  {
    "user": "@GlobalRabbi",
    "text": "Please help Geffen Bitton, the Sydney unsung hero “in the red T shirt” who ran to into the line of fire after Ahmed Al Ahmed to fight the terrorist, is in serous condition and needs needs our help. gofundme.com/f/gefen-our-her…\n\nLet us not forget him as his identity was only shared today.\n\nGeffen who moved towards the Bondi gunman instead of fleeing remains fighting for his life after being shot.\n\nGefen Bitton, 30, referred to as the ‘man in a red T-shirt’ after he was seen in footage from Sunday’s attack near the footbridge running to help Ahmed Al Ahmed as he disarmed terrorist gunman Sajid Akram\n\nBitton, an Israeli who has been working in Australia for about three years as a garage door technician, was attending the Chanukah by the Sea event, his friend Tom Cohen told 7NEWS.com.au.\n\nHe had been looking forward to watching the ceremonial lighting of the menorah when the shooting began.\n\nAs gunfire rang out, another friend of Bitton’s stood up and ran, but seconds later realised the 30-year-old was not with him.\n\nMoments later his sister in Israel then received a phone call from Bitton saying he had been shot.\n\nShe alerted his friends in Sydney, who began desperately searching for him, before eventually finding him at St Vincent’s Hospital, initially listed as an unidentified patient.\n\nIn the days that followed, friends recognised Bitton in footage that showed him attempting to help, but was shot by the terrorist Naveed Akram.\n\nFriends believe Bitton’s decision to run back toward the bridge also explains why his phone and keys were later found closer to the gunman than where he had been sitting moments earlier.\n\nAnother friend, Cayli Barr, said Bitton’s decision was something “most of us couldn’t even imagine”.\n\n“Gefen had escaped, he was safe, but when he saw the terrorist, he ran into the line of fire to help,” Barr wrote in a GoFundMe page set up to support Bitton.\n\n“He made the decision to put himself at risk to save the lives of others.\n\n“As Ahmad Al Ahmad heroically jumped on the terrorist, Gefen ran in alongside to confront the terrorist.\n\n“There, he was shot, fell to the ground, and shot again.\n\n“Now in the ICU, Gefen’s put his own life at risk with his selfless actions.”\n\n“He ran into the face of danger like only a hero does, guided by the values on which he was educated and raised.”\n\nBitton’s father has since flown from overseas to Sydney to be by his son’s bedside, as friends and family keep vigil at the hospital.\nFive days on, he remains in intensive care, unresponsive, and has undergone five surgeries, Cohen said.\n\nHe was shot in the lower abdomen near the hip, shattering his pelvic bone.\n\nBone fragments caused severe internal injuries, and doctors required three to four operations to stop the internal bleeding.\nCohen said it is unclear whether Bitton will regain full use of his leg, and that the road to recovery will be long.\n\n“He’s like the most spiritual guy ever,” Cohen said, describing Bitton as “super brave and super unique”.\n\n“He loves people and always turns words into action.",
    "bias": "None",
    "id": "2002106642729517175"
  },
  {
    "user": "@jonnajarian",
    "text": "Ursula von der Leyen is the biggest threat to free people",
    "bias": "None",
    "id": "2002345132390060298"
  },
  {
    "user": "@jonnajarian",
    "text": "Anthony Joshua is 6'6\" & 243 lbs\nJake Paul is 6'1\" & 216 lbs  \nJoshua has more than twice as much experience (17+ years vs. ~7 years) and a vastly deeper background, including elite amateur competition (Olympic gold, world championships.\nEnough said?",
    "bias": "None",
    "id": "2002342603564707841"
  },
  {
    "user": "@jonnajarian",
    "text": "Great interview @petenajarian",
    "bias": "None",
    "id": "2002035867016466760"
  },
  {
    "user": "@jonnajarian",
    "text": "Triple witching refers to the simultaneous expiration of 3 types of derivative contracts on the same day: Stock index futures\nStock index options\nIndividual stock options\nOnly 4 times/year, on the third Friday of March, June, Sept & December.",
    "bias": "None",
    "id": "2002014485062578278"
  },
  {
    "user": "@jonnajarian",
    "text": "\"dogs and cats living together\"  @MXLESQ 🐕‍🦺😼",
    "bias": "None",
    "id": "2002006370057400415"
  },
  {
    "user": "@jonnajarian",
    "text": "🇰🇵 North Korean hackers had their biggest year yet for stealing cryptocurrencies. $2.02 billion in crypto since January .. #ITSNOTANOPTION 📙",
    "bias": "None",
    "id": "2002005513236885543"
  },
  {
    "user": "@jonnajarian",
    "text": "ACA was based on a lie",
    "bias": "None",
    "id": "2001998543305732548"
  },
  {
    "user": "@jonnajarian",
    "text": "How happy are you? It's your quality of life minus envy. I am unbelievably HAPPY!",
    "bias": "None",
    "id": "2001995538128863453"
  },
  {
    "user": "@JeremyDSchwartz",
    "text": "The EBB and Flow: An Equity Bond Barbell and Outlook for 2026 featuring\n\n@biancoresearch on bonds\n@SamuelRines on GeoPol\n@JeffWeniger on Stocks\nAnd Wikfiolio CEO to get state of retail investor sentiment in Germany\n\nopen.spotify.com/episode/06O…",
    "bias": "None",
    "id": "2002098819367121333"
  },
  {
    "user": "@traderbrasil",
    "text": "\"Boomers are degening in housing. Millennials are degening in Bitcoin.\" - @biancoresearch\n\nJim Bianco explains at @tradersofworld why the housing market has become a leveraged \"piggy bank\" for the older generation, pricing out the youth.\n\nJust Watch :  \n\n#RealEstate #Bitcoin",
    "bias": "None",
    "id": "2002040758291866111"
  },
  {
    "user": "@biancoresearch",
    "text": "Now even the top of the k-shaped economy is complaining about affordability!",
    "bias": "None",
    "id": "2002033269404250419"
  },
  {
    "user": "@biancoresearch",
    "text": "2/2\n\nThis list should have sparked a bond rally, but it is not.\nWhen markets cannot rally on good news (falling yields for bonds), it is a signal.\n--\n* Dec 10 - The Fed cuts 25 bps, bringing the total cuts to 175 bps since September 2024 - BULLISH FOR BONDS\n\n* Dec 10 - During his press conference, Chairman Powell said: “Payroll jobs averaging 40,000 per month since April. We think there’s an overstatement in — in these numbers by about 60,000. So that would be negative 20,000 per month.” - INCREDIBLY BULLISH FOR BONDS\n\n* Dec 16 - Employment report, October payrolls down 105k, November unemployment 4.6%, a new cyclical high. - BULLISH FOR BONDS\n\n* Dec 18 - CPI missed expectations. Core CPI 2.6%, lowest since 2021 - BULLISH FOR BONDS\n\n* Since Dec 10, the national average for gasoline prices is down 3+% to $2.88, the lowest since mid-2021. - INCREDIBLY BULLISH FOR BONDS",
    "bias": "Euphoria / Greed",
    "id": "2002028700527993102"
  },
  {
    "user": "@biancoresearch",
    "text": "1/2\n\nThe US 30-year yield over the last few weeks.\n\nThe red line starts at the close on December 9th, the day before the Fed meeting.\n\nThe news for bonds has been very bullish the last two weeks (detailed next), but bonds yields are higher!",
    "bias": "Euphoria / Greed",
    "id": "2002028697591873559"
  },
  {
    "user": "@biancoresearch",
    "text": "The Japanese 10-year yield just hit its highest level this century.",
    "bias": "None",
    "id": "2001881999209070608"
  },
  {
    "user": "@biancoresearch",
    "text": "3/4\n\nAnd they are expected to aggressively hike throughout 2026.",
    "bias": "None",
    "id": "2001843335565316260"
  },
  {
    "user": "@biancoresearch",
    "text": "2/4\n\nSo it should be no surprise the BoJ will hike rates later today at its Monetary Policy meeting.\n\nAs this chart shows. the market is pricing more than a 90% probability they will hike today.",
    "bias": "None",
    "id": "2001843332729966956"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Got Risk Free Returns? \n\nYour Cash Is Getting Killed. Here’s a Pro Move That Stops the Bleeding.   \n\napp.hedgeye.com/insights/175… via @hedgeye",
    "bias": "None",
    "id": "2002369001712767445"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Thanks. It's humbling to see how many people have downloaded my new book - I made that version of it free so as many of The People as possible can compete with the establishment",
    "bias": "None",
    "id": "2002364591955730694"
  },
  {
    "user": "@Leonardo314404",
    "text": "@KeithMcCullough After watching your interview with Ross at Eldridge yesterday then following it up with it on the Early Look this morning I bought CLOZ. 7.7%!!",
    "bias": "None",
    "id": "2002097979331887370"
  },
  {
    "user": "@KeithMcCullough",
    "text": "YouTube \"hedge fund\" managers: 100K subscribers, zero disclosed positions, infinite opinions  \n\nActual hedge fund managers that we do business with: Track record, timestamps, receipts.\n\nEntertainment vs. accountability. Choose wisely",
    "bias": "None",
    "id": "2002098172135682258"
  },
  {
    "user": "@KeithMcCullough",
    "text": "He runs a tiny \"hedge fund\" and is one of the many YouTube and Tik Tok guys telling market stories to uninformed people who wouldn't know otherwise #MacroTourist @SpencerHakimian",
    "bias": "None",
    "id": "2002097272667218167"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Human instinct is just pattern recognition with a recency bias and an emotional overlay. I'll take the fractals.",
    "bias": "None",
    "id": "2002095677120385494"
  },
  {
    "user": "@KeithMcCullough",
    "text": "$UFO +6% today is in agreement with our Signal to buy it back lower this week",
    "bias": "None",
    "id": "2002094477071298672"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The only \"agreement\" I care about is the market's last price",
    "bias": "None",
    "id": "2002094016444444983"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Let me get this straight: I should ditch my fractal math-driven process for \"human instinct\" because some humans disagree with the output?\n\nHard pass. Feelings don't compound. Process does. @MarkNeuman18",
    "bias": "None",
    "id": "2002093794066624666"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Dude, I'm pretty sure you're a competitor asking dumb questions at this point on purpose. The RTA said \"sell-SOME\" in all CAPS after making it one of my biggest Asset Allocations lower",
    "bias": "None",
    "id": "2002092347002081598"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Buds, I don't bluff. I timestamp",
    "bias": "None",
    "id": "2002088630899388724"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Who was the dude who called my Long $IWM position a \"bluff\"? LOL",
    "bias": "None",
    "id": "2002088259317608669"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Our $IWM Asset Allocation is up like 9% in the last 20 days and I had Tourists tweeting at me about it during the 1 correction where they could have got in",
    "bias": "None",
    "id": "2002086527229415642"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Finally got the Buy Signal from Goldman on the Russell \n\n\"$IWM seems to have downside asymmetry\" -Broker Chat",
    "bias": "None",
    "id": "2002086150836764814"
  },
  {
    "user": "@JohnRKamprath",
    "text": "Gladly. The thanks goes to you and your teams. And I express this on behalf of my family, my clients, and my business. Merry Christmas and Happy New Year!",
    "bias": "None",
    "id": "2002063585221202198"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Very thoughtful compliment of my teammates. Thank you for being a great contributor to our community, John. You've been grinding with us for a long time!",
    "bias": "None",
    "id": "2002059453433307574"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Yep, that's how the Hedgeye process works. We have Risk Range™ Signals so that you can buy things on sale and then sell-SOME near the TRR (top-end of the Risk Range™) $SLV #Silver",
    "bias": "None",
    "id": "2002058118222786641"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Google Cloud $GOOG and Palo Alto $PANW expanded their security services partnership, with Palo Alto said to be spending nearly $10 billion on Google Cloud over the next several years. \n\nPalo Alto execs said that a sizable portion of this will go toward new services involving AI.",
    "bias": "None",
    "id": "2002130975342669873"
  },
  {
    "user": "@Beth_Kindig",
    "text": "The WSJ reports that OpenAI's new fundraising round could value the firm at $830 billion, a 66% increase, with an aim of completing the round by Q1 though terms are still subject to change.\n\n$MSFT $AMZN $GOOG $ORCL $NVDA",
    "bias": "None",
    "id": "2002125806043345027"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Meta sits at the center of the AI spending debate, as Big Tech continues to shock markets with outsized AI capex. \n\nYet what the market is overlooking is that Meta is already reporting $60B in AI-driven ARR, second only to Nvidia and showcasing a long-awaited ROI from the AI data center buildout.\n\n$META $NVDA \nio-fund.com/ai-stocks/ai-rev…",
    "bias": "None",
    "id": "2001808048713556315"
  },
  {
    "user": "@Beth_Kindig",
    "text": "US server revenue rose 79.4% YoY in Q3, driven by a 109.9% YoY increase in accelerated server revenue, per IDC, while China server revenue rose 37.6% YoY and represented a fifth of the market. \n\n$NVDA $AMD $SMCI $DELL",
    "bias": "None",
    "id": "2002073137446588521"
  },
  {
    "user": "@Beth_Kindig",
    "text": "At the I/O Fund, our answer to Nvidia vs. Broadcom is simple: yes and yes. \n\nLeadership compounds at the top and radiates outward as demand accelerates exponentially.\n\n$NVDA $AVGO\nio-fund.com/ai-stocks/broadc…",
    "bias": "None",
    "id": "2002120017111097591"
  },
  {
    "user": "@RedDogT3",
    "text": "Sometimes I’m just very Simple!\nThese can make u more money than most analysts!",
    "bias": "None",
    "id": "2002381471709819144"
  },
  {
    "user": "@RedDogT3",
    "text": "It measures speed and commitment to a move as well.",
    "bias": "None",
    "id": "2002380839359828370"
  },
  {
    "user": "@RedDogT3",
    "text": "Hmmmm. I’ll accumulate some Bitcoin monthly like Gold in an asset allocation model for the next Decade. Like 5% \n\nAnd then Buy $IBIT it for active cash flow when it’s above the 8/21day! $IBIT!!  \nWe had a few really nice moves this year",
    "bias": "None",
    "id": "2002380478364393756"
  },
  {
    "user": "@TrendSpider",
    "text": "$SPY equal highs are lookin' JUICY. 🧃",
    "bias": "None",
    "id": "2002151964868772272"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AMZN is building an $11B data center campus in Indiana dedicated to training and inference at scale.\n\nThe site will draw ~2.2 GW of power which is equivalent to powering 1M homes.",
    "bias": "None",
    "id": "2002348670201565510"
  },
  {
    "user": "@IManghaila",
    "text": "WHY TRADERS LOSE THEIR DISCIPLINE.",
    "bias": "None",
    "id": "2002179264112656563"
  },
  {
    "user": "@IManghaila",
    "text": "Jesse Livermore’s Greatest Comebacks\n\n✅ He accepted total losses without excuses\n\n✅ He stepped away to study his own mistakes\n\n✅ He returned with smaller size and stricter rules\n\n✅ He waited patiently for clear market conditions\n\n✅ He pressed hard only when the trend proved him right\n\nReal example\nAfter being wiped out early in his career, Livermore walked away from the market, rebuilt his rules, and returned trading small.\nYears later, during the 1907 Panic, he waited for confirmation of weakness, then sold aggressively after the trend was clear—earning millions while others were reacting emotionally.\n\nThe truth\nLivermore didn’t come back by trading more.\nHe came back by trading better.",
    "bias": "None",
    "id": "2002353605198623024"
  },
  {
    "user": "@RedDogT3",
    "text": "$TSLA shaping up nicely!",
    "bias": "None",
    "id": "2002364417296470489"
  },
  {
    "user": "@RedDogT3",
    "text": "Thanks U Newark Police and Emergency workers for letting CPRF Sponsor such a great event for the families. @CPRFofficial",
    "bias": "None",
    "id": "2002361919617814945"
  },
  {
    "user": "@RedDogT3",
    "text": "Alpha Team VTF® is FREE Monday to Wednesday. \n\nCome trade with me LIVE: t3live.com/at-trial\n\nNames in focus:\n\n$TSLA\n$GLD\n$AMZN\n$POET\n\nAnd MORE! See you bright and early Monday.",
    "bias": "None",
    "id": "2002115489322184921"
  },
  {
    "user": "@JohnTinsman",
    "text": "Strong Balance Sheets, Stronger Potential Growth\n\nWith $188B in free cash flow in 3Q25 and low leverage, hyperscalers are in a different league.\n\n$AOTG targets those with the firepower to keep scaling.\n\nLearn more and view fund holdings at AOTETF.com. $AOTG\n\n$MSFT $AMZN $GOOGL",
    "bias": "None",
    "id": "2002044756595965973"
  },
  {
    "user": "@JohnTinsman",
    "text": "The chart below shows Net Debt/EBITDA for the S&P 500, still near 20-year lows.\n\nEBITDA = Earnings before interest, taxes, depreciation & amortization. A key measure of a company’s operating profitability.\n\nNet Debt/EBITDA tells us how easily companies can repay debt using profits. Lower = stronger financial health.\n\nDespite rate hikes and macro risks, U.S. corporates remain well-positioned, with stronger balance sheets than previous cycles like the Housing or Shale booms.\n\nDistributed by PINE Distributors LLC\n\nETFAC-5037726-12/25",
    "bias": "None",
    "id": "2002105158868570577"
  },
  {
    "user": "@leadlagreport",
    "text": "The most contrarian trade of all is deflation.",
    "bias": "None",
    "id": "2002370375871607027"
  },
  {
    "user": "@leadlagreport",
    "text": "Why Fixed Income Still Matters in a Post-Rate-Cut World via @DynamicAlphaSol \nopen.substack.com/pub/dynami…",
    "bias": "None",
    "id": "2002060328138649641"
  },
  {
    "user": "@leadlagreport",
    "text": "Intermediate-Term Bonds: The Sweet Spot in a Shallow Easing Cycle via @InfraCap \nopen.substack.com/pub/infras…",
    "bias": "None",
    "id": "2002056550018650614"
  },
  {
    "user": "@leadlagreport",
    "text": ".@graniteshares  Announces Weekly Distributions for its YieldBOOST FoFs ETFs: YBST and YBTY open.substack.com/pub/granit…",
    "bias": "None",
    "id": "2002031359200842140"
  },
  {
    "user": "@leadlagreport",
    "text": "Be honest.\n\nHas AI permanently changed your life?",
    "bias": "None",
    "id": "2002028649701089649"
  },
  {
    "user": "@leadlagreport",
    "text": "In 12 months I built Lead-Lag Media into a beast of a company. \n\nMillions in revenue.\n\n30 fund issuers as clients.\n\n250 financial advisors working with me and my incredible team.\n\nNext year I won’t double it.\n\nWe, my team and I, will triple.\n\nWe will not relent.",
    "bias": "None",
    "id": "2002022964921766168"
  },
  {
    "user": "@leadlagreport",
    "text": "I appreciate your honesty.\n\nI usually only block assholes, but I’ll make an exception and block jerks too.",
    "bias": "None",
    "id": "2002021943567139148"
  }
]