[
  {
    "user": "@LizAnnSonders",
    "text": "Joining @SchwabNetwork for #MorningTradeLive around 9:15am ET this morning",
    "bias": "None",
    "id": "1961034135465595150"
  },
  {
    "user": "@elerianm",
    "text": "While on US data, the revisions to the initial University of Michigan sentiment data for August underscore that sense of economic ambiguity that is apparent elsewhere.\nThe headline measure of overall confidence was revised lower, as the decline in the forward-looking component offset an improvement in current conditions.\nOn the inflation front, both one-year and long-term expectations were revised down, with the one-year expectation easing to 4.8% (from 4.9%) and the 5-10 year outlook falling more significantly to 3.5% (from 3.9%).\nBeyond the general signaling of a resilient economy, this mixed data is consistent with the contradictory economic messages coming from other data and sources, including this week’s public statements from Federal Reserve officials (including Governor Waller and NY Fed President Williams).\n#economy #growth #inflation #markets",
    "bias": "Recency Bias",
    "id": "1961454162463379744"
  },
  {
    "user": "@elerianm",
    "text": "In line with consensus forecasts but high if 2% is the Fed’s true inflation target:\n\nUS PCE core inflation, often known as the Federal Reserve’s favorite measure, edged higher to 2.9% in July as the increase in service sector prices picked up to its hottest rate in five months.\n\nThis compositional issue matters as there is concern that the disinflationary effect of the goods sector is unlikely to persist, which may push the core inflation rate above 3%.\n\nMeanwhile, and consistent with the hypothesis of a resilient economy, monthly US consumer spending rose by 0.3%, the highest in four months.\n\n#economy #inflation #growth #markets",
    "bias": "Confirmation Bias",
    "id": "1961418315290603827"
  },
  {
    "user": "@elerianm",
    "text": "Reinforcing its position as one of the world's fastest-growing economies, as well as the fastest-growing large emerging economy, India’s GDP growth of 7.8% in the April-June quarter beat the consensus forecast of 6.7%.\nThis data release comes just after the entry into effect of US secondary tariffs on India, highlighting both the risks to sustaining such an impressive growth rate and the potential cost to the US of sidelining the growing Indian markets.\nThis is yet another example of the trade-off between issues of national security and economic well-being in our current era of intensified geo-economics.\n#economy #markets #india #geoeconomics",
    "bias": "Recency Bias",
    "id": "1961399235028381752"
  },
  {
    "user": "@elerianm",
    "text": "Good morning.\nIt's PCE inflation day in the US, with consensus forecasts anticipating unchanged to a slight uptick in the measures of headline and core (please see below).\nThis data release comes in a week dominated by news about the Federal Reserve—specifically, both notable events that relate to the crucial issue of Fed independence, and the lack of a meaningful market reaction to them.\nThe courts will have their first consideration at 10 a.m. EST this morning of the legal case concerning Governor Cook, which also names the Fed and Chair Powell as defendants.\nMeanwhile, analysts this morning are adding their own twists to Governor Waller’s latest remarks on monetary policy (please see my post from last night). Some interpret his comments as opening the door to the possibility of him supporting a 50 basis point cut in September, while others dismiss this as highly unlikely. A few are treating his economic remarks as part of a political campaign, wondering how other candidates on the administration’s list of eleven to replace Chair Powell will react.\n#economy #markets #federalreserve #inflation",
    "bias": "Loss Aversion",
    "id": "1961376915744305557"
  },
  {
    "user": "@elerianm",
    "text": "“While I judge that the FOMC should have begun this process in July, based on the data in hand, I don't believe that a cut of larger than 25 basis points is needed in September. That view, of course, could change if the employment report for August, due out a week from tomorrow, points to a substantially weakening economy and inflation remains well contained.”\nFrom Governor Christopher Walker’s speech, “Let’s Get On with It:”\nfederalreserve.gov/newsevent…\n#economy #markets #FederalReserve #centralbanks",
    "bias": "Herd / Bandwagon",
    "id": "1961205423987372261"
  },
  {
    "user": "@elerianm",
    "text": "“Debt levels are incredibly high — they are ever-increasing. While in the past, you might have said, ‘So what? Markets will take it,’ that’s not the case any more, even in advanced economies.”\nGita Gopinath, the outgoing First Deputy Managing Director of the International Monetary Fund\n#economy #markets #debt @IMFNews @GitaGopinath",
    "bias": "FOMO",
    "id": "1961148813197934934"
  },
  {
    "user": "@elerianm",
    "text": "Is it too late to save the policy independence of the Federal Reserve? Some thoughts:\n\nfinance.yahoo.com/news/el-er…\n\n#economy #federalreserve #markets #indepedence @YahooFinance",
    "bias": "Herd / Bandwagon",
    "id": "1961131763180188112"
  },
  {
    "user": "@elerianm",
    "text": "From @johnauthers' note, and further to the post from earlier this morning.\n\n#economy #markets @nvidia #nvidia",
    "bias": "None",
    "id": "1961081397059195251"
  },
  {
    "user": "@elerianm",
    "text": "Thank you, @BeckyCNN, for the interesting conversation.\n\n#economy #markets @CNN @cnni #FederalReserve",
    "bias": "None",
    "id": "1961070754029551861"
  },
  {
    "user": "@elerianm",
    "text": "So why are investors in corporate bonds undeterred despite the significant tightening in risk spreads (chart below)?\nThe answer lies in their operational focus on the overall yield—the combined return from the risk spread and the \"safe asset\" component.\nRelative to recent history, this overall yield remains attractive to them, outweighing the signal that tight spreads might otherwise send.\n#economy #investing #investors #markets #bonds",
    "bias": "Recency Bias",
    "id": "1961068050087547385"
  },
  {
    "user": "@elerianm",
    "text": "Further to the prior post, the hypothesis of a resilient US economy just got support from the revised estimate of Q2 GDP for the US.\nThis was increased from 3% to 3.3%, surpassing the consensus forecast of 3.1%. \nThe data beat was driven by a strengthening in exports and gross domestic investment. #economy #growth #marketFu",
    "bias": "Loss Aversion",
    "id": "1961051764892774681"
  },
  {
    "user": "@elerianm",
    "text": "Some insights on the US economy from the latest round of corporate earnings:\nRetailers: Consumer demand remains resilient, including for companies serving lower-income households. While tariffs have increased costs, companies have only partially passed these costs on to consumers. This pass-through is notably uneven across different companies, sectors, and products.\nNvidia: The bedrock of the AI boom remains solid. Both supply and demand for critical AI inputs are robust, and adoption is spreading. The impact on economy-wide variables, particularly productivity, will depend on significantly extending this diffusion in an efficient and scalable manner. (History suggests that the pattern of widespread adoption for general-purpose technologies like AI can vary considerably in terms of speed and evenness.)\n#economy #markets #retailers #nvidia @nvidia #growth #Inflation",
    "bias": "Recency Bias",
    "id": "1961044031229624659"
  },
  {
    "user": "@elerianm",
    "text": "Wonderful night at Citi Field as my beloved Mets completed the sweep of the Phillies, and I got to meet Mr. Met!\n\n #LGM #MrMet #Sweep @Mets @Phillies @MLB @CitiField",
    "bias": "None",
    "id": "1960882429037830461"
  },
  {
    "user": "@morganhousel",
    "text": "Interesting point on why college students are putting less effort into class: courses don't prepare them for real jobs (like they should), so they have to spend more and more time making up the difference after class: \n\ntheatlantic.com/ideas/archiv…",
    "bias": "None",
    "id": "1961089967670853971"
  },
  {
    "user": "@RayDalio",
    "text": "If people treat their problems and opportunities as being shared and they focus on getting the best outcomes for the whole without damaging each other, they will likely get the best possible results.\n\nFor a picture of where we are headed and what we should do, you can order my new book, How Countries Go Broke: The Big Cycle, at the link here: a.co/d/4jpGd3h\n#howcountriesgobroke #principles",
    "bias": "None",
    "id": "1961446560400613545"
  },
  {
    "user": "@RayDalio",
    "text": "Never rule out a goal because you think it's unattainable.",
    "bias": "None",
    "id": "1961109729947914475"
  },
  {
    "user": "@RayDalio",
    "text": "For example, if you come up with something the world values, you almost can't help but be rewarded. Conversely, reality tends to penalize those people, species, and things that don't work well and detract from evolution. #principleoftheday",
    "bias": "Contrarian",
    "id": "1961054854769455389"
  },
  {
    "user": "@barronsonline",
    "text": "Mexico Has Oil. Why It Isn’t an Energy Powerhouse. trib.al/qnisYrP",
    "bias": "None",
    "id": "1961454109178966081"
  },
  {
    "user": "@barronsonline",
    "text": "Quantinuum CEO Weighs In on Quantum Programming and What’s Next for the Industry trib.al/OLYVljB",
    "bias": "None",
    "id": "1961450699394330893"
  },
  {
    "user": "@barronsonline",
    "text": "Why Ambarella Stock Is Up 18% After Earnings trib.al/9xspSvl",
    "bias": "None",
    "id": "1961449584602874150"
  },
  {
    "user": "@barronsonline",
    "text": "Why Does This Crazy Stock Market Keep Ignoring Jack Bogle’s ‘Iron Rule’? trib.al/jwvXPvA",
    "bias": "None",
    "id": "1961446161841106997"
  },
  {
    "user": "@barronsonline",
    "text": "U.S. Stocks Are Expensive, and Still Set to Outperform the World trib.al/SVU4MC1",
    "bias": "None",
    "id": "1961438251480138041"
  },
  {
    "user": "@barronsonline",
    "text": "Cambricon Stock Falls. China’s Hot AI Chip Maker Faces Competition. trib.al/GA2MyQO",
    "bias": "None",
    "id": "1961434851170529603"
  },
  {
    "user": "@barronsonline",
    "text": "Citadel COO Dishes on His Three Decades Working with Ken Griffin trib.al/7bCh2ao",
    "bias": "None",
    "id": "1961421254742667710"
  },
  {
    "user": "@barronsonline",
    "text": "Ford Stock Can’t Catch a Break. The Recalls Just Keep Coming trib.al/ZxONByE",
    "bias": "None",
    "id": "1961420123903853048"
  },
  {
    "user": "@barronsonline",
    "text": "IREN Stock Is Climbing 21%. Here’s How Nvidia Is Playing a Part. trib.al/DiZjIdr",
    "bias": "None",
    "id": "1961418990590337212"
  },
  {
    "user": "@barronsonline",
    "text": "Falling Rates Breathe Life Into Regional Banking Stocks. What the Charts Are Saying. trib.al/glluHbu",
    "bias": "FOMO",
    "id": "1961413342909567248"
  },
  {
    "user": "@barronsonline",
    "text": "Marvell Stock Tumbles. Why the AI Chip Player Keeps Disappointing the Market. trib.al/03bQSTU",
    "bias": "None",
    "id": "1961405398881128732"
  },
  {
    "user": "@barronsonline",
    "text": "Tesla Stock Falls. Legal Filings Show Where Elon Musk Spends His Time. trib.al/9u2auYZ",
    "bias": "None",
    "id": "1961395196454658234"
  },
  {
    "user": "@barronsonline",
    "text": "Celsius Stock Is Spiking After PepsiCo Increases Stake trib.al/5U0xjvL",
    "bias": "Euphoria / Greed",
    "id": "1961394062344257682"
  },
  {
    "user": "@barronsonline",
    "text": "Autodesk Stock Is Rising. Why Wall Street Is Pleased With Earnings. trib.al/FlpfjEA",
    "bias": "None",
    "id": "1961390685904408869"
  },
  {
    "user": "@barronsonline",
    "text": "Caterpillar Stock Drops as It Resizes Tariff Hit. Why Wall Street Isn’t Worried. trib.al/jpzCzTL",
    "bias": "None",
    "id": "1961381636206944592"
  },
  {
    "user": "@barronsonline",
    "text": "Elastic Stock Soars on Earnings. Here’s What Analysts Are Saying. trib.al/ygPztjI",
    "bias": "None",
    "id": "1961377059055296966"
  },
  {
    "user": "@barronsonline",
    "text": "Stock Markets Hit Records Amid Fed Attacks, Nvidia Concerns, Tariff Fears. 3 Reasons Why. trib.al/P0nfUsw",
    "bias": "Panic / Capitulation",
    "id": "1961374811319394689"
  },
  {
    "user": "@barronsonline",
    "text": "Ozempic Maker Novo Nordisk Is a Problem as Denmark’s Economy Hits a Wall trib.al/k2quTkK",
    "bias": "None",
    "id": "1961371440332013744"
  },
  {
    "user": "@barronsonline",
    "text": "Nvidia Stock Slips. Wall Street Loved Its Earnings But This Big Concern Remains. trib.al/trzY8M0",
    "bias": "None",
    "id": "1961363483116601358"
  },
  {
    "user": "@barronsonline",
    "text": "These Stocks Are Moving the Most Today: Marvell, Dell, Nvidia, Alibaba, Affirm, Autodesk, Elastic, and More trib.al/mmXTUwm",
    "bias": "None",
    "id": "1961362343138402491"
  },
  {
    "user": "@matt_levine",
    "text": "This is a disgusting way for readers to learn about Money Stuff — through a botched email instead of a respectful conversation. bloomberg.com/opinion/newsle…",
    "bias": "Herd / Bandwagon",
    "id": "1961131887440560278"
  },
  {
    "user": "@IrnestKaplan",
    "text": "Gartner predicts that Cloud Spend will more than double over the next four years, compounding at 20% from 2004 to 2008.\n\nWe have invested in top-tier software companies that are benefiting from this secular trend.",
    "bias": "Herd / Bandwagon",
    "id": "1961427204778119466"
  },
  {
    "user": "@saxena_puru",
    "text": "Super grateful for such feedback 🙏 \n\nGlad our work is making a difference!\n\nHuge credit to our analysts @BleedingEdgeAM @IrnestKaplan @DamiaOthman @BjerkeOy who work alongside me to deliver actionable research.",
    "bias": "None",
    "id": "1961261335942988256"
  },
  {
    "user": "@saxena_puru",
    "text": "Results speak louder than words. \n\nOur talented team works tirelessly to uncover disruptive opportunities and our subscribers are seeing the ROI.",
    "bias": "None",
    "id": "1961258637361390016"
  },
  {
    "user": "@saxena_puru",
    "text": "Grateful for the feedback 🙏\n\nAlphaTarget is a team effort and I'm super happy our research is making a difference.",
    "bias": "Confirmation Bias",
    "id": "1961247011769852379"
  },
  {
    "user": "@saxena_puru",
    "text": "Many growth stocks hit turbulence in Q3, but this bull market is less than 5 months old.\n\nWith Fed cuts on the horizon and the AI boom underway, Q4 and Q1 look strong for equities.\n\nWe’re invested in disruptive leaders - ready for the opportunity. \n\n🔗 alphatarget.com",
    "bias": "Confirmation Bias",
    "id": "1961133241886245046"
  },
  {
    "user": "@saxena_puru",
    "text": "AI data centre CapEx is booming but it’s cyclical - growth will eventually slow post buildout. \n\nMeanwhile, AI agents are just starting and inference workloads will drive compounding recurring revenue. \n\nThe opportunity is also in software, not just in chips.",
    "bias": "None",
    "id": "1961076151574470851"
  },
  {
    "user": "@saxena_puru",
    "text": "Market realising AI isn't going to kill all software firms. \n\nAI agents deployed by infrastructure software vendors will likely accelerate growth and improve margins.",
    "bias": "None",
    "id": "1961074087897280748"
  },
  {
    "user": "@DamiaOthman",
    "text": "$NVDA data centre revenue rose to US$41.1 billion (+56% YoY, +5% QoQ) in Q2 FY 2026, but came in below consensus estimates.\n\nBlackwell Data Centre revenue grew 17% QoQ.\n\nGroup revenue grew to US$46.7 million (+56% YoY, +6% QoQ).",
    "bias": "None",
    "id": "1961035786499072425"
  },
  {
    "user": "@saxena_puru",
    "text": "AI was supposed to eat software companies. Instead, consumption-based infrastructure software vendors are seeing accelerating revenue growth. \n\nAI is becoming a tailwind (not an existential threat) for quality software firms.",
    "bias": "Contrarian",
    "id": "1960865579209822618"
  },
  {
    "user": "@BitcoinMagazine",
    "text": "JUST IN: Former Coinbase CTO Balaji Srinivasan says, “When #Bitcoin wins, real estate falls in real terms.”\n\n“People stop using houses as an investment and they invest in BTC.” 🙌",
    "bias": "Herd / Bandwagon",
    "id": "1960990324794523671"
  },
  {
    "user": "@elonmusk",
    "text": "Try @Grok Code V1.0 and let us know what needs to improve. \n\nWill evolve fast to meet your needs.",
    "bias": "None",
    "id": "1961182222570197220"
  },
  {
    "user": "@benshapiro",
    "text": "The shooter was a transgender regret case. \n\nThe day before this shooting, we exposed the American Medical Association’s negligence on regret data. The morning of, we exposed the AMA’s ‘trans expert’ admitting there’s no true psychiatric assessment done before transing a kid. 🧵",
    "bias": "Overconfidence",
    "id": "1961454237365256602"
  },
  {
    "user": "@RupertLowe10",
    "text": "Sense from the Americans. \n\n@JDVance telling Brits to 'push back against the crazies' offended by our flag.\n\nConsider it done.",
    "bias": "None",
    "id": "1961363495624077706"
  },
  {
    "user": "@disclosetv",
    "text": "NEW - All parties except the AfD have pledged to speak \"only positively about migration\" in the upcoming local election campaign in the West German city of Cologne.",
    "bias": "None",
    "id": "1961324940663148985"
  },
  {
    "user": "@Inevitablewest",
    "text": "🚨BREAKING: JD Vance endorses viral \"Raise the Colours\" operation and calls for Brits to push back against those offended by the flag \n\nThe fight back is ramping up… 🏴󠁧󠁢󠁥󠁮󠁧󠁿",
    "bias": "Herd / Bandwagon",
    "id": "1961362294161449027"
  },
  {
    "user": "@AllisonPearson",
    "text": "There are some explosive moments in history where a bright illuminating light is cast over the land and we see things for what they truly are.\n The Home Office defeating the people of Epping and denying them the right to protect their kids against illegal aliens is that moment.",
    "bias": "None",
    "id": "1961430887913955819"
  },
  {
    "user": "@RupertLowe10",
    "text": "The Home Office wins its Epping appeal. \n\nA Government against its own people.",
    "bias": "None",
    "id": "1961420637479522755"
  },
  {
    "user": "@RobertJenrick",
    "text": "This is an extremely disappointing decision.\n\nYvette Cooper used taxpayer money - your money - to keep open a hotel housing illegal migrants. \n\nThe Government’s lawyers argued accommodating illegal migrants was in the “national interest”.\n\nIn court they said the right of illegal migrants to free hotels is more important than the rights of the British people. \n\nWell, they are not. \n\nThe British Government should always put the interests of the British people first. Starmer’s Government has shown itself to be on the side of illegal migrants who have broken into our county.  \n\nBut this is not a free pass for asylum hotels. Councils can and should still act to close hotels. If they don’t, residents will rightly ask, on whose side are they?\n\nMy team and @LawForBorders will continue to provide legal assistance to help protect communities.\n\nThere is no acceptable accommodation for illegal migrants. The Government should be prioritising Brits in need and deporting every illegal migrant, as the last Government should have done and I've argued for years.",
    "bias": "None",
    "id": "1961422780110459189"
  },
  {
    "user": "@elonmusk",
    "text": "In order to survive, an ideology that fails to reproduce itself must necessarily infect the minds of the children of those who do reproduce.\n\nThat’s why they push so hard to control education.\n\nIt is a vampire cult.",
    "bias": "None",
    "id": "1961452078423036196"
  },
  {
    "user": "@RupertLowe10",
    "text": "Abolish the Home Office and start again.\n\nA new department, staffed with British patriots who believe in secure borders and mass deportations.",
    "bias": "None",
    "id": "1961430063036928219"
  },
  {
    "user": "@elonmusk",
    "text": "⚔️",
    "bias": "None",
    "id": "1961450411669557750"
  },
  {
    "user": "@elonmusk",
    "text": "Tesla Master Plan Part Deux will be complete next year. \n\nMaster Plan 3 was too complex for almost anyone to understand, but described how all of Earth could move to sustainable energy.\n\nMaster Plan 4 will be concise.",
    "bias": "None",
    "id": "1961450257176502656"
  },
  {
    "user": "@house_of_trad",
    "text": "They’re all going the same direction",
    "bias": "None",
    "id": "1961446322403242437"
  },
  {
    "user": "@elonmusk",
    "text": "A nation with a government against its people shall perish from the Earth",
    "bias": "None",
    "id": "1961446173182759020"
  },
  {
    "user": "@PeterSweden7",
    "text": "Britain.\n\n1. An as*lum seeker s*xually assaulted a 14 year old girl in Epping.\n\n2. Upset locals organized massive protests to shut down the hotel housing them.\n\n3. The local council decided to close the as*lum seeker hotel.\n\n4. The government used tax payers money to take the council to court.\n\n5. Government lawyers said the rights of as*lum seekers was more important than locals.\n\n6. The court ruled in favor of the government.\n\n7. The hotel will remain open and continue to house as*lum seekers.\n\nSo they used tax payers money to argue for the right to use more tax payers money to house people in the country in free hotels.\n\nMeanwhile locals are struggling to get by with massive inflation costs.",
    "bias": "None",
    "id": "1961425626079871022"
  },
  {
    "user": "@elonmusk",
    "text": "As goes Epping, so goes all of England.\n\n🏴󠁧󠁢󠁥󠁮󠁧󠁿 🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿🏴󠁧󠁢󠁥󠁮󠁧󠁿",
    "bias": "None",
    "id": "1961445400327672034"
  },
  {
    "user": "@libsoftiktok",
    "text": "The Democratic Party grooms kids into being transgender and turns them into radical lgbtq t*rrorists",
    "bias": "None",
    "id": "1961072949340913683"
  },
  {
    "user": "@GoodwinMJ",
    "text": "Outrageous. Lawyers for the Epping Hotel have argued “the perceived risk” of housing illegal migrants is being “fuelled by disinformation on social media”. A reminder:\n\n—the sexual assault of a 14-year-old girl by an Ethiopian asylum-seeker in Epping, who said he wanted to make “Jamaican babies”,  is not “disinformation” \n\n—the kidnap, strangulation and r*pe of a 12-year-old girl in Nuneaton is not “disinformation”\n\n—the r*pe of a 12-year-old by a Syrian illegal migrant in Birmingham is not “disinformation”\n\n-the attempted kidnapping of a 10-year-old in Stockport by an asylum-seeker from Sudan is not “disinformation”\n\n—the r*pe of an 8-year-old in Lambeth by an asylum-seeker from Pakistan is not “disinformation”\n\n—the murder of a pensioner in Hartlepool, Terence Carney, by an asylum-seeker from Morocco is not “disinformation”\n\n—the murder of a young British man, Thomas Roberts, by an asylum-seeker from Afghanistan is not “disinformation”\n\nIn fact, the only people who have been spreading “disinformation” is the state itself which not only imported thousands of people from Afghanistan while gagging the UK press, hiding it from British citizens and charging them billions for the privilege but not consistently gaslights us by reframing real world events as “disinformation” \n\nPeople are so sick and tired of this",
    "bias": "Herd / Bandwagon",
    "id": "1961028744816017456"
  },
  {
    "user": "@RachelA1892",
    "text": "\"A government against its people.\"\n\nElon Musk has summed up Starmer's government in one phrase.\n\nStarmer is not for the British.",
    "bias": "None",
    "id": "1961140952229200306"
  },
  {
    "user": "@amXFreeze",
    "text": "Zuckerberg pours billions to poach some of the best ones in the world\n\nthan Elon offers them a real purpose and gets them all on board...\n\nEverybody knows that you can only trust Elon and only he does the unthinkable and he's the best leader\n\nonly xAI has a real shot at AGI with Elon steering it\n\nElon built the most powerful AI with the smallest team in the world, and now they're about to witness something even bigger\n\nHow could they not want to be a part of it?",
    "bias": "None",
    "id": "1961112556400943320"
  },
  {
    "user": "@elonmusk",
    "text": "Grok automatically chooses the right mode for your request",
    "bias": "None",
    "id": "1961348596407636065"
  },
  {
    "user": "@barnabemonnot",
    "text": "Pleased to share our \"Improve UX\" track update!\n\nTL;DR: High focus on interop. Build out and strengthen intent-based infrastructure, preparing the ground for fast and trust-minimised backends. Drive down costs and latency with a focus on faster and stronger settlement on L1 and for L2s.\n\nThe projects feature a mix of coordinating additive initiatives, delivering new infra and products, as well as accelerating deeper protocol changes, with contributions from EF teams and the wider ecosystem. Thank you all for comments and discussions leading to this update!\n\nWhile our own focus will be on interop, we highlight two additional initiatives, Trillion Dollar Security and the Kohaku privacy wallet, addressing further gaps in UX. \n\nFind more details in the post linked below 👇",
    "bias": "Euphoria / Greed",
    "id": "1961371058012922041"
  },
  {
    "user": "@paulg",
    "text": "An interesting insight from inside Twitter:",
    "bias": "None",
    "id": "1961433431348306301"
  },
  {
    "user": "@ReichlinMelnick",
    "text": "DC has become a “papers, please” city under Trump, with masked agents demanding residents show their IDs at random locations around the city.",
    "bias": "None",
    "id": "1961222277380321789"
  },
  {
    "user": "@ycombinator",
    "text": "OpenAI recently released its first open-weights model since GPT-2, entering a field led by DeepSeek and Alibaba's Qwen.\n\nAnkit (@GuptaAnkitV) breaks down these top OSS models, including what sets them apart under the hood: mixture-of-experts, long-context training, and post-training techniques that shape reasoning and alignment—and how different design choices lead to surprisingly similar performance.\n\n00:00 – OpenAI OSS Launch\n01:00 – Comparing Open Source LLM Architectures\n01:46 – GPT OSS Overview\n02:37 – Under The Hood of GPT OSS\n03:25 – Qwen-3 Architecture\n04:17 – Qwen-3 Training\n05:12 – Qwen-3 Post-Training\n06:08 – Qwen-3 Reasoning & RL Innovations\n06:52 – DeepSeek V3 Overview\n07:40 – DeepSeek V3.1 Updates\n08:39 – Attention Mechanism (MLA)\n09:39 – Comparing Model Sizes\n10:35 – Long Context Strategies\n11:25 – Reflections on Methods\n12:00 – Takeaways",
    "bias": "Overconfidence",
    "id": "1961429173358272714"
  },
  {
    "user": "@paulg",
    "text": "This still happens.",
    "bias": "None",
    "id": "1961278031915319313"
  },
  {
    "user": "@AlecStapp",
    "text": "This should be a wake-up call for US policymakers:",
    "bias": "None",
    "id": "1961236085432078504"
  },
  {
    "user": "@EricTopol",
    "text": "A randomized trial of eye care by ophthalmologists with A.I. vs ophthalmologists without A.I.  demonstrated much higher accuracy in diagnosis (92 vs 74%) and many other improved outcomes @NatureMedicine\nnature.com/articles/s41591-0…",
    "bias": "Confirmation Bias",
    "id": "1961065189316362724"
  },
  {
    "user": "@paulg",
    "text": "ICE literally arrested firefighters in the process of fighting a fire. If a dystopian comedy included this scenario, people would dismiss it as unrealistic.",
    "bias": "FOMO",
    "id": "1961170613525229826"
  },
  {
    "user": "@Noahpinion",
    "text": "We gave this man the power to cancel our cancer treatments",
    "bias": "None",
    "id": "1961135177348071579"
  },
  {
    "user": "@SenMarkKelly",
    "text": "Cindy McCain is right. Kids are starving in Gaza. It doesn’t have to be like this.\n\nI’ve been working to get food where it’s needed in Gaza. Thank you to the @WFP for your work to save lives.",
    "bias": "None",
    "id": "1961152582245654917"
  },
  {
    "user": "@gilbert",
    "text": "I asked @paultoo how they came up with the idea for Gmail to use an invite-only waitlist. (Which was essentially the first software ever to do that!)\n\nHis response:\n\n(Posted with permission)",
    "bias": "None",
    "id": "1961093439434739835"
  },
  {
    "user": "@paulg",
    "text": "Usually it's more convenient to read modern reprints of old books, but I'm really enjoying the 1721 edition of Addison's works. It's very cleanly printed.",
    "bias": "None",
    "id": "1961145191534137378"
  },
  {
    "user": "@MattGertz",
    "text": "The sort of image which, if you predicted it would come to pass last October, people would have accused you of having Trump Derangement Syndrome.",
    "bias": "Confirmation Bias",
    "id": "1961105522448593222"
  },
  {
    "user": "@paulg",
    "text": "Obviously the best case is someone who's both driven to build things and technically proficient. But those are far from orthogonal, because building things is the usual way to become proficient.",
    "bias": "None",
    "id": "1961121491161887233"
  },
  {
    "user": "@paulg",
    "text": "I should be more precise about what I mean by good at programming. I mean good in the sense of productive, rather than merely proficient. So someone who's driven to build things has less to fear from AI than someone who's competent but indifferent.",
    "bias": "FOMO",
    "id": "1961120252642590919"
  },
  {
    "user": "@paulg",
    "text": "People who are good at programming will use AI to take the jobs of those who are mediocre at it. So you should study CS iff you're going to be good at it.",
    "bias": "None",
    "id": "1961114580328812616"
  },
  {
    "user": "@paulg",
    "text": "Two important principles that have a lot in common:\n\nIf you make users love you, investors will love you too.\n\nIf the people lead, the leaders will follow.",
    "bias": "None",
    "id": "1961101566418833727"
  },
  {
    "user": "@Hollywood41x",
    "text": "This interview is worth watching.",
    "bias": "None",
    "id": "1961419619429748899"
  },
  {
    "user": "@laurashin",
    "text": "Is Coinbase quietly building DeFi’s most powerful moat? 👀\n\nOn @unchained_pod, @wagmiAlexander & @LukeYoungblood dive into:\n📈 How Base is becoming the launchpad for new tokens\n🏦 Coinbase as the crypto bank anyone can access with an ETH key\n🌶️ How Uniswap benefits from fragmented liquidity\n💸 Whether DeFi apps are overpaying with incentives\n\nTimestamps:\n🎬 0:00 Intro\n👥 2:56 Why Alex and Luke aligned early with Base, \n📢 6:32 How Coinbase is positioning itself as the distribution partner of the onchain economy\n⚖️ 21:12 Whether exchanges should be the ones deciding what assets people can trade\n🌱 33:15 How DeFi needs to evolve to reward token holders sustainably\n💧 41:32 Whether liquidity fragmentation is actually a feature, not a bug, for Uniswap\n💸 57:50 How Moonwell and Aerodrome justify issuing more incentives than they currently earn in revenue",
    "bias": "FOMO",
    "id": "1961412806479106432"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n⚖️ CFTC gives offshore crypto exchanges a way home\n📉 U.S. GDP data lands directly on blockchains\n🚀 Tether plans USDT transactions on Bitcoin\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Herd / Bandwagon",
    "id": "1961383977811407113"
  },
  {
    "user": "@Unchained_pod",
    "text": "Ready for fall and whatever chaos comes our way",
    "bias": "None",
    "id": "1961182681703825688"
  },
  {
    "user": "@laurashin",
    "text": "Many teams claim Binance squeezes them for tokens just to list 😬\n\nBut there’s a new sheriff in town 👮\n\n@jon_charb says Hyperliquid changes that. \n\nPermissionless, liquid, and user-first.",
    "bias": "Herd / Bandwagon",
    "id": "1961111709726175453"
  },
  {
    "user": "@peterhansVC",
    "text": "It was great speaking with @laurashin on one of my favorite podcasts @Unchained_pod - I got started in crypto by mining ETH almost 10 yrs ago, and it's latest move is a great example of narrative power and the economic influence of tradfi",
    "bias": "Recency Bias",
    "id": "1961084246367289786"
  },
  {
    "user": "@laurashin",
    "text": "ETH was ‘a dinosaur’ just months ago 🦕\n\nNow TradFi calls it the settlement layer of the internet.\n\nHack VC’s Peter Hans (@peterhansVC)  on how ETH’s narrative flipped overnight 🔄",
    "bias": "None",
    "id": "1961036224551899179"
  },
  {
    "user": "@laurashin",
    "text": "In today’s Unchained Daily: \n• 💥 XPL short squeeze nets $48M on Hyperliquid\n• ⚡ Tron’s fee-cut proposal races toward approval\n• 🏛️ Aave pushes into RWAs with Horizon platform\n\n🎯 Read it now… and make sure you never miss one. Subscribe!\nunchainedcrypto.beehiiv.com/…",
    "bias": "Herd / Bandwagon",
    "id": "1961021020292129245"
  },
  {
    "user": "@CryptoWendyO",
    "text": "LO just walked into my studio to ask me permission to do something. \n\nShe clearly explained:\n\n- why she wanted to do the thing\n- addressed my concerns \n- agreed we can discuss later and that she will make a PowerPoint to reaffirm her stance \n\nKids are so rad!",
    "bias": "Euphoria / Greed",
    "id": "1961439950823723094"
  },
  {
    "user": "@brave",
    "text": "⚠️One careless click can jeopardize your financial security.\n\nOn the newest #TheBraveTechnologist episode, cryptocurrency analyst @CryptoWendyO explains how to protect your wealth.\n\nCheck out the full episode, recorded at @RareEvo, now: brave.com/podcast/e85/",
    "bias": "Herd / Bandwagon",
    "id": "1961437117160001950"
  },
  {
    "user": "@CryptoWendyO",
    "text": "C A R D A N O",
    "bias": "None",
    "id": "1961432129675645419"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Yesterday was a dream. \n\nThe Whitehouse, blockchain and the CFTC. \n\nIconic",
    "bias": "Recency Bias",
    "id": "1961415474614603900"
  },
  {
    "user": "@deadpixels_club",
    "text": "Free mint giveaway and game time 👻\n\nLike/retweet/follow @deadpixels_club, @Will_DPGC\n\nWe won't refill the mint pool until a gold ghosts is minted so chances of pulling one increases after every mint.\n\nYou can mint a ghost right now, here: sentx.io/forevermint/dead-pi… #HBARbarians",
    "bias": "None",
    "id": "1961386967255695605"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Imagine once ALL of these crypto ETPs are approved. \n\nThe amount of liquidity will be worth the short term non Bull market feelings.",
    "bias": "Confirmation Bias",
    "id": "1961265505978712084"
  },
  {
    "user": "@CryptoWendyO",
    "text": "WE ARE GETTING CANCELED LIVE",
    "bias": "None",
    "id": "1961218820510515590"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Ethereum is the Wall Street Token.",
    "bias": "Herd / Bandwagon",
    "id": "1961202842980479253"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Chat… \n\nUP or DOWN?",
    "bias": "None",
    "id": "1961208002020806666"
  },
  {
    "user": "@CryptoWendyO",
    "text": "IM STILL IN SHOCK!\n\nCATCH THE REPLAY! \n\npiped.video/live/2gqJuzag6u0…",
    "bias": "None",
    "id": "1961201628629131436"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Aleo is a Layer-1 blockchain that is zero-knowledge by design with privacy built-in.\n\nGlobal Dollar Network is a stablecoin ecosystem supported by some of the most influential names in digital finance and payments, including Anchorage Digital, Bullish, Kraken, OKX, Paxos, Robinhood, Worldpay, and more.\n\nOur partners at @AleoHQ are now the first privacy focused Layer-1 to join the Global Dollar Network with the goal of making privacy the new standard.\n\nAt its core is Global Dollar (USDG), a U.S. dollar–backed stablecoin issued by Paxos and trusted for compliance, transparency, and rigorous financial standards.\n\nThis partnership between Aleo and Global Dollar Network brings a strong focus on private payments, encrypted transactions, and fills a major gap in today’s stablecoin ecosystem.",
    "bias": "Loss Aversion",
    "id": "1961177336373530861"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I just at this canned spicy tuna that is viral on tiktok so you don’t have to. 🧵",
    "bias": "Herd / Bandwagon",
    "id": "1961157624348676098"
  },
  {
    "user": "@CryptoWendyO",
    "text": "AND YOU ARE BEARISH ON CRYPTO",
    "bias": "Panic / Capitulation",
    "id": "1961141690733052281"
  },
  {
    "user": "@CryptoWendyO",
    "text": "U.S. Department Of Commerce Partners With Chainlink And Pyth\n\nThe U.S. Department of Commerce partnered with Chainlink and Pyth to publish official economic data on the blockchain.\n\nThe data includes GDP, the PCE Price Index, and Real Final Sales metrics.\n\nChainlink’s tech will initially delivers these data feeds across ten chains: Arbitrum, Avalanche, Base, Botanix, Ethereum, Linea, Mantle, Optimism, Sonic, and zkSync.\n\nPyth will provide quarterly GDP data going back five years.\n\nAdditionally, the department announced that it has already published official hashes of its quarterly GDP data for 2025 on Bitcoin, Ethereum, Solana, TRON, Stellar, Avalanche, Arbitrum One, Polygon PoS, and Optimism.\n\nCoinbase, Gemini, and Kraken helped facilitate the data publishing.\n\nSources: U.S. Department of Commerce + Coindesk",
    "bias": "Herd / Bandwagon",
    "id": "1961135470827413531"
  },
  {
    "user": "@CryptoWendyO",
    "text": "MASSIVE IF TRUE\n\nIF TRUE IM EVEN MORE OVER STIMULATED AND NEED MANY CHEESE STICKS !",
    "bias": "None",
    "id": "1961130150634098756"
  },
  {
    "user": "@CryptoWendyO",
    "text": "IMAGINE USING @binance AGAIN IN 2025!\n\nINSANE! \n\nI can't wait to hear more on how this will happen and who is allowed access!",
    "bias": "None",
    "id": "1961126923146547475"
  },
  {
    "user": "@CryptoWendyO",
    "text": "I’m absolutely speechless in a good way. \n\nWow. \n\nWOW \n\nHIGHER!",
    "bias": "Euphoria / Greed",
    "id": "1961116818015490404"
  },
  {
    "user": "@CryptoWendyO",
    "text": "Crypto things you might have missed:\n\n-Multiple cryptos just got US government backing!\n-XRP is mainstream💥\n-ETH is \"the Wall Street token\"\n-Big @vechainofficial and Sui news just dropped\n-JPMorgan says BTC is undervalued VS gold\n-Tether to launch USDT on Bitcoin\n\nLINK IN BIO",
    "bias": "Herd / Bandwagon",
    "id": "1961109759471620444"
  },
  {
    "user": "@CryptoWendyO",
    "text": "CHAINLINK is the ticker of the day for fundamental reasons.",
    "bias": "None",
    "id": "1961068330485506206"
  }
]