[
  {
    "user": "@StockSavvyShay",
    "text": "Futurum Equities Podcast | Episode #28 | $MU, $NBIS, $VRT, $IREN, $CIFR, $WULF, $AMD, $INTC, $LRCX, $NVTS, $ASTS, $RKLB, $JOBY, $KTOS, $ONDS, $SYM, $HOOD, $OPEN, $CVNA, $LMND, $PGY, $OKLO, $EOSE, $UUUU, $MP, $QS, $PLTR, $TMDX, $QURE, $QBTS nitter.net/i/broadcasts/1mrGmBaym…",
    "bias": "None",
    "id": "2014353937844076584"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$MSFT CEO Satya Nadella is effectively calling the end of software applications as the value layer.\n\nIn an agentic world, apps become passive databases while AI agents hold the intelligence, make decisions & do the work \n\nApps become commodities while agents become the business.",
    "bias": "None",
    "id": "2014322868436513029"
  },
  {
    "user": "@StockSavvyShay",
    "text": "If you put $10K into $ONDS at the April tariff lows, that position would be worth over $175K today.",
    "bias": "None",
    "id": "2014317660067303553"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$PYPL is acquiring Cymbio to accelerate agentic commerce making merchant catalogs discoverable directly inside AI platforms like like $MSFT Copilot, $GOOGL Gemini, Perplexity & ChatGPT.  \n\nThe deal embeds AI-driven ordering directly into PayPal’s Store Sync & fulfillment stack.",
    "bias": "None",
    "id": "2014312129017659677"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$ASTS has scheduled the BlueBird 7 launch for late February aboard Blue Origin’s New Glenn marking the vehicle’s first flight & enabling up to eight Block 2 BlueBirds per mission.\n\nWith launches planned every one to two months in 2026 AST is targeting 45–60 satellites deployed by year end.",
    "bias": "None",
    "id": "2014309646996234421"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$RKLB just sent its first Electron mission of the year “The Cosmos Will See You Now” to space.",
    "bias": "None",
    "id": "2014300221673820371"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$RKLB said a Neutron Stage 1 tank ruptured during a hydrostatic pressure qualification test after being pushed past design limits with no significant damage to the facilities & the next tank already in production.\n\nThe program continues as planned while data is reviewed.",
    "bias": "None",
    "id": "2014128809952624987"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$LMND announced a 50% insurance rate cut for $TSLA drivers when FSD is active citing data that shows materially fewer accidents.\n\nThat’s one of the clearest third-party validations of FSD risk reduction so far.",
    "bias": "None",
    "id": "2014084020326277593"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$AAPL plans to relaunch Siri as its first true AI chatbot Campos in 2H 2026 with an unveiling expected in June and a September release.\n\nApple is considering running Campos on $GOOGL Cloud using TPUs and Gemini models signaling a shortcut to scale its AI capabilities faster.",
    "bias": "None",
    "id": "2014066355452928362"
  },
  {
    "user": "@CarterBWorth",
    "text": "The day-to-day spread between semiconductor stocks (performing well) and software stocks (performing poorly) is reaching extreme readings... in the context of week-over-week and month-over-month readings that also are increasingly extreme.\n\nAt the time of this writing, we believe it is right for traders and others who are shorter term in nature, to be contrarian here and fade the winning theme (semiconductors) and embrace the losing theme (software).\n\nTo be sure, laying on this bet requires nimbleness, dexterity and timing, but our work suggests the timing is right.\n\nFor those who are adroit, deft and believe they have the pluck to “pull it off” we recommend getting in motion, now.\n\nThe vehicles to use:\n\nLong iShares Expanded Tech-Software ETF (IGV) / Short iShares Semiconductor ETF (SOXX)\n\nAnd just as this trade requires/will require alacrity and speed to “take a quick, smart profit” if and as one presents itself, this trade also requires alacrity and speed if and as the spread widens further (rather than contracts) and one is stopped out and forced to exit with a loss.\n\nAnd stops, as all will know, are personal.  Levels of tolerance, pain, and discipline are unique to each firm, each book, each individual.\n\nTrade well (trade this one especially well)...\n\n-Carter\n\nWebsite: worthcharting.com",
    "bias": "None",
    "id": "2014114713181806635"
  },
  {
    "user": "@CNBCFastMoney",
    "text": "Software stocks have underperformed semis since October, but the Chartmaster @carterbworth says it might be a good setup for a pairs trade.\n\n$IGV $XLK $SOXX\n\ncnbc.com/video/2026/01/21/ch…",
    "bias": "None",
    "id": "2014102631195553905"
  },
  {
    "user": "@jonnajarian",
    "text": "A wide-ranging conversation moderated/hosted by Larry Fink, where Alex Karp discussed AI's transformative impact, job markets, immigration, Europe's tech lag, civil liberties, and Palantir's role in various sectors such as healthcare & defense.",
    "bias": "None",
    "id": "2014307437113671831"
  },
  {
    "user": "@jonnajarian",
    "text": "OK, was this Mossad or God?",
    "bias": "None",
    "id": "2014306682415829468"
  },
  {
    "user": "@jonnajarian",
    "text": "Coffee in Paris 🇫🇷and 🏈 NAJARIAN SPORTS 🏴‍☠️ with @petenajarian more on @MarketRebels 1pm EST",
    "bias": "None",
    "id": "2014302547440214181"
  },
  {
    "user": "@MarketRebels",
    "text": "#VIX 16.10 #10YEAR 4.25% 🥶 Good Day Traders!",
    "bias": "Panic / Capitulation",
    "id": "2014301955393286575"
  },
  {
    "user": "@jonnajarian",
    "text": "I mean just look at all the PU**IES he's grabbing!",
    "bias": "None",
    "id": "2014289980055494734"
  },
  {
    "user": "@jonnajarian",
    "text": "A fantastic speaker for the @cuboplus Class of 2026 Saifedean Ammous @saifedean ..\n @stacyherbert doing great work in El Salvador 🇸🇻 Bang! 💥",
    "bias": "None",
    "id": "2014082238485328369"
  },
  {
    "user": "@jonnajarian",
    "text": "Amelia going hard again against status quo in the UK",
    "bias": "None",
    "id": "2013998288005898385"
  },
  {
    "user": "@jonnajarian",
    "text": "I'm counting on it Charlie",
    "bias": "None",
    "id": "2013990920962670818"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 $META & $TSLA “WOKE UP”… OR JUST ANOTHER TRAP?\n\nMeta and #Tesla bounced with some relative strength, but both are running into key resistance near short-term moving averages.\n\nIn this short video, I discuss their key resistance levels, why these moves are range trades, and how to manage risk without chasing strength.",
    "bias": "None",
    "id": "2014338168988803242"
  },
  {
    "user": "@RedDogT3",
    "text": "Hey @traderstewie your Peg Play $MU paying off huge. Some in our community use that tactic as well. Today, makes sure to Trim some as it’s extended from the 8day",
    "bias": "None",
    "id": "2014337943888896508"
  },
  {
    "user": "@GammaEdges",
    "text": "$OPEN from an options structure standpoint call speculators are in control (bullish). The key strike to get over is the 7.00 which is highest speculation and sensitivity which will most likely be an area of stalling. The next 2 expiries contain a signiciant amount of the OI. The structure needs to shift higher (calll speculators opening contracts at higher strikes) for signiciant price appreciation.",
    "bias": "Euphoria / Greed",
    "id": "2014336996441731360"
  },
  {
    "user": "@RedDogT3",
    "text": "$open still consolidating",
    "bias": "None",
    "id": "2014335261753188779"
  },
  {
    "user": "@RedDogT3",
    "text": "📺 WHY THIS GAP WAS BUYABLE & LEVELS > HEADLINES\n\nGet today's newsletter: t3live.com/scott-free-newsle…\n\nHeadlines created fear, but price action clearly signaled opportunity.\n\nIn this short video, I break down why $SPY holding key levels made the gap buyable, how $QQQ showed relative strength, and why trimming into strength matters now.\n\nMeanwhile, $IWM holding its 8-day moving average confirmed small-cap strength.",
    "bias": "None",
    "id": "2014327577905639884"
  },
  {
    "user": "@RedDogT3",
    "text": "$SPX held 6798 and quickly reclaimed the 50day, so it repaired fast after that “framework” headline and global rally. No real new news this morning, just some upside follow-thru as we see if early strength holds or fades.",
    "bias": "None",
    "id": "2014319911141585357"
  },
  {
    "user": "@RedDogT3",
    "text": "⏰ Scott Redler’s #630club - LIVE Premarket Stock Update $NVDA $TSLA $IBIT $SPY  ➡️ Free VIP List Newsletter: t3live.com/scott-free-newsle… nitter.net/i/broadcasts/1eaKbjNrX…",
    "bias": "None",
    "id": "2014299569551733083"
  },
  {
    "user": "@RedDogT3",
    "text": "If you keep find yourself riding down bad stocks, check this out:\n\nt3live.com/ma-ebook-tw-scott\n\nMoving averages aren't everything - but they help you read the trend fast. Every $10K loss you avoid is $10K you don't need to make.",
    "bias": "None",
    "id": "2014135170711048399"
  },
  {
    "user": "@RedDogT3",
    "text": "$spy post close as yesterday’s low held and we tested the gap pivot. Today makes it more neutral bs bearish. It’s still a very specific tape!",
    "bias": "Panic / Capitulation",
    "id": "2014097460595982503"
  }
]