[
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇮🇷 🇺🇸 IRAN PLANS TO CLOSE STARIT OF HORMUZ BLOCKING 20% OF THE WORLDS OIL SUPPLY ROUTE IN RESPONSE TO U.S ATTACK.",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨 BREAKING 🚨\n\nMICHAEL SAYLOR ABOUT TO BUY\nBILLIONS WORTH OF BITCOIN.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\nSOMEONE JUST BOUGHT 26,256 ETH WORTH $59 MILLION ON BINANCE.\n\nYOU GUYS KEEP ON SELLING YOUR ETH TO BIG WHALES.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "RIP Q2 ALTSEASON 🪦\n\nBITCOIN DOMINANCE JUST MADE A NEW CYCLE HIGH.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🐋 A WHALE HAS JUST BOUGHT 17,070 $ETH WORTH $39 MILLION AFTER CRASH. HE NOW HOLDS 132,536 ETH ( $303M )\n\nWHILE YOU ARE PANIC SELLING, WHALES ARE LOADING UP YOUR COINS.",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇮🇷🇮🇱  IRAN HAS SHOT MISSILES AT \nISRAEL AFTER THE US AIR STRIKE.",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Why market is dumping hard in fear ?\n\n🇺🇸 US launched targeted air strike on \nnuclear facilities in 🇮🇷 Iran.\n\nIran says every U.S. citizen and military\nin the region is the target now and they \nwill take the legal action against US.\n\nTrump wants Iran to agree to a peace \ndeal and no retaliation of attacks. \n\nUntil this conflict is sorted, market will\nkeep dumping in fear of US entering the\nwar. Let’s hope and pray for a deal 🙏",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇺🇸 US STATE TEXAS HAS JUST OFFICIALLY SIGNED STRATEGIC BITCOIN RESERVE BILL.\n\nGIGA BULLISH 🚀",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨BREAKING:  🇮🇷 IRAN JUST LAUNCHED A MISSILE ON BITCOIN AND MY PORTFOLIO.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "OTHERS DOMINANCE BULLISH DIVERGENCE 🚨 \n\nThe Middle East situation is pushing alts down and some of them have reached their cycle low. People are max short at this point, and expecting more downside. If some negotiations happen, a massive short squeeze will happen.\n\nPraying for the world's peace and my portfolio.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "HE WHO SURVIVES -80% DUMP \n\nDESERVES A 1000% PUMP",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇬🇧 $260 BILLION ASSET MANAGER 'BAILLIE GIFFORD' HAS LAUNCHED UK’S FIRST EVER FCA-APPROVED TOKENIZED FUND ON $ETH\n\nETHEREUM TO $10,000 IS CONFIRMED THIS CYCLE EASILY.",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "$ETH WILL PUMP JUST LIKE COINBASE.\n\nIT'S ALL IN THE CHARTS.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "GENIUS ACT PASSED IN SENATE.\n\nTRUMP SAID \"DIGITAL ASSETS ARE THE FUTURE\".\n\nFED GOVERNOR CALLED FOR RATE CUT POSSIBILITY IN JULY.\n\nOHIO HOUSE PASSED BILL TO EXEMPT<$200 BITCOIN PAYMENTS FROM TAXES.\n\nCRYPTO CZAR SAID THAT CRYPTO BILL IS VERY CLOSE.\n\nBLOOMBERG RAISED ALTCOIN ETFs APPROVAL PROBABILITY TO 95%.\n\nDTCC MET WITH THE SEC REGARDING TOKENIZATION.\n\nAND YOU'RE STILL LOOKING AT SHORT-TERM PRICE ACTION.\n\nTHE BIGGEST ALTSEASON IS COMING.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "I know this pain is too much \n\nJust hold tight. No one was expecting \nPump fun money extraction, Tarrif war\nand now Iran - Israel war. \n\nQE + Rate cuts will come towards the\nend of 2025 and liquidity will flow into\ncrypto sending coins to new ATHs\n\nJust need to survive until Q4",
    "bias": "FOMO"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "This is the worst bull market ever",
    "bias": "None"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\nA WHALE HAS BOUGHT 30,000 ETH WORTH $72.9 MILLION TODAY.\n\nIN THE PAST 10 DAYS, THIS WHALE HAS BOUGHT 116,292 ETH WORTH $282.6 MILLION.",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇺🇲 BLACKROCK HAS JUST BOUGHT $46.9M WORTH OF BITCOIN.\n\nWHALES ARE BUYING THE DIP 🚀",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@StockSavvyShay",
    "text": "WHAT THE U.S.–IRAN ESCALATION MEANS FOR MARKETS\n\nI hate that part of this job is trying to map market outcomes onto human tragedy. That we have to sit here and analyze airstrikes and escalation risk like they’re just variables in a model. But the truth is, when events like this unfold, people look for some sense of what might come next. And I do think it’s part of my duty to speak clearly -- even when the subject is this heavy.\n\nWhat we saw wasn’t just a strike. It was a signal. The U.S. targeted nuclear facilities -- not civilians, not leadership -- which tells me the goal was to remove the most dangerous variable from the equation. And if that was successful, then the worst-case scenario -- the true left tail risk -- is off the table. Not the violence, not the pain, but the unthinkable.\n\nThat doesn’t mean this is over. I don’t believe one strike and one backchannel agreement will be the final chapter here. I still think we’ll see retaliation. Maybe an attack on a U.S. base. Maybe something calibrated to make a point without crossing a fatal line. But I also think the market is starting to price that kind of controlled escalation differently than it would a total spiral.\n\nAnd that matters -- especially for names positioned at the intersection of autonomy, cybersecurity, surveillance, and defense modernization. The world is waking up to the fact that 21st century conflict won’t just be about boots on the ground or missiles in the air. It’ll be about data, infrastructure, and deterrence. That’s exactly where companies like $PLTR, $AXON, $CRWD, $RBRK, $NET, and $ACHR operate.\n\nThis is why I’ve been quietly building this New Age of Defense bucket in my growth portfolio throughout the recent market pullback. Not because I was predicting escalation, but because the writing’s been on the wall for years: global instability is no longer the exception -- it’s the backdrop. And the companies positioned to respond, secure, and adapt in real time will earn their premium, conflict or not.\n\nIf this stays within bounds -- if we don’t see mass casualties or civilian targets -- then investors will likely interpret it not as peace, but as containment. And that’s often enough to shift positioning. Not because people are desensitized. Not because they don’t care. But because $QQQ & $SPY react to what’s likely, not what’s just. And when uncertainty narrows, capital moves.\n\nWe’re not out of the woods. But we’re no longer staring into the abyss.\n\nBut I hope I’m wrong in needing to analyze any of this. I hope the story shifts again -- not toward more escalation, but toward diplomacy. Because there’s no upside in conflict. There’s only cost.",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@StockSavvyShay",
    "text": "IRAN’S PARLIAMENT APPROVES CLOSING STRAIT OF HORMUZ -- FINAL DECISION NOW WITH TOP SECURITY COUNCIL\n\nPolymarket now prices closure odds at -125 -- a sharp jump from +240 just 24 hours ago.",
    "bias": "None"
  },
  {
    "user": "@FuturumEquities",
    "text": "IF $NVDA IS THE ENGINE POWERING AI -- HERE ARE 10 OTHER WAYS THE MACHINE WORKS  👇\n\n1. $TSM is the factory that builds the engine\n\n2. $AVGO is the glue holding the system together\n\n3. $ASML makes the tools that keep the factory running\n\n4. $MU provides the memory that helps AI think fast\n\n5. $NBIS rents out all this power through the cloud\n\n6. $ARM designs the tiny brains that run on low power\n\n7. $QCOM puts those brains into phones, cars & edge devices\n\n8. $ANET is the network that connects everything together\n\n9. $ALAB makes the parts that move data fast inside the system\n\n10. $PLTR turns all that raw AI power into real-world results",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$META AD ENGINE HAS GROWN NEARLY 10X OVER THE LAST DECADE",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "U.S. VICE PRESIDENT VANCE: AMERICA IS AT WAR WITH IRAN’S NUCLEAR PROGRAM -- AND HAS ALREADY DESTROYED KEY FACILITIES\n\nDespite Vance declaring war on Iran’s nuclear program -- Polymarket still prices a 2025 US-Iran deal at +170 odds.",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "10 GROWTH STOCKS POSITIONED IF THE MIDDLE EAST CONFLICT ESCALATES\n\n1. $PLTR | Palantir\n2. $AXON | Axon\n3. $NET | Cloudflare\n4. $CRWD | CrowdStrike\n5. $ACHR | Archer \n6. $RKLB | Rocket Lab\n7. $ASTS | Ast Spacemobile\n8. $EOSE | Eos Energy\n9. $RBRK | Rubrik\n10. $ENVX | Enovix",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@StockSavvyShay",
    "text": "TOP 5 Q1 EARNINGS STANDOUTS FROM MY GROWTH PORTFOLIO\n\n1. $PLTR | Palantir\n2. $MELI | MercadoLibre\n3. $TTD | Trade Desk\n4. $TMDX | TransMedics\n5. $ALAB | Astera Labs",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "I launched my small-cap portfolio a couple years ago -- it’s now grown to 23 positions with a 74% CAGR since inception\n\n Here are the 5 I’m most excited about right now ⤵️",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$GOOGL IS NOW THE MOST PROFITABLE COMPANY IN THE WORLD WITH $111B IN ANNUAL NET INCOME",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PRESIDENT TRUMP JUST SAID IRAN MUST CHOOSE PEACE OR FACE FAR GREATER STRIKES -- MANY TARGETS STILL REMAIN",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@StockSavvyShay",
    "text": "POLYMARKET ODDS OF IRAN CLOSING STRAIT OF HORMUZ JUMP TO 55% -- A MOVE THAT WOULD DISRUPT 20% OF GLOBAL OIL SUPPLY",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "NASDAQ FUTURES DOWN 1% ON IG WEEKEND AFTER U.S. BOMBS IRAN -- PRESIDENT TRUMP TO ADDRESS NATION AT 10PM ET",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PRESIDENT TRUMP ANNOUNCES U.S. STRIKES ON 3 NUCLEAR SITES IN IRAN",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Fibonacci levels help traders spot key price zones where a stock might bounce or pull back -- using ratios from the Fibonacci sequence to map out potential support and resistance.",
    "bias": "Loss Aversion"
  },
  {
    "user": "@StockSavvyShay",
    "text": "DAN IVES SAYS $TSLA “GOLDEN AGE OF AUTONOMY” BEGINS SUNDAY -- CYBERCAB COULD UNLOCK A $1T OPPORTUNITY",
    "bias": "None"
  },
  {
    "user": "@StockSavvyShay",
    "text": "UPDATED FIBONACCI LEVELS FOR POPULAR GROWTH STOCKS\n\n1. $NVDA -- $128\n2. $AMD -- $119\n3. $TSLA -- $298\n4. $HIMS -- $50\n5. $ASTS -- $34\n6. $RKLB -- $22\n7. $TEM -- $49\n8. $IONQ -- $36\n9. $QBTS -- $13\n10. $PLTR -- $98\n11. $CRWD -- $382\n12. $NBIS -- $39\n13. $OSCR -- $19\n14. $LMND -- $39\n15. $SOFI -- $11\n16. $RGTI -- $9\n17. $HOOD -- $54\n18. $OKLO -- $48\n19. $ACHR -- $10\n20. $CVNA-- $258",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@StockSavvyShay",
    "text": "If you’re looking for institutional-grade research on 23 early disruptors I own in my small-cap portfolio --  this is the community I’m building  👇\n\nsavvytrader.com/StockSavvySh…",
    "bias": "None"
  },
  {
    "user": "@jonnajarian",
    "text": "Vance says U.S. 'not at war with Iran, we're at war with Iran's nuclear program' nbcnews.com/politics/trump-a… via @nbcnews",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@jonnajarian",
    "text": "The previous admin sent out $93B in 76 days, from the election of President Trump to inauguration, that was more that double the amount of previous 15 years. Perfectly normal, right?",
    "bias": "None"
  },
  {
    "user": "@jonnajarian",
    "text": "Never apply logic to a horror movie",
    "bias": "None"
  },
  {
    "user": "@jonnajarian",
    "text": "great discussion @WesleyHuntTX",
    "bias": "None"
  },
  {
    "user": "@jonnajarian",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Of note: \nIsrael's stock market makes a new all time high this weekend.\n#TA125",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Some people will do anything to get the Fed to cut rates.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@NorthmanTrader",
    "text": "And fwiw I link both the exercise & the diet results to the drop in the average resting heart rate. Leaning out makes a big difference. Exercise + diet link together on that front imho.\nAnd it's not really a diet, just a lifestyle change.",
    "bias": "None"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Well, whatever I'm doing seems to be working. Cray.\nNew VO2 Max just dropped.\nNot doing anything crazy, just 2-3 runs + a couple of gym sessions per week and a disciplined diet.\nNo extremes, shots or anything. All natural.\nI'll take it. Nice to see the results.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "JD VANCE: IRAN BLOCKING HORMUZ WOULD BE `SUICIDAL' FOR ITS ECONOMY\n(Said on NBC's \"Meet the Press\" a few minutes ago.)\n\nAny attempt to close the Strait will presumably mean a US military response.\n\nProbabilities of closure are now deflating.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "Bitcoin trading as a proxy for Tradfi markets.\n\nJust broke below $101k\n(because $BTC is still a risk-on asset and this is a risk-off event.)",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Reuters",
    "text": "Maersk continues to sail through Strait of Hormuz, company says reut.rs/3ZK7PPb reut.rs/3ZK7PPb",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "*IRAN’S PARLIAMENT APPROVES CLOSING OFF STRAIT OF HORMUZ\n\nSpiking in the last 15 minutes",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "This is a critical difference between the Red Sea (blue) and the Persian Gulf. Shippers had the option of going around the Cape of Good Hope (orange). \n\nThere is no alternative to the Persian Gulf.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@biancoresearch",
    "text": "Update on the chart that will drive crude oil trading when it opens in Asia later today.",
    "bias": "None"
  },
  {
    "user": "@TankerTrackers",
    "text": "AIS data shows that as of five minutes ago, tanker traffic is still moving in both directions within the Strait of Hormuz. #OOTT #tankers",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "Sixteen million barrels/day are exported through the Persian Gulf.\n\nWorld production is approximately 83 million barrels/day, so roughly 20% of global production flows through tankers in the Persian Gulf.\n\n(Betting odds are the same as below).",
    "bias": "None"
  },
  {
    "user": "@IranIntl_En",
    "text": "#BREAKING \"It is now our turn to act without delay. As a first step, we must launch a missile strike on the US naval fleet in Bahrain and simultaneously close the Strait of Hormuz to American, British, German, and French ships,\" said Khamenei's representative in Kayhan newspaper, Hossein Shariatmadari in reaction to the US attacks.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@alifarhat79",
    "text": "Trump just posted this",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "The repost below by @mercoglianos  makes a good case for why Iran CANNOT close the Strait of Hormuz. \n\nThat said, the bettors (chart) are suggesting a real possibility/fear that Iran will close the Strait (trading above 50%).\n\nIf this fear persists, crude oil prices are at risk of going a lot higher.\n---\nBetting markets are similar to the point spread in a football game. It is helpful to know. But it doesn't mean this will be the outcome.\n@johnkonrad",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@biancoresearch",
    "text": "3-day tick chart of $BTC ... proxy for financial markets.\n\nIt had been slumping over the last two days due to fears of an attack. \n\nNow, $BTC is rallying, as the low was reached with the announcement of the attack; the feared worst scenarios do not appear to have occurred.",
    "bias": "FOMO"
  },
  {
    "user": "@TradingThomas3",
    "text": "10PM speech",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "*TRUMP: COMPLETED SUCCESSFUL ATTACK ON 3 NUCLEAR SITES IN IRAN",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "2/2\n\nThe only market trading is Bitcoin. It slumped to under $102K, its lowest level since tensions heightened last week.",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@biancoresearch",
    "text": "1/2\n\nBetting market probabilities are rising, now back to roughly levels before the \"2 weeks\" statement (see chart annotations).",
    "bias": "None"
  },
  {
    "user": "@nytimes",
    "text": "Breaking News: U.S. B-2 bombers appear to be heading west across the Pacific as President Trump considers joining Israel’s strikes on Iranian nuclear sites. Follow live updates. nyti.ms/44gpeQY",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@biancoresearch",
    "text": "Posted 15 minutes ago …\n\nThe probability of US military action by July has now jumped to 60% \n\nnytimes.com/live/2025/06/21/…",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "Trump said he'll be deciding on Iran \"in the next two weeks.\" Presumably, that means 12 days are left.\n\nThe betting market is 50/50 that the US will conduct military action against Iran before July 1st.",
    "bias": "None"
  },
  {
    "user": "@biancoresearch",
    "text": "Last 24 hours ....\n\n* Fed Gov Waller said the Fed can cut in July\n\n* Trump tore into Powell\n\n* Sen Tuberville (R-AL) calls for Trump to fire Powell\n\n* Lutnick tore into Powell\n\nDespite all this, the probability of a July 30 cut (next meeting) is just 17% (83%: no move).",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The Eye in the Fractal\n\nA “fractal dimension” isn’t just math—it’s a mindset.\n 🔍 A zoomed-in lens that reveals meaningful complexity.\nIt’s what separates linear thinkers from real risk managers.\n\nFractals don’t lie. Narratives do.\n#FractalThinking #MacroMindset #Investing",
    "bias": "FOMO"
  },
  {
    "user": "@ToneLoTweets",
    "text": "@KeithMcCullough looking forward to this. Thinking I can build some solid SMAs for clients.",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Fractals, Not Forecasts\n\n🧠 Markets aren’t about isolated facts—they’re about patterns within patterns.\nThat’s Fractal Street Smarts\n\n👉 Think like a Game-player, not a headline reader.\nCertainty is a hope. And hope isn’t risk management.\n\n#Macro #BehavioralFinance #Fractals",
    "bias": "None"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Real Conversations | Sam Rahman @SamofAmerica  & David Salem @dsaleminvestor Join McCullough @HedgeyeAM  app.hedgeye.com/insights/167… via @hedgeye",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Following the Long Only, eh! Thanks",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "For premium members last week, we dug into an AI stock that is a 'Perfect 10'. \nio-fund.com/premium-services…\n\n$NVDA $AMD $AVGO $PLTR $MSFT",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Meta $META said that it is using AMD’s $AMD GPUs to power inference tasks for its Llama models, while Microsoft $MSFT says it uses AMD’s chips for its Copilot AI features.",
    "bias": "None"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Nvidia $NVDA CEO Jensen Huang on quantum computing:\n\n “Just like Moore’s Law, I could totally expect 10 times more logical qubits every five years, 100 times more logical qubits every 10 years.”",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Not all but a few",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "It’s good to know the language",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "How do u develop your “Go Time”",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Nice work today!",
    "bias": "None"
  },
  {
    "user": "@jtraderco",
    "text": "Entries Confirmation",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@RedDogT3",
    "text": "The number *9*",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Obey the rules and stay safe.",
    "bias": "None"
  },
  {
    "user": "@joinfingrad",
    "text": "Trading with Doji Patterns.",
    "bias": "None"
  },
  {
    "user": "@IManghaila",
    "text": "Chart Patterns",
    "bias": "None"
  },
  {
    "user": "@IManghaila",
    "text": "Trading Patterns.",
    "bias": "None"
  },
  {
    "user": "@RedDogT3",
    "text": "Go get it this weekend",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "The ATAC Credit-On/Credit-Off Index (JOJO.INDEX) rotates between long-term US treasuries & high yield junk debt on a weekly basis based on the performance of Utilities and the broad stock market.       \n\nAs of Friday, the Index remains junk-on.       \n\nClick: marketvector.com/indexes/cus…",
    "bias": "Euphoria / Greed"
  },
  {
    "user": "@leadlagreport",
    "text": "The Iran war might be what causes the reverse carry trade to occur.\n\nJapan imports all of its oil.\n\nJapan will panic.\n\nLike and repost if you understand this.\n\n🇯🇵🐦‍🔥",
    "bias": "Panic / Capitulation"
  },
  {
    "user": "@jonny_castles",
    "text": "Japan imports 90% of its oil thru the strait of Hormuz. Goodnight.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Just followed a bunch of new people who want to reply to my posts.\n\nI’m only allowing those I follow to reply to my posts given the bot insanity on X.\n\nIf you want to engage thoughtfully and are human, DM me so I can follow you back.\n\nTo the new ones, welcome to the FewCrew.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "I built a beast of a company in 8 months, and I’m about to inject it with steroids with new hires and new business lines.\n\nThis as I’m about to have the greatest comeback since Lazarus as a fund manager.\n\nI did not relent.\n\nI will not fucking relent.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "People are liking and reposting X accounts that say they are from Iran but that in reality are coming from China.\n\nI can’t believe people are this stupid.",
    "bias": "None"
  },
  {
    "user": "@BobEUnlimited",
    "text": "Quick reminder that this week retail sales, industrial production, housing confidence, permits & starts, and continuing claims were all weak and below what was expected.  And yet, stocks and bonds were basically flat.",
    "bias": "Confirmation Bias"
  },
  {
    "user": "@Gary_Brode",
    "text": "What is disinflation",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "NEW POST FROM THE FREE MARKETS REPORT\n\nWhat strikes me about the current environment is how defense spending as a share of GDP has been falling steadily for decades, even as absolute dollar amounts hit record levels.\n\nClick: open.substack.com/pub/freema…",
    "bias": "Recency Bias"
  },
  {
    "user": "@anasalhajji",
    "text": "If Iran's nuclear sites are completely destroyed, why is Iran being asked to return to nuclear talks?",
    "bias": "None"
  },
  {
    "user": "@LeadLagMedia",
    "text": "The New York Empire State Manufacturing Index fell to -16 this month, dropping from -9.2 in May, and far below forecasts of an improvement to -5.5.\n\nJune represents the worst reading since the -20 recorded in March.",
    "bias": "None"
  },
  {
    "user": "@matthewachang",
    "text": "X “trending” tab is wild right now",
    "bias": "Herd / Bandwagon"
  },
  {
    "user": "@leadlagreport",
    "text": "We’re fucked.\n\nGoodnight.",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Remember tariffs?",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "Will Iran retaliate?",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "🤣",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "",
    "bias": "None"
  },
  {
    "user": "@leadlagreport",
    "text": "So I’m gonna guess no nuclear deal with Iran needed",
    "bias": "None"
  }
]