[
  {
    "user": "@Ashcryptoreal",
    "text": "Alts Historically Go Down In August.\n\n𝟮𝟬𝟮𝟯\n\n➙ Altcoin Mcap Dumped 28% Before Rallying 159%.\n\n𝟮𝟬𝟮𝟰\n\n➙ Altcoin Mcap Dumped 40% Before Rallying 149%.\n\n𝟮𝟬𝟮𝟱\n\n➙ Altcoin Mcap Is Down 13% From Its Peak.\n\n➙ It Could Go Down 8%-10% More Before A Bottom.\n\nAfter That, A Rally Will Happen Just Like It Happened In 2023 And 2024.",
    "bias": "FOMO",
    "id": "1951633685108674575"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Relax. \n\nWe are still in Bull market \n\nBTC is going to $150,000\nETH is going to $10,000 \nAlts will pump 10x-50x \n\nWe are gonna make it in 2025",
    "bias": "Euphoria / Greed",
    "id": "1951584920444277203"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "FOUR KEY BULLISH POINTS I’M WATCHING FOR BITCOIN PN DAILY RIGHT NOW:\n\n-MAY 2025 RESISTANCE TURNS SUPPORT\n\n-IMBALANCE FILLED\n\n-PRICE BOUNCED AT 1D-EMA100\n\n-BULL FLAG FORMATION\n\nPOSSIBLE SHORT SQUEEZE 👀",
    "bias": "Loss Aversion",
    "id": "1951568317749305555"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Bitcoin always pump hard in August of \nthe post halving year \n\n2013: 30% \n2017: 65% \n2021: 13% \n2025: ?",
    "bias": "Euphoria / Greed",
    "id": "1951529265062920554"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Market makers are wiping out all the \nlate leveraged long on BTC and ETH.\n\nOnce majority is liquidated, They will\nPump them back to new all time highs.\n\nBuy spot and hold. Stay the fuck away \nFrom leverage if you seriously want to\nmake some money and take it home.",
    "bias": "Euphoria / Greed",
    "id": "1951387561349218350"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨 BREAKING 🚨\n\nMASSIVE CRASH IN STOCK MARKET.\nMORE THAN $1.11 TRILLION WIPED OUT.\n\nPRAY FOR CRYPTO.",
    "bias": "Panic / Capitulation",
    "id": "1951379143938982315"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "This is the 10th last shakeout \n\nBefore the parabolic breakout",
    "bias": "FOMO",
    "id": "1951378017122730072"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING: 🇺🇸 FED GOVERNOR KUGLER HAS JUST RESIGNED FROM THE FED BOARD.",
    "bias": "Herd / Bandwagon",
    "id": "1951367125911871955"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🇺🇸 TRUMP ORDERED TWO NUCLEAR \nSUBMARINES TO BE POSITIONED IN \nAPPROPRIATE REGIONS NEAR RUSSIA\n\nFUCK MY PORTFOLIO !!!!",
    "bias": "None",
    "id": "1951351612603347119"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "CPOOL team is crushing it 🤝\n\nStablecoins will hit trillions very soon",
    "bias": "None",
    "id": "1951350906525720728"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "🚨 BREAKING 🚨\n\nLIQUIDATION DATA IN THE LAST 24 HOURS 👇\n\nTHOSE WHO ARE HOLDING IN SPOT: $0\n\nTHOSE WHO ARE LONG AND SHORT: $810.35 MILLION",
    "bias": "Panic / Capitulation",
    "id": "1951302832432263169"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "Pray for Bitcoin",
    "bias": "Herd / Bandwagon",
    "id": "1951283089402933435"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING: 🇺🇸 FED RATE CUTS ARE LIKELY COMING IN SEPTEMBER !!!",
    "bias": "None",
    "id": "1951280651874824351"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BREAKING:\n\n🇺🇸 US UNEMPLOYMENT RATE CAME IN AT 4.2%\n\nEXPECTATIONS: 4.2%",
    "bias": "None",
    "id": "1951259500683346033"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "I AM NOT GIVING UP \n\nI CANT GIVE UP \n\nCOZ IM ALREADY ALL IN",
    "bias": "None",
    "id": "1951222142282113443"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "ONCE THE CME GAP IS FILLED!\n\nWE SHOULD BOUNCE FROM HERE",
    "bias": "None",
    "id": "1951186233897464253"
  },
  {
    "user": "@Ashcryptoreal",
    "text": "BITCOIN JUST RECORDED THE HIGHEST MONTHLY CLOSE IN HISTORY. \n\nTHIS IS THE MOST BULLISH MACRO PATTERN FOR BITCOIN!",
    "bias": "Euphoria / Greed",
    "id": "1951159185069965578"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE ARE THE TOP 5 NAMES ON MY WATCHLIST\n\n1). $GOOGL  -- Data Engine of the Modern Web\n2). $HOOD -- Command Hub of Modern Investing\n3). $ASTS -- Cell Tower in the Sky\n4). $OKLO -- Reactor of the AI Energy Era\n5). $AMD --  Inference Engine of the Agentic AI Economy",
    "bias": "None",
    "id": "1951647303158452527"
  },
  {
    "user": "@StockSavvyShay",
    "text": "MY $AMD EARNINGS PREVIEW: WHY THIS QUARTER MATTERS MORE THAN EVER\n\nI think we’re about to see the most important earnings print in AMD’s history -- not because Q2 will be flawless, but because it’s the clearest test yet of whether AMD’s AI transformation has teeth. The business is evolving fast. And the way the market re-rates this name over the next 12–18 months will hinge on how AMD threads the needle between growth and profitability at a platform scale.\n\nMargins Will Dip, but That’s Not the Point\n\nLet’s be clear: margins will still be under pressure. Gross margins could fall to 52% due to a mix of high-bandwidth memory costs, 5nm packaging, and ROCm ecosystem investments. That’s to be expected when you’re ramping a next-gen AI platform from scratch. But underneath that margin compression is something far more important -- AMD is starting to price like a leader, scale like a leader, and land contracts like a leader. \n\nFrom Underdog to Platform Contender\n\nThe MI350 pricing bump from $15K to $25K is a flashing signal to the street. This is no longer a “budget” option to $NVDA Blackwell stack. It’s a viable, competitive product with real performance credentials, being adopted at scale by hyperscalers like $ORCL and major inference users like $TSLA. And it's backed by a growing ROCm ecosystem with better compiler support, Hugging Face integrations, and day-one $META LLaMA 4 readiness. When you combine that with the fact that AMD is already taking CPU share from $INTC on both the client and server side, and layering in rack-scale design capabilities via the ZT Systems acquisition, the strategic picture becomes clearer: AMD is building a full-stack, disaggregated alternative to the vertically integrated AI infra model.\n\nThe Optionality Is What’s Explosive\n\nThat’s why I’m more excited about AMD than I’ve ever been. But because the optionality in the model is exploding. GPU revenue could exceed $4B this year. AI as a % of total revenue is rising. The data center segment is approaching 50% of total business. And while consensus still models a trough in Q2, the ramp into H2 looks like the beginning of a multi-year compounding engine -- especially if AMD nails the MI355X launch and reopens MI308X shipments to China.\n\nA Re-Rating Moment in the Making?\n\nThis quarter is less about the numbers and more about whether the market finally accepts AMD as more than a challenger. If management guides Q3 revenue above $8B and shows any signs of margin re-expansion, the market will have to start pricing this company as a legitimate AI infrastructure platform -- one that offers hyperscalers flexibility, pricing leverage, and a non-CUDA path to LLM scaling. That shift in perception, combined with already rising demand for MI-series chips, is what could justify a move toward $200+ over the next 12 months.\n\nBottom line: I don’t expect a melt-up on earnings. The stock is extended, RSI is hot, and any in-line guide could lead to a short-term fade. But this is the first time in AMD’s history where every part of the business -- CPUs, GPUs, software, system design -- is moving in the same direction.",
    "bias": "FOMO",
    "id": "1951635961621733880"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Fibonacci levels help traders spot key price zones where a stock might bounce or pull back -- using ratios from the Fibonacci sequence to map out potential support and resistance.",
    "bias": "Loss Aversion",
    "id": "1951632577527431222"
  },
  {
    "user": "@StockSavvyShay",
    "text": "WATCH THESE KEY FIB LEVELS IF THE PULLBACK CONTINUES\n\nAI Hardware\n• $NVDA -- $124\n• $ARM -- $119\n• $TSM -- $177\n• $AVGO -- $197\n• $AMD -- $117\n\nSpace Economy\n• $RKLB -- $23\n• $ASTS -- $34\n• $RDW -- $13\n• $LUNR -- $11\n• $PL -- $4\n\nAI Infrastructure\n• $MSFT -- $425\n• $AMZN -- $186\n• $GOOGL -- $166\n• $CRWV -- $92\n• $NBIS -- $31\n\nNuclear Energy\n• $OKLO -- $34\n• $CCJ -- $52\n• $BWXT -- $111\n• $CEG -- $232\n• $VRT -- $93\n\nCybersecurity\n• $CRWD -- $322\n• $PANW -- $168\n• $ZS -- $217\n• $NET -- $124\n• $RBRK -- $57\n\nAI Applications\n• $SNOW -- $155\n• $PLTR -- $75\n• $MDB -- $228\n• $DDOG -- $115\n• $NOW -- $877\n\nRobotics\n• $TSLA -- $299\n• $ISRG -- $498\n• $SYM -- $31\n• $QCOM -- $144\n• $RR -- $2\n\nQuantum Computing\n• $IONQ -- $25\n• $RGTI -- $9\n• $QBTS -- $8\n• $IBM -- $226\n• $ARQQ -- $23",
    "bias": "None",
    "id": "1951631133579317649"
  },
  {
    "user": "@FuturumEquities",
    "text": "WHAT IS THE FUTURUM EQUITIES PODCAST?\n\nWe believe there are a handful of companies right now that are going to redefine the next decade of the digital economy. And the pace of disruption is only accelerating.\n\nThe next five years will break most of the frameworks investors have clung to for the last decade. That’s why we’re doing this podcast. Because this market isn’t about guessing earnings -- it’s about understanding who’s building the rails of the future and how capital flows into those systems.\n\nThe Futurum Equities Podcast exists to give you insights from the inside -- all 7 episodes are now live on Apple, Spotify and Youtube  ⤵️",
    "bias": "Contrarian",
    "id": "1951626166793879610"
  },
  {
    "user": "@StockSavvyShay",
    "text": "HERE ARE THE TOP 15 GROWTH PERFORMERS OF 2025\n\n1. $MP +308%\n2. $OKLO +237%\n3. $PGY +213%\n4. $HOOD +168%\n5. $HIMS +159%\n6. $ASTS +149%\n7. $CRCL +144%\n8. $NVTS +124%\n9. $RBLX +116%\n10. $SYM +114%\n11. $JOBY +111%\n12. $PLTR +104%\n13. $QBTS +95%\n14. $TMDX +93%\n15. $NBIS +88%",
    "bias": "None",
    "id": "1951622828606029934"
  },
  {
    "user": "@StockSavvyShay",
    "text": "$HOOD CEO SAYS ROBINHOOD BANKING LAUNCHING BY QUARTER-END",
    "bias": "None",
    "id": "1951613438637285556"
  },
  {
    "user": "@StockSavvyShay",
    "text": "WHY THE AI CAPEX BOOM IS JUST BEGINNING\n\nI believe there are two verticals still wildly misunderstood: cloud infrastructure and the AI deployment layer. Everyone’s trying to call the top -- but what if we’re nowhere near it?\n\nThe bear case goes like this: hyperscaler growth will taper, AI capex will fade, and cloud is “maturing.” But here’s the truth -- 85% of global IT spend is still on-prem. And yet $AMZN AWS just did $123B, $MSFT Azure $75B, and $GOOGL Cloud $49B over the past year. That’s not saturation -- that’s the early innings of migration.\n\nAnd this isn’t just about training LLMs. It’s about every enterprise app going AI-native. Every workflow, every vertical, every user interface will need low-latency inference, secure data pipelines, and orchestration layers that simply don’t run on legacy infrastructure. It runs in the cloud -- and it runs on clouds built for AI.\n\nSo no, I don’t buy the “capex cliff” story. Not when we’re staring at a $2T+ cloud market that’s still mostly untapped. Not when enterprises are just beginning to fine-tune models and deploy agents into production. And not when new AI-native workloads are being born every quarter.\n￼\nThe cloud is the foundation of the AI economy. And we’re only getting started.",
    "bias": "Herd / Bandwagon",
    "id": "1951219834546692612"
  },
  {
    "user": "@StockSavvyShay",
    "text": "FED GOVERNOR KUGLER IS STEPPING DOWN FROM HER ROLE AT THE CENTRAL BANK -- CUT RATES NOW",
    "bias": "None",
    "id": "1951366255535071582"
  },
  {
    "user": "@StockSavvyShay",
    "text": "PRESIDENT TRUMP ORDERS FIRING OF LABOR CHIEF -- CLAIMS BIDEN-APPOINTED COMMISSIONER IS MANIPULATING JOBS DATA.",
    "bias": "None",
    "id": "1951345564580454608"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Futurum Equities Podcast | Episode #7 | $GOOGL, $AMZN, $META, $MSFT, $NET, $AAPL, $SOFI, $HOOD, $ARM, $PANW, $QCOM nitter.net/i/broadcasts/1YpJkBBrg…",
    "bias": "Contrarian",
    "id": "1951327808011248082"
  },
  {
    "user": "@StockSavvyShay",
    "text": "Took a new swing at a popular growth name today -- big bet on a theme I’m bullish on. \n\nAny guesses?  🤔",
    "bias": "Herd / Bandwagon",
    "id": "1951300601519939757"
  },
  {
    "user": "@RiskReversal",
    "text": "Fast Money LEGEND @BKBrianKelly joins Dan & @GuyAdami🎙️\n\n📉🌐 Macro Risks Unpacked\n🚀🏦 Wall Street Embraces Crypto\n🔍🪙 BK Breaks Down Stablecoins\n💸⬆️ Dollar, Yields & You\n\nYouTube: piped.video/yTB0oQjX3R8\nApple: apple.co/4515zGo\nSpotify: tinyurl.com/4jwj2cd9",
    "bias": "Overconfidence",
    "id": "1951260373849706643"
  },
  {
    "user": "@DanielTNiles",
    "text": "It is never the data, it is the markets reaction to the data that is important.\n\nI think the tell for today’s weakness in hindsight, which fortunately is always perfect, may have started on Wednesday, when despite 2 Fed governors dissenting and wanting to cut rates, the press conference was taken as bearish and the S&P closed slightly down for the day.\n\nThen yesterday, the stock of AI darling $NVDA goes down 1% & the S&P declines from an up open to finish down 0.4% despite big Azure numbers from $MSFT driving their stock +4% and $META up 11% on using AI the best to run their business. This was the biggest surprise to me of all the Mag7 results this week. Meta did not raise the high-end of their capex and expense guidance despite raising the low-end for each.\n\nAnd now today, instead of the market cheering a weak jobs number, \"great the Fed can cut\", it is instead \"oh no, the Fed has to cut.\" Also $AAPL is down today despite reporting revs up 10% y/y which was the best since the covid driven CQ4:2021. While my preview was that they would have a strong quarter, I also am not surprised the stock is down today given: 1) their disclosure around AI again was once again underwhelming, which I thought would be the main driver of the stock today, 2) I think the demand pull-in is much more than the 1% Apple believes, 3) the $GOOGL anti-trust remedies are coming in August which will impact over $20B in pure profits for Apple and 4) given the high bar Microsoft and Meta set the day before. $AMZN deserves its stock decline today given disappointing revs & profitability at AWS which was the concern I previewed despite stellar results in e-commerce.\n\nFinally, President Trump seems to be emboldened by the stock market hitting all-time record highs despite the tariff rates announced over the past couple of weeks closer to the high-teens instead of the baseline 10% the market was expecting early this year and low teens recently. Furthermore, sending two nuclear submarines towards Russia is not something anyone wants to see.\n\nSo where does that leave us? Monday should be telling. Do investors go home over the weekend and decide this is yet another buying opportunity given the Fed is likely to cut in September or do they decide a higher tariff rate that was stressing the stock market out earlier in the year is an issue? I still tend to believe the market wants to melt-up into Thanksgiving for the reasons I have laid out before of impending Fed rate cuts, demand pull-in and a weaker US dollar helping S&P revenues. After a continuing melt-up, I have been expecting a 10-20% stock market decline from Thanksgiving to year-end as the impact of the demand pull-in is fully realized during disappointing holiday sales. But is the stock action this week telling me the decline has already started?\n\nI still believe new stock market highs are ahead of us though the current decline may have a bit more to go. I am betting on “irrational exuberance” in the near-term but maybe I am the one being irrational.",
    "bias": "Recency Bias",
    "id": "1951366247448551682"
  },
  {
    "user": "@RiskReversal",
    "text": "\"I want to sell $MSTR and buy #Bitcoin... That's the trade that @saylor is doing!\"",
    "bias": "Herd / Bandwagon",
    "id": "1951376890989609047"
  },
  {
    "user": "@RiskReversal",
    "text": "How a lower Fed Funds Rate may take money out of people's pockets & ultimately hurt the economy💸📉\n\n@BKBrianKelly on the latest pod w/ Dan & @GuyAdami",
    "bias": "Recency Bias",
    "id": "1951366573479915522"
  },
  {
    "user": "@RiskReversal",
    "text": "College is more than just tuition: books, materials, and even gas add up fast. 📚🚗\n\nCheckout 'Generation Money', a new series with our friends @MoneyLion & @Edvisors\n\nWATCH: piped.video/aocldZz_Xf8\n\n#StudentDebt #CollegeCosts #FinancialWellness",
    "bias": "None",
    "id": "1951355500215271835"
  },
  {
    "user": "@RiskReversal",
    "text": "Some colleges in Massachusetts now cost $100,000 a year. Is that REALLY worth it?\n\nCheckout 'Generation Money', a new series with our friends @MoneyLion & @Edvisors\n\nWATCH: piped.video/aocldZz_Xf8\n\n#HigherEd #Tuition",
    "bias": "Euphoria / Greed",
    "id": "1951336404459434077"
  },
  {
    "user": "@RiskReversal",
    "text": "\"No matter what the company is, no matter what the new tech is... It always gets overbuilt, it always goes too far and eventually it starts to come down.\"\n \n- @BKBrianKelly on AI powered rally we find ourselves in",
    "bias": "FOMO",
    "id": "1951303155653943504"
  },
  {
    "user": "@RiskReversal",
    "text": "Even as more companies adopt the Bitcoin treasury model, @BKBrianKelly says short $MSTR at your own risk or you could \"get GameStopped\"",
    "bias": "Herd / Bandwagon",
    "id": "1951282268405899459"
  },
  {
    "user": "@CNBCFastMoney",
    "text": "Final Trades into the (long?) weekend!\n\n@timseymour, @CarterBWorth, @Bonawyn and @grassosteve go around the horn. $MO $BUD $DHI\ncnbc.com/video/2025/08/01/fa…",
    "bias": "None",
    "id": "1951403851837481042"
  },
  {
    "user": "@CNBCFastMoney",
    "text": "The Utilities sector trading at 52-week highs, and the Chart Master @CarterBWorth says the group can continue to power higher!\n\nHe lays out the key levels to watch, while @timseymour and @grassosteve trade the sector.\ncnbc.com/video/2025/08/01/ch…",
    "bias": "Euphoria / Greed",
    "id": "1951403655665463550"
  },
  {
    "user": "@CNBCFastMoney",
    "text": "A steep sell-off to end the week...\n\nMarkets losing steam on the back of weak jobs numbers and more tariff headlines. @grassosteve, @Bonawyn, @timseymour and @CarterBWorth unpack the moves and what it could be signaling about where stocks go from here.\ncnbc.com/video/2025/08/01/fa…",
    "bias": "Panic / Capitulation",
    "id": "1951398892114686451"
  },
  {
    "user": "@jonnajarian",
    "text": "6⃣0⃣ Seconds $COIN $AMZN $FIG $RDDT Have a great weekend!",
    "bias": "None",
    "id": "1951270996461097373"
  },
  {
    "user": "@jonnajarian",
    "text": "The logic here is undeniable",
    "bias": "None",
    "id": "1951645956807459172"
  },
  {
    "user": "@LibertyCappy",
    "text": "Why are they like this?",
    "bias": "None",
    "id": "1951346946700091857"
  },
  {
    "user": "@jonnajarian",
    "text": "Thank goodness liberals don't run the world anymore",
    "bias": "None",
    "id": "1951641826688917621"
  },
  {
    "user": "@jonnajarian",
    "text": "Somebody please, make it stop!",
    "bias": "None",
    "id": "1951411823586029868"
  },
  {
    "user": "@jonnajarian",
    "text": "The third world rejects the comparison  abc7ny.com/live-updates/nyc-…",
    "bias": "None",
    "id": "1951411148508541008"
  },
  {
    "user": "@jonnajarian",
    "text": "wise words",
    "bias": "None",
    "id": "1951409722768195987"
  },
  {
    "user": "@jonnajarian",
    "text": "Can you say dynasty?",
    "bias": "None",
    "id": "1951400626060972471"
  },
  {
    "user": "@jonnajarian",
    "text": "The impressive chart of $AEO in the past month (Sydney Sweeney ad hit July 23) @PBDsPodcast  @patrickbetdavid",
    "bias": "Contrarian",
    "id": "1951399539480342540"
  },
  {
    "user": "@jonnajarian",
    "text": "I say we take them at their words",
    "bias": "None",
    "id": "1951397871087161746"
  },
  {
    "user": "@CBSNews",
    "text": "BREAKING: The Corporation for Public Broadcasting, which funds NPR and PBS, says it will close down after federal cuts.  cbsn.ws/3HcXd5c",
    "bias": "Contrarian",
    "id": "1951336764536148317"
  },
  {
    "user": "@jonnajarian",
    "text": "Jaguar CEO Behind Disastrous Gay Rebrand Suddenly \"Retires\" bbc.com/news/articles/cp3ezr…",
    "bias": "Herd / Bandwagon",
    "id": "1951396219923865900"
  },
  {
    "user": "@jonnajarian",
    "text": "It's effing lemon to be tipped off about the selloff by $VIX call buying! @petenajarian",
    "bias": "Panic / Capitulation",
    "id": "1951346618105839781"
  },
  {
    "user": "@jonnajarian",
    "text": "On with @MarkieMartin  NewsNation Morning In America ...Tariffs",
    "bias": "Herd / Bandwagon",
    "id": "1951314477141344559"
  },
  {
    "user": "@jonnajarian",
    "text": "...and cold 🥶",
    "bias": "None",
    "id": "1951265846078124180"
  },
  {
    "user": "@jonnajarian",
    "text": "My favorite thing, workout wise. On Friday. Is that doing a little cryo and heat at the same time? Heat for my shoulders and neck. Cryo for the rest of me. Oh, man, it's great. Have a great weekend 💪",
    "bias": "None",
    "id": "1951261828782158245"
  },
  {
    "user": "@jonnajarian",
    "text": "#VIX 19.37  @50cent 👇",
    "bias": "Panic / Capitulation",
    "id": "1951236199684743171"
  },
  {
    "user": "@jonnajarian",
    "text": "🏈 NAJARIAN SPORTS 🏴‍☠️ with @petenajarian Trey Lance leads Chargers to win over Lions 34-7 #NFL is back",
    "bias": "None",
    "id": "1951235558102982697"
  },
  {
    "user": "@MarketRebels",
    "text": "Jon Najarian @jonnajarian  on @NewsNation with Alicia Nieves @AliciaNievesTV last night",
    "bias": "Herd / Bandwagon",
    "id": "1951234171868795056"
  },
  {
    "user": "@NorthmanTrader",
    "text": "NorthCast Market Update: Kisses\n\nAmazingly precise technical reactions across multiple indices across the world, definitely worth being aware of.\n\npiped.video/watch?v=Bzpy5Sxo…",
    "bias": "None",
    "id": "1951645759947841695"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Quite the scene: $MSFT weekly close.",
    "bias": "None",
    "id": "1951598766714245564"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Market Dashboard:\nnorthmantrader.com/2025/08/0…",
    "bias": "None",
    "id": "1951379153120534940"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Next jobs revision: +1,000,000",
    "bias": "None",
    "id": "1951349456676573206"
  },
  {
    "user": "@NorthmanTrader",
    "text": "If there's even the slightest chance we're going to WWIII over a 'he said mean things on twitter' fight I vote for nuking this platform instead.",
    "bias": "None",
    "id": "1951332612544376909"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Powell: The labor market remains strong\n\nJobs revisions:",
    "bias": "None",
    "id": "1951283959230304530"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Markets only go up and then risk happens fast.\n$SPX broke its wedge.\nNow lowest 2 hour RSI since April.\n$SPX",
    "bias": "None",
    "id": "1951281749624832103"
  },
  {
    "user": "@NorthmanTrader",
    "text": "$SPY inverted update: Breakout",
    "bias": "FOMO",
    "id": "1951278569293746437"
  },
  {
    "user": "@NorthmanTrader",
    "text": "",
    "bias": "None",
    "id": "1951277963636297752"
  },
  {
    "user": "@NorthmanTrader",
    "text": "That she blows: $VIX breaking out of compression pattern following the gap fill.",
    "bias": "Panic / Capitulation",
    "id": "1951276991644094974"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Dollar smash.\n$DXY",
    "bias": "None",
    "id": "1951265253158785339"
  },
  {
    "user": "@NorthmanTrader",
    "text": "The sheer size of the jobs revisions should give everyone pause.\n1. If correct then why in the world put out wildly off the mark numbers in the first place, questions the entire credibility of the process.\n2. What's the true state of the economy? Perhaps nobody has a clue.",
    "bias": "Herd / Bandwagon",
    "id": "1951264265635074438"
  },
  {
    "user": "@NorthmanTrader",
    "text": "\"Too Late\"",
    "bias": "None",
    "id": "1951262489636737487"
  },
  {
    "user": "@NorthmanTrader",
    "text": "It all remains the same directional trade.\nWeekly version.\n#Bitcoin $SPX",
    "bias": "Herd / Bandwagon",
    "id": "1951249095651193270"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Markets must be down.",
    "bias": "None",
    "id": "1951245177185518062"
  },
  {
    "user": "@NorthmanTrader",
    "text": "Market Dashboard:\nnorthmantrader.com/2025/08/0…",
    "bias": "None",
    "id": "1951232807671304325"
  },
  {
    "user": "@NorthmanTrader",
    "text": "",
    "bias": "None",
    "id": "1951231397139501207"
  },
  {
    "user": "@NorthmanTrader",
    "text": "$NDX updated: Oops.",
    "bias": "None",
    "id": "1951211128001839178"
  },
  {
    "user": "@biancoresearch",
    "text": "How \"exercised\" was Trump about the Fed today?\n\nDaily chart back to the beginning of the year of all of Trump's Fed-related \"truths.\"\n\nToday was a record, three times the old record.",
    "bias": "Herd / Bandwagon",
    "id": "1951465970545074569"
  },
  {
    "user": "@biancoresearch",
    "text": "Did Trump give us a \"tell\" about the coming payroll report, and everyone on Wall Street (including me) missed it?\n---\nHere are Trump's three Fed-related \"truths\" in the 25 hours before the payroll report.\n\nIn my subjective opinion, he was more strident and harsher than usual in his criticism of Powell.\n\nThis is especially the case for the two \"truths\" this morning, in the two hours before the release, when he could have seen the full report.\n\nWITH HINDSIGHT, it does read like him lashing out against Powell, blaming him for a weak payroll report that was not yet released.",
    "bias": "Herd / Bandwagon",
    "id": "1951462938935484806"
  },
  {
    "user": "@biancoresearch",
    "text": "What a Whipsaw!",
    "bias": "Panic / Capitulation",
    "id": "1951433643894722882"
  },
  {
    "user": "@biancoresearch",
    "text": "Kevin Warsh betting to replace Powell (blue) has been surging today.\n\nTo be clear, Trump would be nominating a replacement Fed governor, and I believe it will happen soon (within the next few weeks) with Trump demanding that the Senate approve this nomination before the September 17 FOMC meeting. This would ensure three Governor votes to cut rates.\n\nIt would be understood that this person would also be Powell's replacement, which would require a second nomination and confirmation at a later date.",
    "bias": "Confirmation Bias",
    "id": "1951425980058280166"
  },
  {
    "user": "@Hedgeye",
    "text": "",
    "bias": "None",
    "id": "1951407506401464773"
  },
  {
    "user": "@biancoresearch",
    "text": "Crossing now",
    "bias": "None",
    "id": "1951405777354391823"
  },
  {
    "user": "@biancoresearch",
    "text": "*TRUMP SAYS HE'S VERY HAPPY ABOUT OPEN SPOT ON FED BOARD\n---\nHe's happy because he can move now (as in before the September 17 FOMC meeting, as explained above).",
    "bias": "None",
    "id": "1951385201160135049"
  },
  {
    "user": "@biancoresearch",
    "text": "The Fed Chairman is picked among the seven Fed Governors. It cannot be an outsider.\n\nIt is similar to the Supreme Court, where the Chief Justice is picked from the nine Associate Justices. It also cannot be an outsider.",
    "bias": "Herd / Bandwagon",
    "id": "1951382387658543263"
  },
  {
    "user": "@biancoresearch",
    "text": "Governor Kugler did not attend or vote in the FOMC meeting this week (the official vote was 9 to 2). The Fed said we was attending to a \"personal matter.\" Two days later, she steps down. (Kugler's last day is August 8.)\n\nI wish her well.\n---\nKugler's seat as a Fed governor was going to end in January 2026. She was not going to be reappointed as Trump needs this seat to appoint Powell's successor (unless he picks current Fed Governor Chris Waller).\n\nTrump can now nominate Powell's successor at any time and demand that the Senate confirm his nominee before the next FOMC meeting on September 17.  This means the FOMC will have AT LEAST three solid votes to cut rates.\n\nIn my opinion, the probability that Trump will move to fire Powell, most likely \"for cause,\" around the renovation of the Fed buildings, is 45%.  This is less than 50%, but significantly higher than the betting markets currently have it, at around 15%.\n\nFurthermore, I suggest that Powell's firing will likely hinge on his speech at Jackson Hole at the end of the month.\n\nIf Powell opens the door to a September cut, Trump will not fire him.\n\nIf Powell pushes back on a September cut, Trump will move to fire him.\n\nPowell will not leave, and they will go to court to sort this out. At this point, everything hits the fan.",
    "bias": "Recency Bias",
    "id": "1951381450647019950"
  },
  {
    "user": "@KeithMcCullough",
    "text": "\"Temporal goods are subject to man, that he may use them according to his needs, not that he should make them his main purpose, or be overly anxious about them” -St Thomas Aquinas",
    "bias": "None",
    "id": "1951582017239322811"
  },
  {
    "user": "@KeithMcCullough",
    "text": "1 down day and panic resumes",
    "bias": "Panic / Capitulation",
    "id": "1951579168673550369"
  },
  {
    "user": "@HedgeyeRJM",
    "text": "Thank you to everyone (and especially @Hedgeye Nation) for your incredible support during our first month with @HedgeyeAM! 🤜🤛\n\nGrateful to be part of this journey alongside @dsaleminvestor, @KeithMcCullough, and @mablum. \n\nWishing you all a great weekend!",
    "bias": "Loss Aversion",
    "id": "1951392509935915176"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Never have so many expert \"bears\" been born with $SPX -2.5% from its all-time highs",
    "bias": "Overconfidence",
    "id": "1951372543664988596"
  },
  {
    "user": "@KeithMcCullough",
    "text": "When payroll revisions cascade through hours worked, income, savings, & PCE, you’re not ‘adjusting assumptions’—you’re invalidating conclusions\n\nBS at the BLS",
    "bias": "None",
    "id": "1951370998307004518"
  },
  {
    "user": "@KeithMcCullough",
    "text": "7 mins left to setup for next week",
    "bias": "None",
    "id": "1951370469958992033"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Good to see you back, engaging in our community, Jimmy!",
    "bias": "None",
    "id": "1951370342603104312"
  },
  {
    "user": "@KeithMcCullough",
    "text": "I'm not supposed to have feelings, but I do love days like today",
    "bias": "None",
    "id": "1951369731493208253"
  },
  {
    "user": "@KeithMcCullough",
    "text": "“It ain't what you don't know that gets you into trouble. It's what you know for sure that just ain't so.” -Twainer",
    "bias": "None",
    "id": "1951366826677416115"
  },
  {
    "user": "@KeithMcCullough",
    "text": "If there was an old wall way of thinking, this is it. Assuming you've never run a major Hedge Fund using modern day AI, multi-factor algos, fractals, etc...",
    "bias": "Herd / Bandwagon",
    "id": "1951366456110715141"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The Old Wall way of \"seeing risk\" using single factor Moving Monkey \"charts\" blows the AI and fractal mind",
    "bias": "None",
    "id": "1951365686841766099"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Are those Moving Monkeys?",
    "bias": "None",
    "id": "1951365084501901387"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Refreshed $SPX Risk Range in that last Real-Time Alert and Buy Signal",
    "bias": "Recency Bias",
    "id": "1951364819799736587"
  },
  {
    "user": "@KeithMcCullough",
    "text": "These BLS (Labor Data) stats have been BS for a VERY long time, under BOTH Administrations",
    "bias": "None",
    "id": "1951358449549451278"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Bye Bye BLS (BS) Bureaucrats",
    "bias": "None",
    "id": "1951357942562955467"
  },
  {
    "user": "@Hedgeye",
    "text": "Scott Bessent as Fed Chair? Jamie Dimon Treasury Secretary?\n\nFormer Fed insider Danielle @DiMartinoBooth explores some very interesting possibilities in a candid clip from her new \"Real Conversation\" with @KeithMcCullough.\n\nWatch the full interview — now available free on demand: app.hedgeye.com/insights/169…",
    "bias": "Herd / Bandwagon",
    "id": "1951311825280143697"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Sure, have the team @Hedgeye book him",
    "bias": "Herd / Bandwagon",
    "id": "1951356254535766400"
  },
  {
    "user": "@KeithMcCullough",
    "text": "Twain said write it down. I do. Every day.\n\nQQQ: ✅ TRADE & TREND intact\nDAX: ❌ Broke TRADE support\n\nThis isn’t emotional — it’s execution.\n\nThe notebook has numbers, not narratives.\n#MacroDiscipline #TheProcess #FractalMath",
    "bias": "FOMO",
    "id": "1951303850633146779"
  },
  {
    "user": "@KeithMcCullough",
    "text": "The #PIZOOKIE , YES!",
    "bias": "None",
    "id": "1951292090156974215"
  },
  {
    "user": "@KeithMcCullough",
    "text": "CHART OF THE DAY: See Which Markets We Are Buying the Dips in and Which We Are Not app.hedgeye.com/insights/169… via @hedgeye",
    "bias": "Contrarian",
    "id": "1951277516217266356"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Piper Sandler recently rated Palantir $PLTR at overweight, saying the stock \"has a one-of-a-kind growth + margin model that if proven durable could grow into a $24B run-rate by CY32E.\"",
    "bias": "Recency Bias",
    "id": "1951625291606212705"
  },
  {
    "user": "@Beth_Kindig",
    "text": "TSMC’s $TSM second fab in Kumamoto reportedly could be postponed by up to 1.5 years, pushing commercial operations to the first half of 2029.",
    "bias": "None",
    "id": "1951339896423195121"
  },
  {
    "user": "@Beth_Kindig",
    "text": "AI storage platform Vast Data is said to be in talks with current backer Nvidia $NVDA and Alphabet's $GOOG VC arm for a fresh funding round valuing the firm at $30 billion, up more than 3x from its 2023 valuation of $9.1 billion.",
    "bias": "Recency Bias",
    "id": "1951317259168932185"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Google $GOOG reportedly deployed a massive 100,000 TPU v6 chip cluster to run its Gemini 2.0 model.\n\n$AVGO $NVDA",
    "bias": "None",
    "id": "1951291782483812471"
  },
  {
    "user": "@Beth_Kindig",
    "text": "Capturing just 3% of equities trading would double the current crypto market.\n\n$COIN",
    "bias": "Recency Bias",
    "id": "1951082754751504510"
  },
  {
    "user": "@RedDogT3",
    "text": "If you don't have $$, spend a little time learnings:\n\nFree trading education:\n\nt3live.com/learning-center/s…",
    "bias": "None",
    "id": "1951634337679765678"
  },
  {
    "user": "@RedDogT3",
    "text": "The best players in the World do the little things at the highest levels!",
    "bias": "Euphoria / Greed",
    "id": "1951632287411400967"
  },
  {
    "user": "@RedDogT3",
    "text": "",
    "bias": "None",
    "id": "1951630193484849659"
  },
  {
    "user": "@RedDogT3",
    "text": "This is what a recruitment camp looks like.  Lotta kids for a few spots!👀",
    "bias": "None",
    "id": "1951629496185983343"
  },
  {
    "user": "@RebellioMarket",
    "text": "30 Topics To Study In This Month:\n1:candle patterns  \n2:chart patterns  \n3: Trend lines \n4:S&R Areas \n5:Key Levels \n 6:Zones \n7: Confluence \n 8: Momentum  \n9:MACD \n10:RSI \n11: Stochastic/RSI \n12:Supply/ Demand  \n14:Elliot waves \n15:Risk/ Reward  \n16:Master candle  \n17:Retest Method  \n18:Tokyo break \n19:Nep trading \n20:Trend following  \n21:Major Reversals \n22:Pivot points  \n23:Zone break \n24: Rejection  \n25:Price action  \n26: Momentum Oscillator  \n27: Fundamentals  \n28: Trailing Stop \n29:Risk management & \n\n30: Fibonacci Retracements . \n\nI SWEAR YOUR COMFORT ZONE IS YOUR KILLING ZONE.",
    "bias": "FOMO",
    "id": "1951374488157003970"
  },
  {
    "user": "@RedDogT3",
    "text": "If ur a Rocky Fan and a Jimmy Fan!  This four minute video can make u think a bit. \nGreat on a walk or run. \n\npiped.video/QW3NsDR34aM?si=O3Oz…",
    "bias": "None",
    "id": "1951600802579005589"
  },
  {
    "user": "@RedDogT3",
    "text": "Good morning. \nNew month make changes.  If u want change!",
    "bias": "None",
    "id": "1951594205379236157"
  },
  {
    "user": "@RedDogT3",
    "text": "Follow the rules and good things happen:",
    "bias": "None",
    "id": "1951422441185493406"
  },
  {
    "user": "@icomaki2",
    "text": "Nice timing with those $UVXY calls Smart move adding them to your portfolio this week. Definitely helps balance out when other trades don't perform as expected.",
    "bias": "Overconfidence",
    "id": "1951376461073621443"
  },
  {
    "user": "@TrendSpider",
    "text": "I guess that's why Bezos was selling into every rip...\n\n$AMZN got cooked. 🫠",
    "bias": "None",
    "id": "1951123219513221332"
  },
  {
    "user": "@TrendSpider",
    "text": "Has there been a more frustrating stock to own since the April lows?  $AAPL 🤬",
    "bias": "None",
    "id": "1951346245253079119"
  },
  {
    "user": "@RedDogT3",
    "text": "Glad we started buying $UVXY calls Monday and accumulated them this week. It helped with some trailers that didn’t work",
    "bias": "None",
    "id": "1951376260292288683"
  },
  {
    "user": "@RedDogT3",
    "text": "Have a great weekend.",
    "bias": "None",
    "id": "1951374782131478690"
  },
  {
    "user": "@RedDogT3",
    "text": "Slower calendar next week, but let's stay on the hunt for opportunities.\n\nGet Monday's newsletter: t3live.com/scott-free-newsle…",
    "bias": "Herd / Bandwagon",
    "id": "1951362043417612525"
  },
  {
    "user": "@RedDogT3",
    "text": "$spy midday glance",
    "bias": "None",
    "id": "1951326945842458674"
  },
  {
    "user": "@RedDogT3",
    "text": "Sold a third of those $UVXY calls i said I was accumulating in the #630club this week",
    "bias": "None",
    "id": "1951282473700057561"
  },
  {
    "user": "@RedDogT3",
    "text": "$spy next level $617.50-$619ish",
    "bias": "None",
    "id": "1951282278207734125"
  },
  {
    "user": "@RedDogT3",
    "text": "$spy glance post NFP as yesterday gave ways to manage positions and risk",
    "bias": "Recency Bias",
    "id": "1951265048845832681"
  },
  {
    "user": "@RedDogT3",
    "text": "Do u develop ur “go time”?",
    "bias": "None",
    "id": "1951229116759277937"
  },
  {
    "user": "@RedDogT3",
    "text": "Theses typically help. Especially yesterday into today.",
    "bias": "Recency Bias",
    "id": "1951219806633373708"
  },
  {
    "user": "@alphatrends",
    "text": "Stock Market & Crypto Analysis for Week Ending 8/1/25\n\n$SPY $QQQ #Bitcoin $AAPL $SMH $NVDA $AMZN $GOOGL $META $MSFT #Ethereum #Solana etc",
    "bias": "Confirmation Bias",
    "id": "1951450451033071762"
  },
  {
    "user": "@alphatrends",
    "text": "This means a lot to me\n\nThe most liked X post in the last 3 months was about he loss of ZZ\n\nthank you for being kind humans",
    "bias": "None",
    "id": "1951451583377764642"
  },
  {
    "user": "@alphatrends",
    "text": "",
    "bias": "None",
    "id": "1951089282069963026"
  },
  {
    "user": "@alphatrends",
    "text": "9 yo",
    "bias": "None",
    "id": "1951088375357907212"
  },
  {
    "user": "@alphatrends",
    "text": "We lost a very good companion and friend today.\n\nShe had a great life and added so much more to ours.  \n\nZinzan will be missed greatly. \n😢💔🐶",
    "bias": "None",
    "id": "1951088238883643888"
  },
  {
    "user": "@leadlagreport",
    "text": "2022 was the year when risk-off Treasuries failed to counter risk-on stocks as a hedge against volatility.\n\n2025 could be the flight-to-safety trade back into Treasuries finally returns.\n\nIf I’m right, the ATAC Credit Rotation ETF $JOJO can potentially benefit.\n\n🧵👇 (1/10)",
    "bias": "Herd / Bandwagon",
    "id": "1951277937774231610"
  },
  {
    "user": "@leadlagreport",
    "text": "The whole rally is built on speculative leverage.\n\nThe precursor to every single crash in history is leverage.",
    "bias": "FOMO",
    "id": "1951621778368848121"
  },
  {
    "user": "@leadlagreport",
    "text": "Alex want me ded",
    "bias": "None",
    "id": "1951618904607871068"
  },
  {
    "user": "@leadlagreport",
    "text": "The end of the world is the bull case.",
    "bias": "None",
    "id": "1951445690237985064"
  },
  {
    "user": "@leadlagreport",
    "text": "X seems quiet",
    "bias": "None",
    "id": "1951437232755421292"
  },
  {
    "user": "@leadlagreport",
    "text": "Don’t worry aliens will kill us before the stock market crashes",
    "bias": "Panic / Capitulation",
    "id": "1951409293808279789"
  },
  {
    "user": "@leadlagreport",
    "text": "Completely disagree given the lead-up to this was strength in Utilities, the Dollar, and long duration Treasuries coinciding with a complete reversal of small-cap momentum.\n\nThis isn’t 1 day.\n\nIt’s a risk-off rotation that was telegraphed if anyone listened.",
    "bias": "FOMO",
    "id": "1951405593219969461"
  },
  {
    "user": "@leadlagreport",
    "text": "Risk-off returns.\n\nI have been teasing this for a week noting the tone change.\n\nIt’s my turn.",
    "bias": "None",
    "id": "1951403448982970706"
  },
  {
    "user": "@petrock23",
    "text": "More like, it’s time to top off the TGA for $500b and roll $7t into Tbills.   So they force a couple months of rotation.",
    "bias": "None",
    "id": "1951395484368855526"
  },
  {
    "user": "@leadlagreport",
    "text": "Trump is going to get his rate cut for all the wrong reasons.\n\nThey will crash stocks to save bonds.\n\nMy turn.\n\nLike and repost if you understand this.",
    "bias": "Panic / Capitulation",
    "id": "1951390071577526384"
  },
  {
    "user": "@leadlagreport",
    "text": "The entire bull run was on bullshit and speculative leverage.\n\nFew understand this.",
    "bias": "FOMO",
    "id": "1951388139198755107"
  },
  {
    "user": "@KraneShares",
    "text": "We're proud to celebrate the 1-year anniversary of the KraneShares Artificial Intelligence & Technology ETF (Ticker: $AGIX). AGIX has helped open doors to transformative pre-IPO companies like @xai and @AnthropicAI, two of the most closely watched names in foundational AI. AGIX reflects our commitment to helping investors participate in the next wave of innovation. Read our press release: rebrand.ly/borsg94\nAGIX: rebrand.ly/w9f4u86",
    "bias": "None",
    "id": "1951387461520674976"
  },
  {
    "user": "@leadlagreport",
    "text": "I really want to finish this 10 day fast 7 days in but I also really want to finish this fucking French fry right now",
    "bias": "None",
    "id": "1951382137804038474"
  },
  {
    "user": "@leadlagreport",
    "text": "",
    "bias": "None",
    "id": "1951378960216105430"
  },
  {
    "user": "@leadlagreport",
    "text": "The DOGE AI Deregulation Decision Tool has already removed 1,083 regulations at HUD alone. This isn’t theoretical - it’s happening now. With a Sep 1 deadline for agencies to complete deregulation lists, we’re seeing real-time market impacts. $FMKT",
    "bias": "Euphoria / Greed",
    "id": "1951286781128614216"
  },
  {
    "user": "@fool_roo",
    "text": "Hey Mike new thought, FUCKED",
    "bias": "None",
    "id": "1951288550730719567"
  },
  {
    "user": "@leadlagreport",
    "text": "This is legit hilarious",
    "bias": "None",
    "id": "1951355647766962251"
  },
  {
    "user": "@leadlagreport",
    "text": "This is a far more dangerous starting position than pre-Tariff Tantrum. \n\nLeverage is higher.\n\nFew understand this.",
    "bias": "Euphoria / Greed",
    "id": "1951345403888034044"
  },
  {
    "user": "@leadlagreport",
    "text": "My turn.",
    "bias": "None",
    "id": "1951344602721472748"
  },
  {
    "user": "@leadlagreport",
    "text": "So basically job market strength is bullshit",
    "bias": "None",
    "id": "1951287666051301711"
  },
  {
    "user": "@markminervini",
    "text": "Worth repeating...",
    "bias": "None",
    "id": "1951336198670262514"
  },
  {
    "user": "@markminervini",
    "text": "Bingo!  Finally. 😎\nTreasuries jumped as a weak jobs report bolstered bets on Federal Reserve interest-rate cuts. Christopher Waller and Michelle Bowman urged the Fed to cut rates. Their dissents marked the first time two Fed governors voted against a decision taken by the Federal Open Market Committee in more than 30 years. Yes, I'm short the market, but this decline is normal and will likely be a short-lived pullback within a long term uptrend. For that reason, I'm only looking for a short term trade on the downside. minervini.com",
    "bias": "FOMO",
    "id": "1951285490365153541"
  }
]